---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_dataset.log
  log type:  text
 opened on:   1 Jun 2023, 17:23:28

. 
. * import dataset
. import delimited "$projectdir/output/input.csv", clear
(encoding automatically selected: ISO-8859-1)
(193 vars, 50,000 obs)

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/analysis/ado"

. 
. //describe
. //codebook
. 
. *********************************
. *       Convert strings to dates     *
. ********************************* 
. foreach var of varlist   covid_test_positive_date                               ///
>                                                  covid_test_positive_date2                              ///
>                                                  covid_test_positive_date3                              ///
>                                                  prior_covid_date                                       ///
>                                                  sotrovimab                                                             ///
>                                                  molnupiravir                                                   /// 
>                                                  paxlovid                                                               ///
>                                                  remdesivir                                                             ///
>                                                  casirivimab                                                    ///
>                                                  sotrovimab_not_start                                   ///
>                                                  molnupiravir_not_start                                 ///
>                                                  paxlovid_not_start                                             ///
>                                                  date_treated                                                   ///
>                                                  start_date                                                             ///
>                                                  drugs_do_not_use                                               ///
>                                                  drugs_consider_risk                                    ///
>                                                  last_vaccination_date                                  ///
>                                                  death_date                                                             ///
>                                                  dereg_date                                                     ///
>                                                  bmi_date_measured                                              ///
>                                                  creatinine_ctv3_date                                   ///
>                                                  creatinine_snomed_date                                 ///
>                                                  creatinine_short_snomed_date                   ///
>                                                  ae_diverticulitis_icd                                  ///
>                                                  ae_diverticulitis_snomed                               ///
>                                                  ae_diarrhoea_snomed                                    ///
>                                                  ae_taste_snomed                                                ///
>                                                  ae_taste_icd                                                   ///
>                                                  ae_rash_snomed                                                 ///
>                                                  ae_anaphylaxis_icd                                             ///
>                                                  ae_anaphylaxis_snomed                                  ///
>                                                  ae_anaphlaxis_ae                                               ///
>                                                  ae_drugreact_ae                                                ///
>                                                 ae_allergic_ae                                                  ///
>                                                  ae_rheumatoid_arthritis_snomed                 ///
>                                                  ae_rheumatoid_arthritis_icd                    ///
>                                                  ae_sle_ctv                                                             ///
>                                                  ae_sle_icd                                                             ///
>                                                  ae_psoriasis_snomed                                    ///
>                                                  ae_psoriatic_arthritis_snomed                  ///
>                                                  ae_ankylosing_spondylitis_ctv                  ///
>                                                  ae_ibd_snomed                                                  ///
>                                                  ae_diverticulitis_ae                                   ///
>                                                  ae_rheumatoid_arthritis_ae                             ///
>                                                  ae_sle_ae                                                              ///
>                                                  ae_psoriasis_ae                                                ///
>                                                  ae_psoriatic_arthritis_ae                              ///
>                                                  ae_ankylosing_spondylitis_ae                   ///
>                                                  ae_ibd_ae                                                              ///
>                                                  pre_diverticulitis_icd                             ///
>                                                  pre_diverticulitis_snomed                              ///
>                                                  pre_diarrhoea_snomed                                   ///
>                                                  pre_taste_snomed                                               ///
>                                                  pre_taste_icd                                                  ///
>                                                  pre_rash_snomed                                                ///
>                                                  pre_anaphylaxis_icd                                    ///
>                                                  pre_anaphylaxis_snomed                                 ///
>                                                  pre_drugreact_ae                                               ///
>                                                  pre_allergic_ae                                                ///
>                                                  pre_anaphlaxis_ae                                              ///
>                                                  pre_rheumatoid_arthritis_ae                    ///
>                                                  pre_ankylosing_spondylitis_ae                  ///
>                                                  pre_psoriasis_ae                                               ///
>                                                  pre_psoriatic_arthritis_ae                             ///
>                                                  pre_sle_ae                                                             ///
>                                                  pre_ibd_ae                                                             ///                      
>                                                  rheumatoid_arthritis_nhsd_snomed               ///
>                                                  rheumatoid_arthritis_nhsd_icd10                ///
>                                                  sle_nhsd_ctv                                                   ///
>                                                  sle_nhsd_icd10                                                 ///
>                                                  psoriasis_nhsd                                                 ///
>                                                  psoriatic_arthritis_nhsd                               ///
>                                                  ankylosing_spondylitis_nhsd                    ///
>                                                  ibd_ctv                                                                ///
>                                                  allcause_emerg_aande                                   ///
>                                                  all_hosp_date                                                  ///
>                                                  all_hosp_date0                                                 ///
>                                                  all_hosp_date1                                                 ///
>                                                  all_hosp_date2                                                 ///
>                                                  hosp_discharge_date                                    ///
>                                                  hosp_discharge_date0                                   ///
>                                                  hosp_discharge_date1                                   ///
>                                                  hosp_discharge_date2                                   ///
>                                                  covid_hosp_date                                                ///
>                                                  covid_hosp_date0                                               ///
>                                                  covid_hosp_date1                                               ///
>                                                  covid_hosp_date2                                               ///                                             
>                                                  covid_discharge_date                                   ///
>                                                  covid_discharge_date0                                  ///                                             
>                                                  covid_discharge_date1                                  /// 
>                                                  covid_discharge_date2                                  /// 
>                                                  any_covid_hosp_discharge                               ///                     
>                                                  covid_hosp_date_mabs                                   /// 
>                                                  covid_hosp_date_mabs_not_primary               /// 
>                                                  died_date_ons                                                  ///
>                                                  died_ons_covid {                                        
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(29,488 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)

. 
. ****************************
. *       EXPOSURE                *
. ****************************
. ** removing individuals who did not start therapy
. foreach var of varlist sotrovimab molnupiravir paxlovid {
  2.     display "`var'"
  3.         count if `var'!=.
  4.         count if `var'==date_treated & `var'!=. & date_treated!=.
  5.         gen `var'_start = 1 if `var'==date_treated & `var'!=. & date_treated!=. & `var'_not_start==.
  6.         replace `var'_start = 0 if `var'==date_treated & `var'!=. & date_treated!=. & `var'_not_start!=.
  7.         tab `var'_start, m  //number on treatment, first drug given, and drug was started
  8. }
sotrovimab
  5,000
  4,149
(45,886 missing values generated)
(35 real changes made)

sotrovimab_ |
      start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         35        0.07        0.07
          1 |      4,114        8.23        8.30
          . |     45,851       91.70      100.00
------------+-----------------------------------
      Total |     50,000      100.00
molnupiravir
  5,000
  4,082
(45,963 missing values generated)
(45 real changes made)

molnupiravi |
    r_start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         45        0.09        0.09
          1 |      4,037        8.07        8.16
          . |     45,918       91.84      100.00
------------+-----------------------------------
      Total |     50,000      100.00
paxlovid
  5,000
  4,117
(45,931 missing values generated)
(48 real changes made)

paxlovid_st |
        art |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         48        0.10        0.10
          1 |      4,069        8.14        8.23
          . |     45,883       91.77      100.00
------------+-----------------------------------
      Total |     50,000      100.00

. gen drug=1 if sotrovimab==date_treated & sotrovimab_start==1 
(45,886 missing values generated)

. replace drug=2 if paxlovid==date_treated & paxlovid_start==1
(4,069 real changes made)

. replace drug=3 if molnupiravir==date_treated & molnupiravir_start==1
(4,037 real changes made)

. replace drug=4 if sotrovimab==date_treated & sotrovimab_start==0 
(35 real changes made)

. replace drug=5 if paxlovid==date_treated & paxlovid_start==0 
(48 real changes made)

. replace drug=6 if molnupiravir==date_treated & molnupiravir_start==0 
(45 real changes made)

. replace drug=7 if remdesivir==date_treated&remdesivir!=.&date_treated!=.
(4,054 real changes made)

. replace drug=8 if casirivimab==date_treated&casirivimab!=.&date_treated!=.
(4,120 real changes made)

. replace drug=0 if drug==.
(29,488 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir", replace

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     29,488       58.98       58.98
  sotrovimab |      4,112        8.22       67.20
    paxlovid |      4,066        8.13       75.33
molnupiravir |      4,033        8.07       83.40
           4 |         35        0.07       83.47
           5 |         48        0.10       83.56
           6 |         45        0.09       83.65
           7 |      4,053        8.11       91.76
           8 |      4,120        8.24      100.00
-------------+-----------------------------------
       Total |     50,000      100.00

. drop if drug>3
(8,301 observations deleted)

. ** start date is date treatment for treatment arms and date of covid test for control arm 
. count if start_date==. //should be 0
  2,977

. count if start_date!=covid_test_positive_date & drug==0
  26,511

. count if start_date!=date_treated & drug>0
  12,211

. replace start_date=covid_test_positive_date if drug==0 
(26,511 real changes made)

. replace start_date=date_treated if drug>0
(12,211 real changes made)

. ** check number of positive covid tests prior to drug in treatment arms
. bys drug:count if covid_test_positive_date==. // should be 0 in control arm

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,977
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  405
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  394
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  396

. bys drug:count if covid_test_positive_date!=. 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  26,511
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3,707
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3,672
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3,637

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& date_treated>covid_test_positive_date //test prior to treatment

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1,731
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1,726
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1,661

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& (date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5) //test <5d

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  29
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  34
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  35

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& date_treated<covid_test_positive_date2 //2nd covid episode prior to treatment 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  231
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  234
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  198

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& (date_treated-covid_test_positive_date2>0)&(date_treated-covid_test_positive_date2<=5) //test <5d

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  6

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& date_treated<covid_test_positive_date3 //3rd covid episode prior to treatment 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  218
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  233
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  228

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& (date_treated-covid_test_positive_date3>0)&(date_treated-covid_test_positive_date3<=5) //test <5d

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5

. ** check in control group that covid positive, and not repeat covid test after an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days if drug==0

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,765        154 |     2,919 
         1 |    25,255      1,314 |    26,569 
-----------+----------------------+----------
     Total |    28,020      1,468 |    29,488 

. drop if drug==0 & covid_test_positive==1 & covid_positive_previous_30_days==1
(1,314 observations deleted)

. ** gen study start and study end date
. gen campaign_start=mdy(12,16,2021)

. gen study_end_date=mdy(06,01,2023)

. gen start_date_29=date_treated+28
(28,174 missing values generated)

. format campaign_start study_end_date start_date_29 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ** inclusion criteria*
. keep if age>=18 & age<110
(8,761 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(1,573 observations deleted)

. ** exclusion criteria*
. count if start_date>dereg_date & start_date!=.
  2,744

. count if start_date>death_date & start_date!=.
  2,762

. drop if start_date>death_date | start_date>dereg_date
(5,613 observations deleted)

. 
. ** high risk cohort from blueteq therapeutics datafor drug arms
. tab high_risk_cohort_therapeutics drug,m //should be 0 in control group

high_risk_cohort_ther |                    drug
             apeutics |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
       Downs syndrome |     1,684        257        249        243 |     2,433 
          HIV or AIDS |       856        120        134        125 |     1,235 
                 IMID |     1,730        219        245        238 |     2,432 
    IMID,solid cancer |     1,621        261        242        239 |     2,363 
                   NA |       841        119        123        114 |     1,197 
haematological dise.. |       826        127        129        123 |     1,205 
haematological mali.. |       788        122        104        117 |     1,131 
        liver disease |       851        140        121        122 |     1,234 
primary immune defi.. |     1,794        252        234        236 |     2,516 
sickle cell disease.. |     1,761        247        245        252 |     2,505 
         solid cancer |     1,706        268        241        272 |     2,487 
solid organ transpl.. |     1,713        250        250        253 |     2,466 
stem cell transplan.. |       870        129        131        104 |     1,234 
----------------------+--------------------------------------------+----------
                Total |    17,041      2,511      2,448      2,438 |    24,438 

. gen downs_syndrome_therap= 1 if strpos(high_risk_cohort_therapeutics, "Downs syndrome")
(22,005 missing values generated)

. gen solid_cancer_therap=1 if strpos(high_risk_cohort_therapeutics, "solid cancer")
(19,588 missing values generated)

. gen haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematological malignancies")
(23,307 missing values generated)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "sickle cell disease")
(2,505 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematological diseases")
(1,205 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "stem cell transplant")
(1,234 real changes made)

. gen renal_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "renal disease")
(21,972 missing values generated)

. gen liver_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "liver disease")
(23,204 missing values generated)

. gen imid_on_drug_therap= 1 if strpos(high_risk_cohort_therapeutics, "IMID")
(19,643 missing values generated)

. gen immunosupression_therap= 1 if strpos(high_risk_cohort_therapeutics, "primary immune deficiencies")
(21,922 missing values generated)

. gen hiv_aids_therap= 1 if strpos(high_risk_cohort_therapeutics, "HIV or AIDS")
(23,203 missing values generated)

. gen organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "solid organ recipients")
(24,438 missing values generated)

. replace organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "solid organ transplant")
(2,466 real changes made)

. gen rare_neuro_therap= 1 if strpos(high_risk_cohort_therapeutics, "rare neurological conditions")
(21,933 missing values generated)

. bys drug: count if high_risk_cohort_therapeutics!=""&high_risk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer_therap,haem_disease_therap,renal_disease_therap,liver_disease_thera
> p,imid_on_drug_therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==. //check if all diseases have been captured

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  841
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  119
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  123
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  114

. tab drug high_risk_cohort_therapeutics if high_risk_cohort_therapeutics!=""&high_risk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer_therap,haem_disease_therap,renal_disease_the
> rap,liver_disease_therap,imid_on_drug_therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==.

             | high_risk_
             | cohort_the
             | rapeutics
        drug |        NA |     Total
-------------+-----------+----------
     control |       841 |       841 
  sotrovimab |       119 |       119 
    paxlovid |       123 |       123 
molnupiravir |       114 |       114 
-------------+-----------+----------
       Total |     1,197 |     1,197 

. foreach var of varlist downs_syndrome_therap solid_cancer_therap haem_disease_therap renal_disease_therap liver_disease_therap imid_on_drug_therap immunosupression_therap hiv_aids_therap organ_transp
> lant_therap rare_neuro_therap{
  2.         replace `var'=0 if `var'==. 
  3. }
(22,005 real changes made)
(19,588 real changes made)
(18,363 real changes made)
(21,972 real changes made)
(23,204 real changes made)
(19,643 real changes made)
(21,922 real changes made)
(23,203 real changes made)
(21,972 real changes made)
(21,933 real changes made)

. 
. ** high risk cohort from open codelist from control group
. tab high_risk_cohort_nhsd drug,m //should be no 0s in control group

high_risk_ |
cohort_nhs |                    drug
         d |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |       345         51         46         53 |       495 
         1 |    16,696      2,460      2,402      2,385 |    23,943 
-----------+--------------------------------------------+----------
     Total |    17,041      2,511      2,448      2,438 |    24,438 

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be 0
  6,624

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & downs_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0
>  &rare_neuro==0
  276

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 //should be 0
  268

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 & downs_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0
>  &rare_neuro==0
  9

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  239

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 
  229

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_drug==1
  111

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_drug==1 &downs_syndrome==0 &solid_cancer==0 &ha
> em_disease==0 &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  7

. replace imid_on_drug=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_drug==1 //ignore if steriods<4
>  scripts in 6m & not coded other imid drug 
(111 real changes made)

. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 //ignore if steriods<4 scripts in 6m
(239 real changes made)

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be same number as those dropped above 
  6,624

. replace imid_on_drug=0 if imid_nhsd==1 & imid_drug==0 
(6,624 real changes made)

. replace imid_on_drug=0 if imid_nhsd==0 & imid_drug==1 
(222 real changes made)

. gen high_risk_cohort_codelist=((downs_syndrome + solid_cancer + haem_disease + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids + organ_transplant + rare_neuro )>0)

. tab high_risk_cohort_nhsd high_risk_cohort_codelist

high_risk_ | high_risk_cohort_code
cohort_nhs |         list
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |       495          0 |       495 
         1 |       289     23,654 |    23,943 
-----------+----------------------+----------
     Total |       784     23,654 |    24,438 

. 
. ** combine two high risk cohorts into one 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids organ_transplant rare_neuro {
  2.         gen `var'_comb = `var'
  3.         replace `var'_comb = 1 if `var'_therap==1 
  4.         tab `var' `var'_therap 
  5.         tab `var'_comb
  6. }
(1,966 real changes made)

downs_synd | downs_syndrome_therap
      rome |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,795      1,966 |    19,761 
         1 |     4,210        467 |     4,677 
-----------+----------------------+----------
     Total |    22,005      2,433 |    24,438 

downs_syndr |
   ome_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,795       72.82       72.82
          1 |      6,643       27.18      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(4,366 real changes made)

solid_canc |  solid_cancer_therap
        er |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,641      4,366 |    22,007 
         1 |     1,947        484 |     2,431 
-----------+----------------------+----------
     Total |    19,588      4,850 |    24,438 

solid_cance |
     r_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,641       72.19       72.19
          1 |      6,797       27.81      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(3,194 real changes made)

haem_disea |  haem_disease_therap
        se |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,644      3,194 |    12,838 
         1 |     8,719      2,881 |    11,600 
-----------+----------------------+----------
     Total |    18,363      6,075 |    24,438 

haem_diseas |
     e_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,644       39.46       39.46
          1 |     14,794       60.54      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(1,627 real changes made)

renal_dise | renal_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,334      1,627 |    15,961 
         1 |     7,638        839 |     8,477 
-----------+----------------------+----------
     Total |    21,972      2,466 |    24,438 

renal_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,334       58.65       58.65
          1 |     10,104       41.35      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(1,018 real changes made)

liver_dise | liver_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,803      1,018 |    19,821 
         1 |     4,401        216 |     4,617 
-----------+----------------------+----------
     Total |    23,204      1,234 |    24,438 

liver_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,803       76.94       76.94
          1 |      5,635       23.06      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(3,733 real changes made)

imid_on_dr |  imid_on_drug_therap
        ug |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,528      3,733 |    19,261 
         1 |     4,115      1,062 |     5,177 
-----------+----------------------+----------
     Total |    19,643      4,795 |    24,438 

imid_on_dru |
     g_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,528       63.54       63.54
          1 |      8,910       36.46      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(2,253 real changes made)

           | immunosupression_ther
immunosupr |          ap
    ession |         0          1 |     Total
-----------+----------------------+----------
         0 |    19,803      2,253 |    22,056 
         1 |     2,119        263 |     2,382 
-----------+----------------------+----------
     Total |    21,922      2,516 |    24,438 

immunosupre |
 ssion_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,803       81.03       81.03
          1 |      4,635       18.97      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(1,009 real changes made)

           |    hiv_aids_therap
  hiv_aids |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,787      1,009 |    19,796 
         1 |     4,416        226 |     4,642 
-----------+----------------------+----------
     Total |    23,203      1,235 |    24,438 

hiv_aids_co |
         mb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,787       76.88       76.88
          1 |      5,651       23.12      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(1,657 real changes made)

           | organ_transplant_ther
organ_tran |          ap
    splant |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,087      1,657 |    16,744 
         1 |     6,885        809 |     7,694 
-----------+----------------------+----------
     Total |    21,972      2,466 |    24,438 

organ_trans |
 plant_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,087       61.74       61.74
          1 |      9,351       38.26      100.00
------------+-----------------------------------
      Total |     24,438      100.00
(1,038 real changes made)

           |   rare_neuro_therap
rare_neuro |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,476      1,038 |    10,514 
         1 |    12,457      1,467 |    13,924 
-----------+----------------------+----------
     Total |    21,933      2,505 |    24,438 

rare_neuro_ |
       comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,476       38.78       38.78
          1 |     14,962       61.22      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. 
. ****************************
. *       OUTCOME         *
. ****************************
. *** Primary outcome - AESI
. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(20,546 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(20,570 missing values generated)

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(20,401 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(20,499 missing values generated)

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(19,992 missing values generated)

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_nhsd==0
(19,959 missing values generated)

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondylitis_nhsd==0
(20,012 missing values generated)

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(20,056 missing values generated)

. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed                             ///
>                                                 ae_taste_snomed                                         

. global ae_spc_icd               ae_diverticulitis_icd                   ///
>                                                 ae_taste_icd                                    

. global ae_spc_emerg             ae_diverticulitis_ae                                                                    

. global ae_drug                  ae_anaphylaxis_snomed                   ///     
>                                                 ae_rash_snomed  

. global ae_drug_emerg    ae_anaphlaxis_ae                                ///
>                                                 ae_drugreact_ae                                 ///
>                                                 ae_allergic_ae                                                                                      

. global ae_drug_icd              ae_anaphylaxis_icd

. global ae_imae                  new_ae_ra_snomed                                ///
>                                                 new_ae_sle_ctv                                  ///
>                                                 new_ae_psoriasis_snomed                 ///
>                                                 new_ae_psa_snomed                               ///
>                                                 new_ae_ankspon_ctv                              ///
>                                                 new_ae_ibd      

. global ae_imae_icd              new_ae_ra_icd                                   ///
>                                                 new_ae_sle_icd          

. global ae_imae_emerg    ae_rheumatoid_arthritis_ae              ///
>                                                 ae_sle_ae                                               ///
>                                                 ae_psoriasis_ae                                 ///
>                                                 ae_psoriatic_arthritis_ae               ///
>                                                 ae_ankylosing_spondylitis_ae    ///
>                                                 ae_ibd_ae                               

.                                                                         
. *remove event if occurred before start (including new start date for control)
. foreach x in $ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug_emerg $ae_imae $ae_imae_icd $ae_drug_emerg{
  2.                                 display "`x'"
  3.                                 count if (`x' > start_date | `x' < start_date + 28) & `x'!=. 
  4.                                 count if (`x' < start_date | `x' > start_date + 28) & `x'!=. & drug==0
  5.                                 count if (`x' < start_date | `x' > start_date + 28) & `x'!=. & drug>0
  6.                                 replace `x'=. if (`x' < start_date | `x' > start_date + 28) & `x'!=.
  7. }
ae_diverticulitis_snomed
  4,851
  3,202
  1,419
(4,621 real changes made, 4,621 to missing)
ae_diarrhoea_snomed
  4,916
  3,286
  1,410
(4,696 real changes made, 4,696 to missing)
ae_taste_snomed
  4,912
  3,329
  1,328
(4,657 real changes made, 4,657 to missing)
ae_diverticulitis_icd
  4,918
  3,325
  1,363
(4,688 real changes made, 4,688 to missing)
ae_taste_icd
  4,846
  3,224
  1,400
(4,624 real changes made, 4,624 to missing)
ae_diverticulitis_ae
  4,850
  3,192
  1,412
(4,604 real changes made, 4,604 to missing)
ae_anaphylaxis_snomed
  4,905
  3,218
  1,445
(4,663 real changes made, 4,663 to missing)
ae_rash_snomed
  4,911
  3,240
  1,401
(4,641 real changes made, 4,641 to missing)
ae_anaphylaxis_icd
  4,882
  3,206
  1,418
(4,624 real changes made, 4,624 to missing)
ae_anaphlaxis_ae
  4,885
  3,215
  1,441
(4,656 real changes made, 4,656 to missing)
ae_drugreact_ae
  4,934
  3,278
  1,396
(4,674 real changes made, 4,674 to missing)
ae_allergic_ae
  4,859
  3,219
  1,394
(4,613 real changes made, 4,613 to missing)
new_ae_ra_snomed
  3,868
  2,532
  1,143
(3,675 real changes made, 3,675 to missing)
new_ae_sle_ctv
  3,939
  2,646
  1,093
(3,739 real changes made, 3,739 to missing)
new_ae_psoriasis_snomed
  4,446
  2,946
  1,286
(4,232 real changes made, 4,232 to missing)
new_ae_psa_snomed
  4,479
  2,985
  1,268
(4,253 real changes made, 4,253 to missing)
new_ae_ankspon_ctv
  4,426
  2,893
  1,301
(4,194 real changes made, 4,194 to missing)
new_ae_ibd
  4,382
  2,899
  1,232
(4,131 real changes made, 4,131 to missing)
new_ae_ra_icd
  3,892
  2,596
  1,126
(3,722 real changes made, 3,722 to missing)
new_ae_sle_icd
  4,037
  2,665
  1,159
(3,824 real changes made, 3,824 to missing)
ae_anaphlaxis_ae
  229
  0
  0
(0 real changes made)
ae_drugreact_ae
  260
  0
  0
(0 real changes made)
ae_allergic_ae
  246
  0
  0
(0 real changes made)

. egen ae_spc_gp = rmin($ae_spc)
(23,740 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(23,990 missing values generated)

. egen ae_spc_emerg = rmin($ae_spc_emerg)
(24,192 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg)
(23,074 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(23,928 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(24,180 missing values generated)

. egen ae_drug_emerg = rmin($ae_drug_emerg)
(23,713 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd $ae_drug_emerg)
(22,979 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)
(23,158 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(24,057 missing values generated)

. egen ae_imae_emerg = rmin($ae_imae_emerg)
(6,460 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd $ae_imae_emerg)   
(6,038 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug_emerg $ae_imae $ae_imae_icd $ae_imae_emerg)
(5,357 missing values generated)

. egen ae_all_serious = rmin($ae_spc_icd $ae_spc_emerg $ae_drug_icd $ae_drug_emerg $ae_imae_icd $ae_imae_emerg)
(5,908 missing values generated)

. by drug, sort: count if ae_spc_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  906
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  156
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  145
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  157

. by drug, sort: count if ae_drug_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  990
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  153
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  148
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  168

. by drug, sort: count if ae_imae_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  12,780
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1,939
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1,842
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1,839

. by drug, sort: count if ae_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  13,237
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2,011
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1,912
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1,921

. 
. *generate rate for adverse outcome in year 3-4 prior to start date for comparative rate by person years  
. global pre_ae                    pre_diverticulitis_icd                             ///
>                                                  pre_diverticulitis_snomed                              ///
>                                                  pre_diarrhoea_snomed                                   ///
>                                                  pre_taste_snomed                                               ///
>                                                  pre_taste_icd                                                  ///
>                                                  pre_rash_snomed                                                ///
>                                                  pre_anaphylaxis_icd                                    ///
>                                                  pre_anaphylaxis_snomed                                 ///
>                                                  pre_drugreact_ae                                               ///
>                                                  pre_allergic_ae                                                ///
>                                                  pre_anaphlaxis_ae                                              ///
>                                                  pre_rheumatoid_arthritis_ae                    ///
>                                                  pre_ankylosing_spondylitis_ae                  ///
>                                                  pre_psoriasis_ae                                               ///
>                                                  pre_psoriatic_arthritis_ae                             ///
>                                                  pre_sle_ae                                                             ///
>                                                  pre_ibd_ae                             

. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. bys drug: count if covid_hosp_date!=. // all covid hospitalisation

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,704
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  255
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  228
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  236

. bys drug: count if covid_hosp_date0!=. // hospitalisation after treatment date (control group will not have covid_hosp_date0)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  173
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  30
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  18
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  19

. // covid admission is the same date as date treated 
. bys drug: count if covid_hosp_date0!=date_treated&covid_hosp_date0!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  30
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  18
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  19

. bys drug: count if covid_hosp_date1!=(date_treated+1) &covid_hosp_date1!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  26
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  28
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  21

. // covid admission is the same date as date treated and is a daycase
. bys drug: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab and is a daycase or 24 hour admission
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&covid_hosp_date0==covid_discharge_date0

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&covid_hosp_date1==covid_discharge_date1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&(covid_discharge_date0 - covid_hosp_date0)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&(covid_discharge_date1 - covid_hosp_date1)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagre, or dischagre preceed admission 
. count if covid_hosp_date!=.&covid_discharge_date==.
  2,406

. count if covid_hosp_date==.&covid_discharge_date!=.
  225

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date==covid_discharge_date
  0

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date<covid_discharge_date
  11

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date>covid_discharge_date
  6

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.  
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date AND a mab procedures for sotro 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. *correcting ALL hosp events: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. bys drug: count if all_hosp_date!=. // all hospitalisation

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,703
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  248
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  233
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  242

. bys drug: count if all_hosp_date0!=. // hospitalisation after treatment date (control group will not have all_hosp_date0)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  173
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  26
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  16
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  24

. // admission is the same date as date treated 
. bys drug: count if all_hosp_date0!=date_treated&all_hosp_date0!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  26
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  16
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  24

. bys drug: count if all_hosp_date1!=(date_treated+1) &all_hosp_date1!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  23
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  32
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  22

. // admission is the same date as date treated and is a daycase
. bys drug: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all_hosp_date0==hosp_discharge_date0

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all_hosp_date1==hosp_discharge_date1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(hosp_discharge_date0-all_hosp_date0)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(hosp_discharge_date1-all_hosp_date1)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagre, or dischagre preceed admission 
. count if all_hosp_date!=.&hosp_discharge_date==.
  2,181

. count if all_hosp_date==.&hosp_discharge_date!=.
  2,176

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharge_date
  0

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge_date
  138

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge_date
  107

. // REPLACE - ignore covid admission if admission is for covid AND day 0 or day 1 after treatment AND daycase
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.
(0 real changes made)

. // REPLACE - ignore admission if admission is for covid AND day 0 or day 1 after treatment AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0==covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. foreach var of varlist covid_hosp_date all_hosp_date died_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' < start_date | `var' > start_date + 28) & `var'!=.                            
  4.                                 replace `var'=. if (`var' < start_date | `var' > start_date + 28) & `var'!=.
  5. }
covid_hosp_date

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,622
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  245
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  217
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  221
(2,305 real changes made, 2,305 to missing)
all_hosp_date

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,616
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  233
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  222
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  227
(2,298 real changes made, 2,298 to missing)
died_date_ons

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,854
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1,500
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1,422
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1,472
(14,248 real changes made, 14,248 to missing)

. 
. *** Secondary outcome - severe drug reactions (including DRESS, SJS, TEN, anaphylaxis) 
. 
. ****************************
. *       COVARIATES              *
. ****************************
. *Time between positive test and treatment*
. gen pre_drug_test=9 if drug>0 & covid_test_positive_date==. 
(23,736 missing values generated)

. replace pre_drug_test=99 if drug>0 & (date_treated-covid_test_positive_date<0)
(3,570 real changes made)

. replace pre_drug_test=2 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=7)
(86 real changes made)

. replace pre_drug_test=1 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5)
(68 real changes made)

. replace pre_drug_test=0 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=3)
(41 real changes made)

. label define pre_drug_test 0 "<3 days" 1 "3-5 days"  2 "5-7 days" 9 "more than 7 days" 99"treatment proceeds test", replace 

. label values pre_drug_test pre_drug_test

. tab pre_drug_test drug,m

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
              <3 days |         0         13         14         14 |        41 
             3-5 days |         0         10         11          6 |        27 
             5-7 days |         0          7          5          6 |        18 
     more than 7 days |         0        220        237        245 |       702 
treatment proceeds te |         0      1,214      1,174      1,182 |     3,570 
                    . |    17,041      1,047      1,007        985 |    20,080 
----------------------+--------------------------------------------+----------
                Total |    17,041      2,511      2,448      2,438 |    24,438 

. 
. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |     24,438    48.91632     19.0576         18        109

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |      8,875       36.32       36.32
      40-59 |      8,147       33.34       69.65
       >=60 |      7,416       30.35      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      2,657       10.87       10.87
        25- |      2,157        8.83       19.70
        30- |      2,029        8.30       28.00
        35- |      2,032        8.31       36.32
        40- |      1,859        7.61       43.92
        45- |      2,080        8.51       52.43
        50- |      2,181        8.92       61.36
        55- |      2,027        8.29       69.65
        60- |      1,650        6.75       76.41
        65- |      1,668        6.83       83.23
        70- |      1,442        5.90       89.13
        75- |      1,091        4.46       93.60
        80- |        779        3.19       96.78
        85- |        786        3.22      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. * Sex
. gen male = 1 if sex == "M"
(12,535 missing values generated)

. replace male = 0 if sex == "F"
(12,535 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(12,535 missing values generated)

. replace sex=1 if sex_str=="F"
(12,535 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     14,589       59.70       59.70
      Black |      1,024        4.19       63.89
      Mixed |        921        3.77       67.66
      Other |        938        3.84       71.50
South Asian |        966        3.95       75.45
      White |      6,000       24.55      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity                            
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. gen ethnicity_with_missing=ethnicity
(14,589 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(14,589 real changes made)

. gen White=1 if ethnicity==5
(18,438 missing values generated)

. replace White=0 if ethnicity!=5&ethnicity!=.
(3,849 real changes made)

. gen White_with_missing=White
(14,589 missing values generated)

. replace White_with_missing=9 if White==.
(14,589 real changes made)

. * IMD
. tab imdq5,m

             imdQ5 |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |      4,901       20.05       20.05
                 2 |      4,970       20.34       40.39
                 3 |      4,878       19.96       60.35
                 4 |      4,890       20.01       80.36
5 (least deprived) |      4,559       18.66       99.02
           Unknown |        240        0.98      100.00
-------------------+-----------------------------------
             Total |     24,438      100.00

. replace imdq5="." if imdq5=="Unknown" 
(240 real changes made)

. replace imdq5="1" if imdq5=="1 (most deprived)" 
(4,901 real changes made)

. replace imdq5="5" if imdq5=="5 (least deprived)" 
(4,559 real changes made)

. destring imdq5, replace
imdq5: all characters numeric; replaced as byte
(240 missing values generated)

. recode imdq5 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so 5 is more deprived)
(19320 changes made to imdq5)

. label define imdq5 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived", replace

. label values imdq5 imdq5

. gen imd_with_missing=imdq5
(240 missing values generated)

. replace imd_with_missing=9 if imdq5==.
(240 real changes made)

. tab imdq5,m

           imdQ5 |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      4,559       18.66       18.66
               2 |      4,890       20.01       38.67
               3 |      4,878       19.96       58.63
               4 |      4,970       20.34       78.96
 5 most deprived |      4,901       20.05       99.02
               . |        240        0.98      100.00
-----------------+-----------------------------------
           Total |     24,438      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,452       10.03       10.03
           East Midlands |      2,432        9.95       19.99
                  London |      4,825       19.74       39.73
              North East |      2,435        9.96       49.69
              North West |      2,536       10.38       60.07
              South East |      2,447       10.01       70.08
              South West |      2,417        9.89       79.97
           West Midlands |      2,388        9.77       89.75
Yorkshire and The Humber |      2,506       10.25      100.00
-------------------------+-----------------------------------
                   Total |     24,438      100.00

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,442        9.99        9.99
           East Midlands |      2,413        9.87       19.87
                  London |      4,942       20.22       40.09
              North East |      2,433        9.96       50.05
              North West |      2,442        9.99       60.04
              South East |      2,513       10.28       70.32
              South West |      2,421        9.91       80.23
           West Midlands |      2,437        9.97       90.20
Yorkshire and The Humber |      2,395        9.80      100.00
-------------------------+-----------------------------------
                   Total |     24,438      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,394        9.80        9.80
      STP10 |      2,418        9.89       19.69
       STP2 |      2,442        9.99       29.68
       STP3 |      2,449       10.02       39.70
       STP4 |      2,466       10.09       49.80
       STP5 |      2,445       10.00       59.80
       STP6 |      2,426        9.93       69.73
       STP7 |      2,431        9.95       79.68
       STP8 |      2,514       10.29       89.96
       STP9 |      2,453       10.04      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Other"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,394        9.80        9.80
      STP10 |      2,418        9.89       19.69
       STP2 |      2,442        9.99       29.68
       STP3 |      2,449       10.02       39.70
       STP4 |      2,466       10.09       49.80
       STP5 |      2,445       10.00       59.80
       STP6 |      2,426        9.93       69.73
       STP7 |      2,431        9.95       79.68
       STP8 |      2,514       10.29       89.96
       STP9 |      2,453       10.04      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
         bmi |    26.628  21.63918  27.49627  33.01604 -1.256315  62.49398
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(1,475 real changes made, 1,475 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*10 & (age+((bmi_date_measured-start_date)/365)>=18)
(24,438 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 & (age+((bmi_date_measured-start_date)/365)>=18)
(24,438 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 & (age+((bmi_date_measured-start_date)/365)>=18)
(24,438 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(1,475 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(1,475 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(1,475 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(1,475 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(1,475 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,987       89.97       89.97
          1 |      2,451       10.03      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,985       89.96       89.96
          1 |      2,453       10.04      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,052       90.24       90.24
          1 |      2,386        9.76      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,074       90.33       90.33
          1 |      2,364        9.67      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      2,460       10.07       10.07
          One vaccination |      2,440        9.98       20.05
       Three vaccinations |     12,144       49.69       69.74
         Two vaccinations |      2,533       10.37       80.11
            Un-vaccinated |      2,466       10.09       90.20
 Un-vaccinated (declined) |      2,395        9.80      100.00
--------------------------+-----------------------------------
                    Total |     24,438      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination_status_g=="Un-vaccinated (declined)"
(19,577 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(2,440 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(2,533 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(12,144 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinations"
(2,460 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(9,834 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(9,834 real changes made)

. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(3,501 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -427           -526
 5%         -301           -524
10%         -197           -523       Obs              20,937
25%            0           -522       Sum of wgt.      20,937

50%          275                      Mean            272.899
                        Largest       Std. dev.      350.6158
75%          544           1070
90%          746           1072       Variance       122931.4
95%          842           1079       Skewness       -.004405
99%          974           1079       Kurtosis       2.174696

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(3,501 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -17 |         13        0.05        0.05
        -16 |         40        0.16        0.22
        -15 |         79        0.32        0.54
        -14 |        128        0.52        1.06
        -13 |        171        0.70        1.76
        -12 |        189        0.77        2.54
        -11 |        192        0.79        3.32
        -10 |        250        1.02        4.35
         -9 |        232        0.95        5.30
         -8 |        323        1.32        6.62
         -7 |        319        1.31        7.92
         -6 |        379        1.55        9.47
         -5 |        441        1.80       11.28
         -4 |        450        1.84       13.12
         -3 |        459        1.88       15.00
         -2 |        484        1.98       16.98
         -1 |        530        2.17       19.15
          0 |        565        2.31       21.46
          1 |        567        2.32       23.78
          2 |        589        2.41       26.19
          3 |        536        2.19       28.38
          4 |        552        2.26       30.64
          5 |        592        2.42       33.06
          6 |        633        2.59       35.65
          7 |        541        2.21       37.87
          8 |        588        2.41       40.27
          9 |        556        2.28       42.55
         10 |        562        2.30       44.85
         11 |        603        2.47       47.32
         12 |        535        2.19       49.50
         13 |        583        2.39       51.89
         14 |        617        2.52       54.42
         15 |        586        2.40       56.81
         16 |        573        2.34       59.16
         17 |        555        2.27       61.43
         18 |        629        2.57       64.00
         19 |        572        2.34       66.34
         20 |        512        2.10       68.44
         21 |        502        2.05       70.49
         22 |        466        1.91       72.40
         23 |        453        1.85       74.25
         24 |        391        1.60       75.85
         25 |        360        1.47       77.33
         26 |        366        1.50       78.82
         27 |        315        1.29       80.11
         28 |        304        1.24       81.36
         29 |        248        1.01       82.37
         30 |        200        0.82       83.19
         31 |        173        0.71       83.90
         32 |        166        0.68       84.58
         33 |        109        0.45       85.02
         34 |         82        0.34       85.36
         35 |         48        0.20       85.56
         36 |         29        0.12       85.67
          . |      3,501       14.33      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)
(1,724 missing values generated)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3             -3
 5%           22             -3
10%           47             -3       Obs              22,714
25%          123             -3       Sum of wgt.      22,714

50%          255                      Mean           258.0081
                        Largest       Std. dev.      154.7932
75%          390            533
90%          477            533       Variance       23960.93
95%          504            533       Skewness       .0571419
99%          528            533       Kurtosis       1.807685

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)
(1,724 missing values generated)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        136        0.56        0.56
          1 |      1,415        5.79        6.35
          2 |      1,336        5.47       11.81
          3 |      1,333        5.45       17.27
          4 |      1,349        5.52       22.79
          5 |      1,307        5.35       28.14
          6 |      1,311        5.36       33.50
          7 |      1,304        5.34       38.84
          8 |      1,265        5.18       44.01
          9 |      1,282        5.25       49.26
         10 |      1,289        5.27       54.53
         11 |      1,182        4.84       59.37
         12 |      1,356        5.55       64.92
         13 |      1,195        4.89       69.81
         14 |      1,143        4.68       74.49
         15 |      1,211        4.96       79.44
         16 |      1,181        4.83       84.27
         17 |      1,218        4.98       89.26
         18 |        901        3.69       92.95
          . |      1,724        7.05      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. mkspline calendar_day_spline = day_after_campaign, cubic nknots(4)

. * Variant
. tab sgtf,m

       sgtf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,145       70.16       70.16
          1 |      2,518       10.30       80.46
          9 |      2,435        9.96       90.42
          . |      2,340        9.58      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab sgtf_new, m

   sgtf_new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,148       70.17       70.17
          1 |      2,453       10.04       80.21
          9 |      2,408        9.85       90.06
          . |      2,429        9.94      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. tab variant_recorded,m

variant_reco |
        rded |      Freq.     Percent        Cum.
-------------+-----------------------------------
             |      2,368        9.69        9.69
   B.1.617.2 |     17,085       69.91       79.60
VOC-21JAN-02 |      4,985       20.40      100.00
-------------+-----------------------------------
       Total |     24,438      100.00

. tab sgtf_new variant_recorded ,m

                |         variant_recorded
       sgtf_new |            B.1.617.2  VOC-21J.. |     Total
----------------+---------------------------------+----------
S gene detected |     1,709     11,925      3,514 |    17,148 
 confirmed SGTF |       230      1,760        463 |     2,453 
             NA |       202      1,689        517 |     2,408 
              . |       227      1,711        491 |     2,429 
----------------+---------------------------------+----------
          Total |     2,368     17,085      4,985 |    24,438 

. * Prior infection
. tab prior_covid, m

prior_covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,403        9.83        9.83
          1 |     22,035       90.17      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. gen prior_covid_index=1 if prior_covid==1 & prior_covid_date<campaign_start
(24,292 missing values generated)

. tab prior_covid_index,m

prior_covid |
     _index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        146        0.60        0.60
          . |     24,292       99.40      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. *Contraindications for Pax*
. tab drug if solid_organ==1
solid_organ ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\k1635179\AppData\Local\Temp\STD171c_000000.tmp"

. *Contraindications for Pax*
. tab drug if organ_transplant==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      5,373       69.83       69.83
  sotrovimab |        801       10.41       80.24
    paxlovid |        785       10.20       90.45
molnupiravir |        735        9.55      100.00
-------------+-----------------------------------
       Total |      7,694      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,661       68.78       68.78
  sotrovimab |        224        9.28       78.05
    paxlovid |        262       10.85       88.90
molnupiravir |        268       11.10      100.00
-------------+-----------------------------------
       Total |      2,415      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      5,886       69.43       69.43
  sotrovimab |        874       10.31       79.75
    paxlovid |        843        9.94       89.69
molnupiravir |        874       10.31      100.00
-------------+-----------------------------------
       Total |      8,477      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vaccine-breakthrough/blob/updates-feb/analysis/data_process.R*
. tab creatinine_operator_ctv3,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,403        9.83        9.83
          < |      1,188        4.86       14.69
         <= |      1,210        4.95       19.65
          = |     15,997       65.46       85.11
          > |      1,224        5.01       90.11
         >= |      1,184        4.84       94.96
          ~ |      1,232        5.04      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  57.02558  47.94107  58.87907  69.37883 -.0583282  117.5262
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_ctv3_date>start_date
(11,570 real changes made, 11,570 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.16155  49.93296  59.93615  70.08505  20.07491  117.5262
--------------------------------------------------------------------------

. tab creatinine_operator_ctv3 if creatinine_ctv3!=.,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      1,267        9.85        9.85
          < |        618        4.80       14.65
         <= |        624        4.85       19.50
          = |      8,423       65.46       84.95
          > |        684        5.32       90.27
         >= |        607        4.72       94.99
          ~ |        645        5.01      100.00
------------+-----------------------------------
      Total |     12,868      100.00

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(12,868 real changes made)

. gen min_creatinine_ctv3=.
(24,438 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(6,673 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(6,195 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(3,569 real changes made)

. gen max_creatinine_ctv3=.
(24,438 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(6,673 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(6,195 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(20,869 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(11,712 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(6,601 real changes made)

. tab creatinine_operator_snomed,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,458       10.06       10.06
          < |      1,253        5.13       15.19
         <= |      1,156        4.73       19.92
          = |     15,885       65.00       84.92
          > |      1,181        4.83       89.75
         >= |      1,262        5.16       94.91
          ~ |      1,243        5.09      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab creatinine_operator_snomed if creatinine_snomed!=.,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,458       10.06       10.06
          < |      1,253        5.13       15.19
         <= |      1,156        4.73       19.92
          = |     15,885       65.00       84.92
          > |      1,181        4.83       89.75
         >= |      1,262        5.16       94.91
          ~ |      1,243        5.09      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
cre~e_snomed |  22.50344         0         0  45.22602 -34.24242  118.8057
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(18,342 real changes made, 18,342 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(creatinine_snomed)
(12,276 real changes made, 3,100 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if missing(creatinine_snomed)
(10,149 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creatinine_snomed)
(18,127 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_snomed)
(18,342 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(14,065 real changes made, 14,065 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(10,373 real changes made)

. gen min_creatinine_snomed=.
(24,438 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(5,291 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(5,082 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(1,395 real changes made)

. gen max_creatinine_snomed=.
(24,438 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(5,291 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(5,082 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(23,043 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*(0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snomed<=120
(14,181 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(5,235 real changes made)

. tab egfr_operator if egfr_record!=.,m

eGFR_operat |
         or |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,419        9.90        9.90
          < |      1,209        4.95       14.85
         <= |      1,277        5.23       20.07
          = |     15,792       64.62       84.69
          > |      1,282        5.25       89.94
         >= |      1,223        5.00       94.94
          ~ |      1,236        5.06      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. tab egfr_short_operator if egfr_short_record!=.,m

eGFR_short_ |
   operator |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,499       10.23       10.23
          < |      1,238        5.07       15.29
         <= |      1,192        4.88       20.17
          = |     15,857       64.89       85.06
          > |      1,258        5.15       90.20
         >= |      1,239        5.07       95.27
          ~ |      1,155        4.73      100.00
------------+-----------------------------------
      Total |     24,438      100.00

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egfr_record>0&egfr_operator!=">"&egfr_operator!=
> ">=")|(egfr_short_record<60&egfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(21,230 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egfr_record>0&egfr_operator!=">"&egfr_operator!=
> ">=")|(egfr_short_record<30&egfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(23,748 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,223       69.30       69.30
  sotrovimab |        303        9.45       78.74
    paxlovid |        334       10.41       89.15
molnupiravir |        348       10.85      100.00
-------------+-----------------------------------
       Total |      3,208      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        462       66.96       66.96
  sotrovimab |         68        9.86       76.81
    paxlovid |         75       10.87       87.68
molnupiravir |         85       12.32      100.00
-------------+-----------------------------------
       Total |        690      100.00

. *drug interactions*
. tab drug if drugs_do_not_use<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,157       91.75       91.75
  sotrovimab |         60        2.55       94.30
    paxlovid |         65        2.76       97.07
molnupiravir |         69        2.93      100.00
-------------+-----------------------------------
       Total |      2,351      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,081       91.47       91.47
  sotrovimab |         60        2.64       94.11
    paxlovid |         65        2.86       96.97
molnupiravir |         69        3.03      100.00
-------------+-----------------------------------
       Total |      2,275      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,025       92.05       92.05
  sotrovimab |         57        2.59       94.64
    paxlovid |         58        2.64       97.27
molnupiravir |         60        2.73      100.00
-------------+-----------------------------------
       Total |      2,200      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,877       94.89       94.89
  sotrovimab |         33        1.67       96.56
    paxlovid |         36        1.82       98.38
molnupiravir |         32        1.62      100.00
-------------+-----------------------------------
       Total |      1,978      100.00

. tab drug if drugs_consider_risk<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,114       91.99       91.99
  sotrovimab |         67        2.92       94.91
    paxlovid |         53        2.31       97.21
molnupiravir |         64        2.79      100.00
-------------+-----------------------------------
       Total |      2,298      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,023       91.66       91.66
  sotrovimab |         67        3.04       94.70
    paxlovid |         53        2.40       97.10
molnupiravir |         64        2.90      100.00
-------------+-----------------------------------
       Total |      2,207      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,971       92.36       92.36
  sotrovimab |         61        2.86       95.22
    paxlovid |         46        2.16       97.38
molnupiravir |         56        2.62      100.00
-------------+-----------------------------------
       Total |      2,134      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,841       94.80       94.80
  sotrovimab |         37        1.91       96.70
    paxlovid |         31        1.60       98.30
molnupiravir |         33        1.70      100.00
-------------+-----------------------------------
       Total |      1,942      100.00

. gen drugs_do_not_use_contra=(drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180))  // Are these CI drug for paxlovid only??

. gen drugs_consider_risk_contra=(drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contra = 1 if egfr_30==1 | dialysis==1
(21,327 missing values generated)

. replace paxlovid_contra = 1 if liver_disease==1 
(4,030 real changes made)

. replace paxlovid_contra = 1 if solid_organ==1 
solid_organ ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\k1635179\AppData\Local\Temp\STD171c_000000.tmp"

. replace paxlovid_contra = 1 if organ_transplant==1 
(5,463 real changes made)

. replace paxlovid_contra = 1 if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)
(943 real changes made)

. recode paxlovid_contra . = 0
(10891 changes made to paxlovid_contra)

. by drug, sort: count if paxlovid_contra==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,645
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1,290
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1,313
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1,299

. 
end of do-file

