---------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_data
> set_combine.log
  log type:  text
 opened on:  24 Jul 2023, 13:06:39

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/analysis/ad
> o"

. 
. *       Import control dataset
. import delimited "$projectdir/output/input_control.csv", clear
(encoding automatically selected: ISO-8859-1)
(221 vars, 50,000 obs)

. gen control_dataset=1

. *       Convert control strings to dates     * 
. foreach var of varlist   covid_test_positive_date                               ///
>                                                  covid_test_positive_date2                              ///
>                                                  covid_test_positive_date3                              ///
>                                                  covid_test_positive_treat                              ///
>                                                  prior_covid_date                                       ///
>                                                  sotrovimab                                                             ///
>                                                  molnupiravir                                                   /// 
>                                                  paxlovid                                                               ///
>                                                  remdesivir                                                             ///
>                                                  casirivimab                                                    ///
>                                                  sotrovimab_not_start                                   ///
>                                                  molnupiravir_not_start                                 ///
>                                                  paxlovid_not_start                                             ///
>                                                  date_treated                                                   ///
>                                                  start_date                                                             ///
>                                                  drugs_paxlovid_interaction                             ///
>                                                  drugs_nirmatrelvir_interaction                 ///
>                                                  last_vaccination_date                                  ///
>                                                  death_date                                                             ///
>                                                  dereg_date                                                     ///
>                                                  bmi_date_measured                                              ///
>                                                  creatinine_ctv3_date                                   ///
>                                                  creatinine_snomed_date                                 ///
>                                                  creatinine_short_snomed_date                   ///
>                                                  ae_diverticulitis_icd                                  ///
>                                                  ae_diverticulitis_snomed                               ///
>                                                  ae_diarrhoea_snomed                                    ///
>                                                  ae_taste_snomed                                                ///
>                                                  ae_taste_icd                                                   ///
>                                                  ae_rash_snomed                                                 ///
>                                                  ae_anaphylaxis_icd                                             ///
>                                                  ae_anaphylaxis_snomed                                  ///
>                                                  ae_anaphlaxis_ae                                               ///
>                                                  ae_drugreact_ae                                                ///
>                                                  ae_allergic_ae                                                 ///
>                                                  ae_rheumatoid_arthritis_snomed                 ///
>                                                  ae_rheumatoid_arthritis_icd                    ///
>                                                  ae_sle_ctv                                                             ///
>                                                  ae_sle_icd                                                             ///
>                                                  ae_psoriasis_snomed                                    ///
>                                                  ae_psoriatic_arthritis_snomed                  ///
>                                                  ae_ankylosing_spondylitis_ctv                  ///
>                                                  ae_ibd_snomed                                                  ///
>                                                  ae_diverticulitis_ae                                   ///
>                                                  ae_rheumatoid_arthritis_ae                             ///
>                                                  ae_sle_ae                                                              ///
>                                                  ae_psoriasis_ae                                                ///
>                                                  ae_psoriatic_arthritis_ae                              ///
>                                                  ae_ankylosing_spondylitis_ae                   ///
>                                                  ae_ibd_ae                                                              ///
>                                                  ae_diverticulitis_icd_prim                             ///     
>                                                  ae_taste_icd_prim                                              ///
>                                                  ae_anaphylaxis_icd_prim                                ///
>                                                  ae_rheumatoid_arthritis_icd_prim               ///
>                                                  ae_sle_icd_prim                                                ///
>                                                  pre_diverticulitis_icd_prim                    ///
>                                                  pre_taste_icd_prim                                             ///
>                                                  pre_anaphylaxis_icd_prim                               ///
>                                                  pre_sle_icd_prim                                               ///
>                                                  pre_rheumatoid_icd_prim                                ///
>                                                  rheumatoid_arthritis_nhsd_snomed               ///
>                                                  rheumatoid_arthritis_nhsd_icd10                ///
>                                                  sle_nhsd_ctv                                                   ///
>                                                  sle_nhsd_icd10                                                 ///
>                                                  psoriasis_nhsd                                                 ///
>                                                  psoriatic_arthritis_nhsd                               ///
>                                                  ankylosing_spondylitis_nhsd                    ///
>                                                  ibd_ctv                                                                ///
>                                                  allcause_emerg_aande                                   ///
>                                                  all_hosp_date                                                  ///
>                                                  all_hosp_date0                                                 ///
>                                                  all_hosp_date1                                                 ///
>                                                  all_hosp_date2                                                 ///
>                                                  hosp_discharge_date                                    ///
>                                                  hosp_discharge_date0                                   ///
>                                                  hosp_discharge_date1                                   ///
>                                                  hosp_discharge_date2                                   ///
>                                                  covid_hosp_date                                                ///
>                                                  covid_hosp_date0                                               ///
>                                                  covid_hosp_date1                                               ///
>                                                  covid_hosp_date2                                               ///                                             
>                                                  covid_discharge_date                                   ///
>                                                  covid_discharge_date0                                  ///                                             
>                                                  covid_discharge_date1                                  /// 
>                                                  covid_discharge_date2                                  /// 
>                                                  any_covid_hosp_discharge                               ///                     
>                                                  covid_hosp_date_mabs                                   /// 
>                                                  covid_hosp_date_mabs_not_primary               /// 
>                                                  died_date_ons                                                  ///
>                                                  died_ons_covid                                                 ///
>                                                  pre_diverticulitis_icd                                 ///
>                                                  pre_diverticulitis_snomed                              ///
>                                                  pre_diverticulitis_ae                                  ///
>                                                  pre_diarrhoea_snomed                                   ///
>                                                  pre_taste_snomed                                               ///
>                                                  pre_taste_icd                                                  ///
>                                                  pre_rash_snomed                                                ///
>                                                  pre_anaphylaxis_icd                                    ///
>                                                  pre_anaphylaxis_snomed                                 ///
>                                                  pre_anaphlaxis_ae                                              ///
>                                                  pre_drugreact_ae                                               ///
>                                                  pre_allergic_ae                                                ///
>                                                  pre_anaphlaxis_ae                                              ///
>                                                  pre_rheumatoid_arthritis_ae                    ///
>                                                  pre_rheumatoid_arthritis_snomed                ///
>                                                  pre_rheumatoid_arthritis_icd                   ///
>                                                  pre_ankylosing_spondylitis_ctv                 ///
>                                                  pre_ankylosing_spondylitis_ae                  ///
>                                                  pre_psoriasis_snomed                                   ///
>                                                  pre_psoriasis_ae                                               ///
>                                                  pre_psoriatic_arthritis_ae                             ///
>                                                  pre_psoriatic_arthritis_snomed                 ///
>                                                  pre_sle_ctv                                                    ///
>                                                  pre_sle_icd                                                    ///
>                                                  pre_sle_ae                                                             ///
>                                                  pre_ibd_ae                                                             ///
>                                                  pre_ibd_snomed {                                        
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(30,000 missing values generated)
(4,999 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,558 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)

. tab control_dataset

control_dat |
       aset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000      100.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

. save "$projectdir/output/data/control.dta", replace 
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/data/control.dta
    saved

. //                                               //                             ///
. 
. * import treatment dataset
. import delimited "$projectdir/output/input_treatment.csv", clear
(encoding automatically selected: ISO-8859-1)
(221 vars, 50,000 obs)

. gen treatment_dataset=1

. *       Convert control strings to dates     * 
. foreach var of varlist   covid_test_positive_date                               ///
>                                                  covid_test_positive_date2                              ///
>                                                  covid_test_positive_date3                              ///
>                                                  covid_test_positive_treat                              ///
>                                                  prior_covid_date                                       ///
>                                                  sotrovimab                                                             ///
>                                                  molnupiravir                                                   /// 
>                                                  paxlovid                                                               ///
>                                                  remdesivir                                                             ///
>                                                  casirivimab                                                    ///
>                                                  sotrovimab_not_start                                   ///
>                                                  molnupiravir_not_start                                 ///
>                                                  paxlovid_not_start                                             ///
>                                                  date_treated                                                   ///
>                                                  start_date                                                             ///
>                                                  drugs_paxlovid_interaction                             ///
>                                                  drugs_nirmatrelvir_interaction                 ///
>                                                  last_vaccination_date                                  ///
>                                                  death_date                                                             ///
>                                                  dereg_date                                                     ///
>                                                  bmi_date_measured                                              ///
>                                                  creatinine_ctv3_date                                   ///
>                                                  creatinine_snomed_date                                 ///
>                                                  creatinine_short_snomed_date                   ///
>                                                  ae_diverticulitis_icd                                  ///
>                                                  ae_diverticulitis_snomed                               ///
>                                                  ae_diarrhoea_snomed                                    ///
>                                                  ae_taste_snomed                                                ///
>                                                  ae_taste_icd                                                   ///
>                                                  ae_rash_snomed                                                 ///
>                                                  ae_anaphylaxis_icd                                             ///
>                                                  ae_anaphylaxis_snomed                                  ///
>                                                  ae_anaphlaxis_ae                                               ///
>                                                  ae_drugreact_ae                                                ///
>                                                  ae_allergic_ae                                                 ///
>                                                  ae_rheumatoid_arthritis_snomed                 ///
>                                                  ae_rheumatoid_arthritis_icd                    ///
>                                                  ae_sle_ctv                                                             ///
>                                                  ae_sle_icd                                                             ///
>                                                  ae_psoriasis_snomed                                    ///
>                                                  ae_psoriatic_arthritis_snomed                  ///
>                                                  ae_ankylosing_spondylitis_ctv                  ///
>                                                  ae_ibd_snomed                                                  ///
>                                                  ae_diverticulitis_ae                                   ///
>                                                  ae_rheumatoid_arthritis_ae                             ///
>                                                  ae_sle_ae                                                              ///
>                                                  ae_psoriasis_ae                                                ///
>                                                  ae_psoriatic_arthritis_ae                              ///
>                                                  ae_ankylosing_spondylitis_ae                   ///
>                                                  ae_ibd_ae                                                              ///
>                                                  ae_diverticulitis_icd_prim                             ///     
>                                                  ae_taste_icd_prim                                              ///
>                                                  ae_anaphylaxis_icd_prim                                ///
>                                                  ae_rheumatoid_arthritis_icd_pri                ///
>                                                  ae_sle_icd_prim                                                ///
>                                                  pre_diverticulitis_icd_prim                    ///
>                                                  pre_taste_icd_prim                                             ///
>                                                  pre_anaphylaxis_icd_prim                               ///
>                                                  pre_rheumatoid_icd_prim                                ///
>                                                  pre_sle_icd_prim                                               ///
>                                                  rheumatoid_arthritis_nhsd_snomed               ///
>                                                  rheumatoid_arthritis_nhsd_icd10                ///
>                                                  sle_nhsd_ctv                                                   ///
>                                                  sle_nhsd_icd10                                                 ///
>                                                  psoriasis_nhsd                                                 ///
>                                                  psoriatic_arthritis_nhsd                               ///
>                                                  ankylosing_spondylitis_nhsd                    ///
>                                                  ibd_ctv                                                                ///
>                                                  allcause_emerg_aande                                   ///
>                                                  all_hosp_date                                                  ///
>                                                  all_hosp_date0                                                 ///
>                                                  all_hosp_date1                                                 ///
>                                                  all_hosp_date2                                                 ///
>                                                  hosp_discharge_date                                    ///
>                                                  hosp_discharge_date0                                   ///
>                                                  hosp_discharge_date1                                   ///
>                                                  hosp_discharge_date2                                   ///
>                                                  covid_hosp_date                                                ///
>                                                  covid_hosp_date0                                               ///
>                                                  covid_hosp_date1                                               ///
>                                                  covid_hosp_date2                                               ///                                             
>                                                  covid_discharge_date                                   ///
>                                                  covid_discharge_date0                                  ///                                             
>                                                  covid_discharge_date1                                  /// 
>                                                  covid_discharge_date2                                  /// 
>                                                  any_covid_hosp_discharge                               ///                     
>                                                  covid_hosp_date_mabs                                   /// 
>                                                  covid_hosp_date_mabs_not_primary               /// 
>                                                  died_date_ons                                                  ///
>                                                  died_ons_covid                                                 ///
>                                                  pre_diverticulitis_icd                                 ///
>                                                  pre_diverticulitis_snomed                              ///
>                                                  pre_diverticulitis_ae                                  ///
>                                                  pre_diarrhoea_snomed                                   ///
>                                                  pre_taste_snomed                                               ///
>                                                  pre_taste_icd                                                  ///
>                                                  pre_rash_snomed                                                ///
>                                                  pre_anaphylaxis_icd                                    ///
>                                                  pre_anaphylaxis_snomed                                 ///
>                                                  pre_anaphlaxis_ae                                              ///
>                                                  pre_drugreact_ae                                               ///
>                                                  pre_allergic_ae                                                ///
>                                                  pre_anaphlaxis_ae                                              ///
>                                                  pre_rheumatoid_arthritis_ae                    ///
>                                                  pre_rheumatoid_arthritis_snomed                ///
>                                                  pre_rheumatoid_arthritis_icd                   ///
>                                                  pre_ankylosing_spondylitis_ctv                 ///
>                                                  pre_ankylosing_spondylitis_ae                  ///
>                                                  pre_psoriasis_snomed                                   ///
>                                                  pre_psoriasis_ae                                               ///
>                                                  pre_psoriatic_arthritis_ae                             ///
>                                                  pre_psoriatic_arthritis_snomed                 ///
>                                                  pre_sle_ctv                                                    ///
>                                                  pre_sle_icd                                                    ///
>                                                  pre_sle_ae                                                             ///
>                                                  pre_ibd_ae                                                             ///
>                                                  pre_ibd_snomed {                                        
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(30,000 missing values generated)
(4,999 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,544 missing values generated)
(48,518 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)

. tab treatment_dataset

treatment_d |
     ataset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000      100.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

. *********************************
. *  Append control & treatment datasets     *
. ********************************* 
. append using "$projectdir/output/data/control.dta"

. duplicates tag patient_id, gen(duplicate_patient_id)

Duplicates in terms of patient_id

. bys patient_id (treatment_dataset duplicate_patient_id): gen n=_n

. tab n

          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     95,013       95.01       95.01
          2 |      4,987        4.99      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. drop if n>1  // drops duplicate patient id and in control group
(4,987 observations deleted)

. tab control_dataset,m

control_dat |
       aset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     45,013       47.38       47.38
          . |     50,000       52.62      100.00
------------+-----------------------------------
      Total |     95,013      100.00

. tab treatment_dataset,m

treatment_d |
     ataset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000       52.62       52.62
          . |     45,013       47.38      100.00
------------+-----------------------------------
      Total |     95,013      100.00

. count if start_date==.
  48,518

. count if start_date!=date_treated & treatment_dataset==1
  984

. count if start_date!=covid_test_positive_date & control_dataset==1
  44,939

. 
. ****************************
. *       EXPOSURE                *
. ****************************
. ** removing individuals who did not start therapy
. foreach var of varlist sotrovimab molnupiravir paxlovid {
  2.     display "`var'"
  3.         count if `var'!=.
  4.         count if `var'==date_treated & `var'!=. & date_treated!=.
  5.         count if `var'==date_treated & `var'!=. & date_treated!=. & `var'_not_start!=.
  6.         gen `var'_start = 1 if `var'==date_treated & `var'!=. & date_treated!=. & `var'_not_start==.
  7.         replace `var'_start = 0 if `var'==date_treated & `var'!=. & date_treated!=. & `var'_not_start!=.
  8.         tab `var'_start, m  //number on treatment, first drug given, and drug was started
  9. }
sotrovimab
  944
  928
  12
(94,097 missing values generated)
(12 real changes made)

sotrovimab_ |
      start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         12        0.01        0.01
          1 |        916        0.96        0.98
          . |     94,085       99.02      100.00
------------+-----------------------------------
      Total |     95,013      100.00
molnupiravir
  955
  942
  7
(94,078 missing values generated)
(7 real changes made)

molnupiravi |
    r_start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7        0.01        0.01
          1 |        935        0.98        0.99
          . |     94,071       99.01      100.00
------------+-----------------------------------
      Total |     95,013      100.00
paxlovid
  951
  927
  7
(94,093 missing values generated)
(7 real changes made)

paxlovid_st |
        art |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7        0.01        0.01
          1 |        920        0.97        0.98
          . |     94,086       99.02      100.00
------------+-----------------------------------
      Total |     95,013      100.00

. gen drug=7 if remdesivir==date_treated&remdesivir!=.&date_treated!=.
(94,071 missing values generated)

. replace drug=8 if casirivimab==date_treated&casirivimab!=.&date_treated!=.
(922 real changes made)

. tab drug 

       drug |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |        942       50.54       50.54
          8 |        922       49.46      100.00
------------+-----------------------------------
      Total |      1,864      100.00

. replace drug=1 if sotrovimab_start==1 
(916 real changes made)

. replace drug=2 if paxlovid_start==1
(920 real changes made)

. replace drug=3 if molnupiravir_start==1
(935 real changes made)

. replace drug=4 if sotrovimab==date_treated & sotrovimab_start==0 
(12 real changes made)

. replace drug=5 if paxlovid==date_treated & paxlovid_start==0 
(7 real changes made)

. replace drug=6 if molnupiravir==date_treated & molnupiravir_start==0 
(7 real changes made)

. replace drug=0 if control_dataset==1
(45,013 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir", replace

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     45,013       47.38       47.38
  sotrovimab |        487        0.51       47.89
    paxlovid |        485        0.51       48.40
molnupiravir |        482        0.51       48.91
           4 |          7        0.01       48.91
           5 |          4        0.00       48.92
           6 |          7        0.01       48.92
           7 |        493        0.52       49.44
           8 |        491        0.52       49.96
           . |     47,544       50.04      100.00
-------------+-----------------------------------
       Total |     95,013      100.00

. drop if drug>3
(48,546 observations deleted)

. 
. ** start date is date treatment for treatment arms and date of covid test for control arm 
. count if start_date==. //should be 0
  0

. count if start_date!=covid_test_positive_date & drug==0  //should be 0
  44,939

. count if start_date!=date_treated & drug>0 //should be 0
  0

. 
. ** check number of positive covid tests prior to drug in treatment arms
. bys drug:count if covid_test_positive_date==. // should be 0 in control arm

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,480
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  52
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  60
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  51

. bys drug:count if covid_test_positive_date!=. 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  40,533
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  435
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  425
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  431

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& date_treated>covid_test_positive_date //test prior to treatment

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,031
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  215
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  225
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  216

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& (date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5) //test <5d

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  21
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& date_treated<covid_test_positive_date2 //2nd covid episode prior to treatment 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  101
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  17
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  30
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  25

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& (date_treated-covid_test_positive_date2>0)&(date_treated-covid_test_positive_date2<=5) //test <5d

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& date_treated<covid_test_positive_date3 //3rd covid episode prior to treatment 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  104
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  28
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  23
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  19

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& (date_treated-covid_test_positive_date3>0)&(date_treated-covid_test_positive_date3<=5) //test <5d

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

. ** check in control group that covid positive, and not repeat covid test after an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days if drug==0

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,263        214 |     4,477 
         1 |    38,494      2,042 |    40,536 
-----------+----------------------+----------
     Total |    42,757      2,256 |    45,013 

. drop if drug==0 & covid_test_positive==1 & covid_positive_previous_30_days==1
(2,042 observations deleted)

. ** gen study start and study end date
. gen campaign_start=mdy(12,16,2021)

. gen study_end_date=mdy(01,08,2023)

. gen start_date_28=start_date + 28

. format campaign_start study_end_date start_date_28 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ** inclusion criteria*
. keep if age>=18 & age<110
(9,445 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(1,751 observations deleted)

. ** exclusion criteria*
. count if start_date>dereg_date & start_date!=.
  3,300

. count if start_date>death_date & start_date!=.
  3,328

. drop if start_date>death_date | start_date>dereg_date
(6,267 observations deleted)

. 
. ** high risk cohort from blueteq therapeutics datafor drug arms
. tab high_risk_cohort_therapeutics drug,m //should be 0 in control group

high_risk_cohort_ther |                    drug
             apeutics |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
       Downs syndrome |     2,568         29         30         26 |     2,653 
          HIV or AIDS |     1,271         13         15         11 |     1,310 
                 IMID |     2,655         30         29         29 |     2,743 
    IMID,solid cancer |     2,585         28         28         32 |     2,673 
                   NA |     1,332         15         10         16 |     1,373 
haematological dise.. |     1,269         11         12         12 |     1,304 
haematological mali.. |     1,339         11         12         11 |     1,373 
        liver disease |     1,292         15         25         16 |     1,348 
primary immune defi.. |     2,579         29         25         32 |     2,665 
sickle cell disease.. |     2,747         32         25         29 |     2,833 
         solid cancer |     2,619         23         19         32 |     2,693 
solid organ transpl.. |     2,535         29         35         22 |     2,621 
stem cell transplan.. |     1,324         10         17         22 |     1,373 
----------------------+--------------------------------------------+----------
                Total |    26,115        275        282        290 |    26,962 

. gen downs_syndrome_therap= 1 if strpos(high_risk_cohort_therapeutics, "Downs syndrome")
(24,309 missing values generated)

. gen solid_cancer_therap=1 if strpos(high_risk_cohort_therapeutics, "solid cancer")
(21,596 missing values generated)

. gen haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematological malignancies")
(25,589 missing values generated)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematological malignancy")
(0 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "sickle cell disease")
(2,833 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematological diseases")
(1,304 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "stem cell transplant")
(1,373 real changes made)

. gen renal_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "renal disease")
(24,341 missing values generated)

. gen liver_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "liver disease")
(25,614 missing values generated)

. gen imid_on_drug_therap= 1 if strpos(high_risk_cohort_therapeutics, "IMID")
(21,546 missing values generated)

. gen immunosupression_therap= 1 if strpos(high_risk_cohort_therapeutics, "primary immune deficiencies")
(24,297 missing values generated)

. gen hiv_aids_therap= 1 if strpos(high_risk_cohort_therapeutics, "HIV or AIDS")
(25,652 missing values generated)

. gen organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "solid organ recipients")
(26,962 missing values generated)

. replace organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "solid organ transplant")
(2,621 real changes made)

. gen rare_neuro_therap= 1 if strpos(high_risk_cohort_therapeutics, "rare neurological conditions")
(24,129 missing values generated)

. bys drug: count if high_risk_cohort_therapeutics!=""&high_risk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer_therap,haem_disease_therap,rena
> l_disease_therap,liver_disease_therap,imid_on_drug_therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==. //check if all dise
> ases have been captured

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,332
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  15
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  10
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  16

. tab high_risk_cohort_therapeutics if high_risk_cohort_therapeutics!=""&high_risk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer_therap,haem_d
> isease_therap,renal_disease_therap,liver_disease_therap,imid_on_drug_therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==.

          high_risk_cohort_therapeutics |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                     NA |      1,373      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,373      100.00

. foreach var of varlist downs_syndrome_therap solid_cancer_therap haem_disease_therap renal_disease_therap liver_disease_therap imid_on_drug_therap immunosupression
> _therap hiv_aids_therap organ_transplant_therap rare_neuro_therap{
  2.         replace `var'=0 if `var'==. 
  3. }
(24,309 real changes made)
(21,596 real changes made)
(20,079 real changes made)
(24,341 real changes made)
(25,614 real changes made)
(21,546 real changes made)
(24,297 real changes made)
(25,652 real changes made)
(24,341 real changes made)
(24,129 real changes made)

. 
. ** high risk cohort from open codelist from control group
. tab high_risk_cohort_nhsd drug,m 

high_risk_ |
cohort_nhs |                    drug
         d |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |       530          5          7          5 |       547 
         1 |    25,585        270        275        285 |    26,415 
-----------+--------------------------------------------+----------
     Total |    26,115        275        282        290 |    26,962 

. count if downs_syndrome!=.
  26,962

. count if solid_cancer!=.
  26,962

. count if haem_disease!=.
  26,962

. count if renal_disease!=.
  26,962

. count if liver_disease!=.
  26,962

. count if imid_on_drug!=.
  26,962

. count if hiv_aids!=.
  26,962

. count if organ_transplant!=.
  26,962

. count if rare_neuro!=.
  26,962

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be 0
  7,359

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 //should be 0
  280

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==1 & downs_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosupression=
> =0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  18

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  274

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 
  264

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_drug==1
  132

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_drug==1 &do
> wns_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  5

. replace imid_drug=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_
> on_drug==1 //ignore if steriods<4 scripts in 6m & not coded other imid drug 
(132 real changes made)

. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 //ignore if steriods<4 scripts in 6m
(274 real changes made)

. count if imid_on_drug==0 & imid_nhsd==1 & imid_drug==0 //should be same number as those dropped above 
  7,284

. replace imid_on_drug=0 if imid_nhsd==1 & imid_drug==0 
(7,440 real changes made)

. replace imid_on_drug=0 if imid_nhsd==0 & imid_drug==1 
(229 real changes made)

. gen high_risk_cohort_codelist=((downs_syndrome + solid_cancer + haem_disease + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids + organ_t
> ransplant + rare_neuro )>0)

. bys drug:count if high_risk_cohort_codelist!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  26,115
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  275
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  282
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  290

. bys drug:count if high_risk_cohort_codelist==.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. tab high_risk_cohort_nhsd high_risk_cohort_codelist

high_risk_ | high_risk_cohort_code
cohort_nhs |         list
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |       547          0 |       547 
         1 |       320     26,095 |    26,415 
-----------+----------------------+----------
     Total |       867     26,095 |    26,962 

. 
. ** combine two high risk cohorts into one 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids organ_transplant rare_neuro {
  2.         gen `var'_comb = `var'
  3.         replace `var'_comb = 1 if `var'_therap==1 
  4.         tab `var' `var'_therap 
  5.         tab `var'_comb
  6. }
(2,165 real changes made)

downs_synd | downs_syndrome_therap
      rome |         0          1 |     Total
-----------+----------------------+----------
         0 |    19,722      2,165 |    21,887 
         1 |     4,587        488 |     5,075 
-----------+----------------------+----------
     Total |    24,309      2,653 |    26,962 

downs_syndr |
   ome_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,722       73.15       73.15
          1 |      7,240       26.85      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(4,823 real changes made)

solid_canc |  solid_cancer_therap
        er |         0          1 |     Total
-----------+----------------------+----------
         0 |    19,458      4,823 |    24,281 
         1 |     2,138        543 |     2,681 
-----------+----------------------+----------
     Total |    21,596      5,366 |    26,962 

solid_cance |
     r_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,458       72.17       72.17
          1 |      7,504       27.83      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(3,652 real changes made)

haem_disea |  haem_disease_therap
        se |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,659      3,652 |    14,311 
         1 |     9,420      3,231 |    12,651 
-----------+----------------------+----------
     Total |    20,079      6,883 |    26,962 

haem_diseas |
     e_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,659       39.53       39.53
          1 |     16,303       60.47      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(1,698 real changes made)

renal_dise | renal_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,813      1,698 |    17,511 
         1 |     8,528        923 |     9,451 
-----------+----------------------+----------
     Total |    24,341      2,621 |    26,962 

renal_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,813       58.65       58.65
          1 |     11,149       41.35      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(1,084 real changes made)

liver_dise | liver_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,738      1,084 |    21,822 
         1 |     4,876        264 |     5,140 
-----------+----------------------+----------
     Total |    25,614      1,348 |    26,962 

liver_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,738       76.92       76.92
          1 |      6,224       23.08      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(4,235 real changes made)

imid_on_dr |  imid_on_drug_therap
        ug |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,814      4,235 |    21,049 
         1 |     4,732      1,181 |     5,913 
-----------+----------------------+----------
     Total |    21,546      5,416 |    26,962 

imid_on_dru |
     g_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,814       62.36       62.36
          1 |     10,148       37.64      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(2,391 real changes made)

           | immunosupression_ther
immunosupr |          ap
    ession |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,859      2,391 |    24,250 
         1 |     2,438        274 |     2,712 
-----------+----------------------+----------
     Total |    24,297      2,665 |    26,962 

immunosupre |
 ssion_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,859       81.07       81.07
          1 |      5,103       18.93      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(1,064 real changes made)

           |    hiv_aids_therap
  hiv_aids |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,760      1,064 |    21,824 
         1 |     4,892        246 |     5,138 
-----------+----------------------+----------
     Total |    25,652      1,310 |    26,962 

hiv_aids_co |
         mb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,760       77.00       77.00
          1 |      6,202       23.00      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(1,788 real changes made)

           | organ_transplant_ther
organ_tran |          ap
    splant |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,716      1,788 |    18,504 
         1 |     7,625        833 |     8,458 
-----------+----------------------+----------
     Total |    24,341      2,621 |    26,962 

organ_trans |
 plant_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,716       62.00       62.00
          1 |     10,246       38.00      100.00
------------+-----------------------------------
      Total |     26,962      100.00
(1,221 real changes made)

           |   rare_neuro_therap
rare_neuro |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,419      1,221 |    11,640 
         1 |    13,710      1,612 |    15,322 
-----------+----------------------+----------
     Total |    24,129      2,833 |    26,962 

rare_neuro_ |
       comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,419       38.64       38.64
          1 |     16,543       61.36      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. 
. ****************************
. *       OUTCOME         *
. ****************************
. *** AESI, IMAE and some Drug reaction (need to add further IMAE and DRESS, SJS, TEN) 
. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(18,269 missing values generated)

. gen new_ae_ra_icd_prim = ae_rheumatoid_arthritis_icd_prim if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(18,249 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0
(18,305 missing values generated)

. gen new_ae_ra_ae = ae_rheumatoid_arthritis_ae if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(18,279 missing values generated)

. count if rheumatoid_arthritis_nhsd_snomed!=0 | rheumatoid_arthritis_nhsd_icd10!=0
  5,206

. count if ae_rheumatoid_arthritis_icd!=. 
  10,786

. count if new_ae_ra_icd!=.
  8,693

. count if ae_rheumatoid_arthritis_icd_prim!=. 
  10,779

. count if new_ae_ra_icd_prim!=.
  8,713

. count if ae_rheumatoid_arthritis_snomed!=. 
  10,759

. count if new_ae_ra_snomed!=.
  8,657

. count if ae_rheumatoid_arthritis_ae!=. 
  10,745

. count if new_ae_ra_ae!=.
  8,683

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,212 missing values generated)

. gen new_ae_sle_icd_prim = ae_sle_icd_prim if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,149 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,289 missing values generated)

. gen new_ae_sle_ae = ae_sle_ae if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,269 missing values generated)

. count if sle_nhsd_ctv!=0 | sle_nhsd_icd10!=0
  5,089

. count if ae_sle_icd!=. 
  10,788

. count if new_ae_sle_icd!=.
  8,750

. count if ae_sle_icd_prim!=. 
  10,857

. count if new_ae_sle_icd_prim!=.
  8,813

. count if ae_sle_ctv!=. 
  10,692

. count if new_ae_sle_ctv!=.
  8,673

. count if ae_sle_ae!=. 
  10,718

. count if new_ae_sle_ae!=.
  8,693

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(17,207 missing values generated)

. gen new_ae_psoriasis_ae = ae_psoriasis_ae if psoriasis_nhsd==0
(17,283 missing values generated)

. count if psoriasis_nhsd!=0 
  2,732

. count if ae_psoriasis_snomed!=. 
  10,824

. count if new_ae_psoriasis_snomed!=.
  9,755

. count if ae_psoriasis_ae!=. 
  10,786

. count if new_ae_psoriasis_ae!=.
  9,679

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_nhsd==0
(17,253 missing values generated)

. gen new_ae_psa_ae = ae_psoriatic_arthritis_ae if psoriatic_arthritis_nhsd==0
(17,326 missing values generated)

. count if psoriatic_arthritis_nhsd!=0 
  2,690

. count if ae_psoriatic_arthritis_snomed!=. 
  10,786

. count if new_ae_psa_snomed!=.
  9,709

. count if ae_psoriatic_arthritis_ae!=. 
  10,724

. count if new_ae_psa_ae!=.
  9,636

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondylitis_nhsd==0
(17,259 missing values generated)

. gen new_ae_ankspon_ae = ae_ankylosing_spondylitis_ae if ankylosing_spondylitis_nhsd==0
(17,238 missing values generated)

. count if ankylosing_spondylitis_nhsd!=0 
  2,717

. count if ae_ankylosing_spondylitis_ctv!=. 
  10,780

. count if new_ae_ankspon_ctv!=.
  9,703

. count if ae_ankylosing_spondylitis_ae!=. 
  10,790

. count if new_ae_ankspon_ae!=.
  9,724

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(17,178 missing values generated)

. gen new_ae_ibd_ae = ae_ibd_ae if ibd_ctv==0
(17,337 missing values generated)

. count if ibd_ctv!=0 
  2,700

. count if ae_ibd_snomed!=. 
  10,865

. count if new_ae_ibd_snomed!=.
  9,784

. count if ae_ibd_ae!=. 
  10,755

. count if new_ae_ibd_ae!=.
  9,625

. 
. *** comparison of ICD admission primary diagnosis and all diagnoses
. count if ae_diverticulitis_icd!=.
  10,836

. count if ae_diverticulitis_icd_prim!=.
  10,825

. count if ae_taste_icd!=.
  10,761

. count if ae_taste_icd_prim!=.
  10,679

. count if ae_anaphylaxis_icd!=.
  10,852

. count if ae_anaphylaxis_icd_prim!=.
  10,820

. 
. *** global all ae
. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed                             ///
>                                                 ae_taste_snomed                                         

. global ae_spc_icd               ae_diverticulitis_icd_prim                      ///
>                                                 ae_taste_icd_prim                                       

. global ae_spc_emerg             ae_diverticulitis_ae                                                                    

. global ae_drug                  ae_anaphylaxis_snomed                   ///     
>                                                 ae_rash_snomed  

. global ae_drug_emerg    ae_anaphlaxis_ae                                ///
>                                                 ae_drugreact_ae                                 ///
>                                                 ae_allergic_ae                                                                                      

. global ae_drug_icd              ae_anaphylaxis_icd_prim

. global ae_imae                  new_ae_ra_snomed                                ///
>                                                 new_ae_sle_ctv                                  ///
>                                                 new_ae_psoriasis_snomed                 ///
>                                                 new_ae_psa_snomed                               ///
>                                                 new_ae_ankspon_ctv                              ///
>                                                 new_ae_ibd_snomed       

. global ae_imae_icd              new_ae_ra_icd_prim                              ///
>                                                 new_ae_sle_icd_prim             

. global ae_imae_emerg    new_ae_ra_ae                                    ///
>                                                 new_ae_sle_ae                                   ///
>                                                 new_ae_psoriasis_ae                             ///
>                                                 new_ae_psa_ae                                   ///
>                                                 new_ae_ankspon_ae                               ///
>                                                 new_ae_ibd_ae                           

.                                                                         
. *remove event if occurred before start
. foreach x in $ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug_emerg $ae_imae $ae_imae_icd $ae_drug_emerg{
  2.                                 display "`x'"
  3.                                 count if (`x' > start_date | `x' < start_date + 28) & `x'!=. 
  4.                                 count if (`x' < start_date | `x' > start_date + 28) & `x'!=. & drug==0
  5.                                 count if (`x' < start_date | `x' > start_date + 28) & `x'!=. & drug>0
  6. }
ae_diverticulitis_snomed
  10,695
  9,849
  313
ae_diarrhoea_snomed
  10,871
  10,058
  301
ae_taste_snomed
  10,824
  10,019
  327
ae_diverticulitis_icd_prim
  10,825
  9,985
  312
ae_taste_icd_prim
  10,679
  9,867
  307
ae_diverticulitis_ae
  10,695
  9,866
  318
ae_anaphylaxis_snomed
  10,725
  9,840
  317
ae_rash_snomed
  10,769
  9,891
  314
ae_anaphylaxis_icd_prim
  10,820
  9,981
  320
ae_anaphlaxis_ae
  10,837
  9,964
  326
ae_drugreact_ae
  10,793
  9,935
  325
ae_allergic_ae
  10,771
  9,947
  332
new_ae_ra_snomed
  8,657
  7,992
  268
new_ae_sle_ctv
  8,673
  7,994
  259
new_ae_psoriasis_snomed
  9,755
  8,951
  280
new_ae_psa_snomed
  9,709
  8,928
  306
new_ae_ankspon_ctv
  9,703
  8,929
  291
new_ae_ibd_snomed
  9,784
  8,992
  311
new_ae_ra_icd_prim
  8,713
  8,048
  247
new_ae_sle_icd_prim
  8,813
  8,089
  275
ae_anaphlaxis_ae
  10,837
  9,964
  326
ae_drugreact_ae
  10,793
  9,935
  325
ae_allergic_ae
  10,771
  9,947
  332

. egen ae_spc_gp = rmin($ae_spc)
(5,767 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(9,748 missing values generated)

. egen ae_spc_emerg = rmin($ae_spc_emerg)
(16,267 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg)
(1,227 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(9,786 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(16,142 missing values generated)

. egen ae_drug_emerg = rmin($ae_drug_emerg)
(5,807 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd $ae_drug_emerg)
(1,304 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)
(2,106 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(12,275 missing values generated)

. egen ae_imae_emerg = rmin($ae_imae_emerg)
(2,133 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd $ae_imae_emerg)   
(133 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug_emerg $ae_imae $ae_imae_icd $ae_imae_emerg)
(2 missing values generated)

. egen ae_all_serious = rmin($ae_spc_icd $ae_spc_emerg $ae_drug_icd $ae_drug_emerg $ae_imae_icd $ae_imae_emerg)
(29 missing values generated)

. by drug, sort: count if ae_spc_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  24,921
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  263
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  275
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  276

. by drug, sort: count if ae_drug_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  24,851
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  267
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  265
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  275

. by drug, sort: count if ae_imae_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  25,986
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  274
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  281
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  288

. by drug, sort: count if ae_all!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  26,113
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  275
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  282
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  290

. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. * a&e all admission
. bys drug: count if allcause_emerg_aande!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,298
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  16
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  16

. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. bys drug: count if covid_hosp_date!=. // all covid hospitalisation

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,612
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  27
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  23
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  25

. bys drug: count if covid_hosp_date0!=. // hospitalisation after treatment date (control group will not have covid_hosp_date0)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  246
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

. // covid admission is the same date as date treated 
. bys drug: count if covid_hosp_date0==date_treated&covid_hosp_date0!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==(date_treated+1) &covid_hosp_date1!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as date treated and is a daycase
. bys drug: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab and is a daycase or 24 hour admission
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&covid_hosp_date0==covid_discharge_date0

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&covid_hosp_date1==covid_discharge_date1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&(covid_discharge_date0 - covid_hosp_date0)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&(covid_discharge_date1 - covid_hosp_date1)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagre, or dischagre preceed admission 
. count if covid_hosp_date!=.&covid_discharge_date==.
  2,656

. count if covid_hosp_date==.&covid_discharge_date!=.
  247

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date==covid_discharge_date
  0

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date<covid_discharge_date
  12

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date>covid_discharge_date
  19

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.  
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date AND a mab procedures 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.
(0 real changes made)

. 
. *correcting ALL hosp events: admitted on day 0 or day 1 after treatment - to ignore mab procedure codes*
. bys drug: count if all_hosp_date!=. // all hospitalisation

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,662
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  19
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  28
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  35

. bys drug: count if all_hosp_date0!=. // hospitalisation after treatment date (control group will not have all_hosp_date0)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  271
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2

. // admission is the same date as date treated 
. bys drug: count if all_hosp_date0==date_treated&all_hosp_date0!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==(date_treated+1) &all_hosp_date1!=.&date_treated!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // admission is the same date as date treated and is a daycase
. bys drug: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all_hosp_date0==hosp_discharge_date0

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all_hosp_date1==hosp_discharge_date1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(hosp_discharge_date0-all_hosp_date0)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(hosp_discharge_date1-all_hosp_date1)==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagre, or dischagre preceed admission 
. count if all_hosp_date!=.&hosp_discharge_date==.
  2,451

. count if all_hosp_date==.&hosp_discharge_date!=.
  2,396

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharge_date
  0

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge_date
  141

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge_date
  152

. // REPLACE - ignore covid admission if admission is for covid AND day 0 or day 1 after treatment AND daycase
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.
(0 real changes made)

. // REPLACE - ignore admission if admission is for covid AND day 0 or day 1 after treatment AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0==covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. foreach var of varlist allcause_emerg_aande covid_hosp_date all_hosp_date died_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' > start_date & `var' < start_date + 28) & `var'!=.                            
  4.                                 bys drug: count if (`var' < start_date | `var' > start_date + 28) & `var'!=.                            
  5. }
allcause_emerg_aande

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  50
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,244
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  16
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  16
covid_hosp_date

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  118
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,482
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  26
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  21
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  24
all_hosp_date

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  118
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,540
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  18
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  27
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  31
died_date_ons

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  459
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  15,217
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  163
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  173
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  177

. 
. ****************************
. *       COVARIATES              *
. ****************************
. *Time between 1st positive covid test and treatment*
. gen pre_drug_test=3 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<21)
(26,937 missing values generated)

. replace pre_drug_test=2 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=7)
(9 real changes made)

. replace pre_drug_test=1 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5)
(9 real changes made)

. replace pre_drug_test=0 if drug>0 & covid_test_positive_date!=. &(date_treated-covid_test_positive_date>=0)&(date_treated-covid_test_positive_date<=3)
(9 real changes made)

. replace pre_drug_test=4 if drug>0 & (date_treated-covid_test_positive_date<0) & (date_treated-covid_test_positive_date>-7)
(8 real changes made)

. replace pre_drug_test=5 if drug>0 & (covid_test_positive_date==. | (date_treated-covid_test_positive_date<=-7) | (date_treated-covid_test_positive_date>=21)) 
(813 real changes made)

. label define pre_drug_test 0 "<3 days" 1 "3-5 days"  2 "5-7 days" 3 ">7 days & <21 days" 4 "treatment proceeds test <7 days" 5 "no test", replace 

. label values pre_drug_test pre_drug_test

. tab pre_drug_test drug,m

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
              <3 days |         0          2          5          2 |         9 
             3-5 days |         0          1          0          0 |         1 
   >7 days & <21 days |         0          1         10          5 |        16 
treatment proceeds te |         0          2          3          3 |         8 
              no test |         0        269        264        280 |       813 
                    . |    26,115          0          0          0 |    26,115 
----------------------+--------------------------------------------+----------
                Total |    26,115        275        282        290 |    26,962 

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |     26,962    48.95182     18.9727         18        109

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |      9,704       35.99       35.99
      40-59 |      9,151       33.94       69.93
       >=60 |      8,107       30.07      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      2,857       10.60       10.60
        25- |      2,366        8.78       19.37
        30- |      2,253        8.36       27.73
        35- |      2,228        8.26       35.99
        40- |      2,065        7.66       43.65
        45- |      2,380        8.83       52.48
        50- |      2,435        9.03       61.51
        55- |      2,271        8.42       69.93
        60- |      1,800        6.68       76.61
        65- |      1,730        6.42       83.02
        70- |      1,659        6.15       89.18
        75- |      1,175        4.36       93.54
        80- |        922        3.42       96.95
        85- |        821        3.05      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Sex
. gen male = 1 if sex == "M"
(13,814 missing values generated)

. replace male = 0 if sex == "F"
(13,814 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(13,814 missing values generated)

. replace sex=1 if sex_str=="F"
(13,814 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |     13,148       48.76       48.76
     Female |     13,814       51.24      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     16,211       60.13       60.13
      Black |      1,044        3.87       64.00
      Mixed |      1,082        4.01       68.01
      Other |      1,111        4.12       72.13
South Asian |      1,067        3.96       76.09
      White |      6,447       23.91      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. replace ethnicity=. if ethnicity==2 
(1,082 real changes made, 1,082 to missing)

. tab ethnicity                           

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      Black |      1,044       10.80       10.80
      Other |      1,111       11.49       22.29
South Asian |      1,067       11.04       33.32
      White |      6,447       66.68      100.00
------------+-----------------------------------
      Total |      9,669      100.00

. gen ethnicity_with_missing=ethnicity
(17,293 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(17,293 real changes made)

. tab ethnicity_with_missing

ethnicity_w |
ith_missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,044        3.87        3.87
          3 |      1,111        4.12        7.99
          4 |      1,067        3.96       11.95
          5 |      6,447       23.91       35.86
          9 |     17,293       64.14      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. gen White=1 if ethnicity==6
(26,962 missing values generated)

. replace White=0 if ethnicity!=6&ethnicity!=.
(9,669 real changes made)

. tab White

      White |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,669      100.00      100.00
------------+-----------------------------------
      Total |      9,669      100.00

. gen White_with_missing=White
(17,293 missing values generated)

. replace White_with_missing=9 if White==.
(17,293 real changes made)

. tab White_with_missing

White_with_ |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,669       35.86       35.86
          9 |     17,293       64.14      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * IMD
. tab imdq5,m

             imdQ5 |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |      5,505       20.42       20.42
                 2 |      5,432       20.15       40.56
                 3 |      5,304       19.67       60.24
                 4 |      5,283       19.59       79.83
5 (least deprived) |      5,141       19.07       98.90
           Unknown |        297        1.10      100.00
-------------------+-----------------------------------
             Total |     26,962      100.00

. replace imdq5="." if imdq5=="Unknown" 
(297 real changes made)

. replace imdq5="1" if imdq5=="1 (most deprived)" 
(5,505 real changes made)

. replace imdq5="5" if imdq5=="5 (least deprived)" 
(5,141 real changes made)

. destring imdq5, replace
imdq5: all characters numeric; replaced as byte
(297 missing values generated)

. recode imdq5 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so 5 is more deprived)
(21361 changes made to imdq5)

. label define imdq5 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived", replace

. label values imdq5 imdq5

. gen imd_with_missing=imdq5
(297 missing values generated)

. replace imd_with_missing=9 if imdq5==.
(297 real changes made)

. tab imdq5,m

           imdQ5 |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,141       19.07       19.07
               2 |      5,283       19.59       38.66
               3 |      5,304       19.67       58.33
               4 |      5,432       20.15       78.48
 5 most deprived |      5,505       20.42       98.90
               . |        297        1.10      100.00
-----------------+-----------------------------------
           Total |     26,962      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,675        9.92        9.92
           East Midlands |      2,653        9.84       19.76
                  London |      5,374       19.93       39.69
              North East |      2,721       10.09       49.78
              North West |      2,677        9.93       59.71
              South East |      2,741       10.17       69.88
              South West |      2,728       10.12       80.00
           West Midlands |      2,656        9.85       89.85
Yorkshire and The Humber |      2,737       10.15      100.00
-------------------------+-----------------------------------
                   Total |     26,962      100.00

. tab drug region_nhs

             |                                             region_nhs
        drug |      East  East Mi..     London  North E..  North W..  South E..  South W..  West Mi..  Yorkshi.. |     Total
-------------+---------------------------------------------------------------------------------------------------+----------
     control |     2,596      2,553      5,208      2,653      2,600      2,645      2,651      2,549      2,660 |    26,115 
  sotrovimab |        23         37         49         21         23         40         25         32         25 |       275 
    paxlovid |        27         24         51         30         25         33         20         42         30 |       282 
molnupiravir |        29         39         66         17         29         23         32         33         22 |       290 
-------------+---------------------------------------------------------------------------------------------------+----------
       Total |     2,675      2,653      5,374      2,721      2,677      2,741      2,728      2,656      2,737 |    26,962 

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,681        9.94        9.94
           East Midlands |      2,644        9.81       19.75
                  London |      5,357       19.87       39.62
              North East |      2,670        9.90       49.52
              North West |      2,700       10.01       59.54
              South East |      2,835       10.51       70.05
              South West |      2,691        9.98       80.03
           West Midlands |      2,707       10.04       90.07
Yorkshire and The Humber |      2,677        9.93      100.00
-------------------------+-----------------------------------
                   Total |     26,962      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,665        9.88        9.88
      STP10 |      2,643        9.80       19.69
       STP2 |      2,734       10.14       29.83
       STP3 |      2,697       10.00       39.83
       STP4 |      2,700       10.01       49.84
       STP5 |      2,685        9.96       59.80
       STP6 |      2,694        9.99       69.79
       STP7 |      2,742       10.17       79.96
       STP8 |      2,704       10.03       89.99
       STP9 |      2,698       10.01      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Other"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,665        9.88        9.88
      STP10 |      2,643        9.80       19.69
       STP2 |      2,734       10.14       29.83
       STP3 |      2,697       10.00       39.83
       STP4 |      2,700       10.01       49.84
       STP5 |      2,685        9.96       59.80
       STP6 |      2,694        9.99       69.79
       STP7 |      2,742       10.17       79.96
       STP8 |      2,704       10.03       89.99
       STP9 |      2,698       10.01      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
         bmi |  26.58542  21.53774  27.46134  33.05623 -5.517342  57.40528
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(1,650 real changes made, 1,650 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*10 & (age+((bmi_date_measured-start_date)/365)>=18)
(26,962 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 & (age+((bmi_date_measured-start_date)/365)>=18)
(26,962 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 & (age+((bmi_date_measured-start_date)/365)>=18)
(26,962 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(1,650 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(1,650 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(1,650 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(1,650 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(1,650 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,275       90.03       90.03
          1 |      2,687        9.97      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,220       89.83       89.83
          1 |      2,742       10.17      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,241       89.91       89.91
          1 |      2,721       10.09      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,226       89.85       89.85
          1 |      2,736       10.15      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      2,648        9.82        9.82
          One vaccination |      2,747       10.19       20.01
       Three vaccinations |     13,508       50.10       70.11
         Two vaccinations |      2,634        9.77       79.88
            Un-vaccinated |      2,718       10.08       89.96
 Un-vaccinated (declined) |      2,707       10.04      100.00
--------------------------+-----------------------------------
                    Total |     26,962      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination_status_g=="Un-vaccinated (declined)"
(21,537 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(2,747 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(2,634 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(13,508 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinations"
(2,648 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(10,806 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(10,806 real changes made)

. * time between vaccine and covid positive test or treatment
. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(3,871 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -471           -578
 5%         -332           -571
10%         -225           -570       Obs              23,091
25%          -13           -570       Sum of wgt.      23,091

50%          274                      Mean           274.2234
                        Largest       Std. dev.      371.0403
75%          560           1126
90%          773           1126       Variance       137670.9
95%          883           1126       Skewness        .005648
99%         1027           1129       Kurtosis       2.198808

. gen days_vacc_treat=date_treated - last_vaccination_date
(24,947 missing values generated)

. sum days_vacc_treat,de

                       days_vacc_treat
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -474           -574
 5%         -343           -560
10%         -234           -550       Obs               2,015
25%           -7           -548       Sum of wgt.       2,015

50%          271                      Mean           274.7479
                        Largest       Std. dev.      375.8845
75%          566           1099
90%          781           1103       Variance       141289.2
95%          883           1123       Skewness       .0100367
99%         1039           1126       Kurtosis       2.185257

. gen days_vacc_treat_test = days_vacc_treat
(24,947 missing values generated)

. replace days_vacc_treat_test = days_vacc_covid if days_vacc_treat_test==.
(21,294 real changes made)

. sum days_vacc_treat_test,de

                    days_vacc_treat_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -473           -578
 5%         -334           -574
10%         -226           -571       Obs              23,309
25%          -12           -570       Sum of wgt.      23,309

50%          273                      Mean           274.1028
                        Largest       Std. dev.      371.4609
75%          560           1126
90%          774           1126       Variance       137983.2
95%          883           1126       Skewness       .0054381
99%         1027           1126       Kurtosis        2.19955

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(3,871 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -19 |          4        0.01        0.01
        -18 |         22        0.08        0.10
        -17 |         66        0.24        0.34
        -16 |        105        0.39        0.73
        -15 |        131        0.49        1.22
        -14 |        177        0.66        1.87
        -13 |        195        0.72        2.60
        -12 |        237        0.88        3.48
        -11 |        242        0.90        4.37
        -10 |        288        1.07        5.44
         -9 |        323        1.20        6.64
         -8 |        344        1.28        7.91
         -7 |        361        1.34        9.25
         -6 |        409        1.52       10.77
         -5 |        440        1.63       12.40
         -4 |        456        1.69       14.09
         -3 |        534        1.98       16.07
         -2 |        555        2.06       18.13
         -1 |        595        2.21       20.34
          0 |        567        2.10       22.44
          1 |        571        2.12       24.56
          2 |        557        2.07       26.63
          3 |        618        2.29       28.92
          4 |        612        2.27       31.19
          5 |        604        2.24       33.43
          6 |        622        2.31       35.74
          7 |        615        2.28       38.02
          8 |        621        2.30       40.32
          9 |        596        2.21       42.53
         10 |        632        2.34       44.87
         11 |        596        2.21       47.08
         12 |        573        2.13       49.21
         13 |        652        2.42       51.63
         14 |        604        2.24       53.87
         15 |        604        2.24       56.11
         16 |        591        2.19       58.30
         17 |        582        2.16       60.46
         18 |        628        2.33       62.79
         19 |        629        2.33       65.12
         20 |        563        2.09       67.21
         21 |        560        2.08       69.29
         22 |        485        1.80       71.09
         23 |        450        1.67       72.75
         24 |        452        1.68       74.43
         25 |        399        1.48       75.91
         26 |        431        1.60       77.51
         27 |        324        1.20       78.71
         28 |        318        1.18       79.89
         29 |        292        1.08       80.97
         30 |        265        0.98       81.96
         31 |        232        0.86       82.82
         32 |        201        0.75       83.56
         33 |        160        0.59       84.16
         34 |        142        0.53       84.68
         35 |        106        0.39       85.08
         36 |         80        0.30       85.37
         37 |         56        0.21       85.58
         38 |         17        0.06       85.64
          . |      3,871       14.36      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             -3
 5%           26             -3
10%           56             -3       Obs              26,962
25%          143             -3       Sum of wgt.      26,962

50%          290                      Mean           290.4837
                        Largest       Std. dev.       170.353
75%          438            586
90%          528            586       Variance       29020.15
95%          555            586       Skewness       .0073715
99%          580            586       Kurtosis       1.792988

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        211        0.78        0.78
          1 |      1,358        5.04        5.82
          2 |      1,356        5.03       10.85
          3 |      1,396        5.18       16.03
          4 |      1,388        5.15       21.17
          5 |      1,391        5.16       26.33
          6 |      1,434        5.32       31.65
          7 |      1,350        5.01       36.66
          8 |      1,358        5.04       41.70
          9 |      1,341        4.97       46.67
         10 |      1,370        5.08       51.75
         11 |      1,408        5.22       56.97
         12 |      1,323        4.91       61.88
         13 |      1,377        5.11       66.99
         14 |      1,305        4.84       71.83
         15 |      1,394        5.17       77.00
         16 |      1,363        5.06       82.05
         17 |      1,343        4.98       87.03
         18 |      1,477        5.48       92.51
         19 |      1,339        4.97       97.48
         20 |        680        2.52      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Variant
. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. * Prior infection
. tab prior_covid, m

prior_covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,898       70.09       70.09
          1 |      8,064       29.91      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. gen prior_covid_index=1 if prior_covid==1 & prior_covid_date<campaign_start
(26,911 missing values generated)

. tab prior_covid_index,m

prior_covid |
     _index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         51        0.19        0.19
          . |     26,911       99.81      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. replace prior_covid_index=0 if prior_covid_index==.
(26,911 real changes made)

. *Contraindications for Pax*
. tab drug if organ_transplant==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      8,178       96.69       96.69
  sotrovimab |        105        1.24       97.93
    paxlovid |         80        0.95       98.88
molnupiravir |         95        1.12      100.00
-------------+-----------------------------------
       Total |      8,458      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,647       96.50       96.50
  sotrovimab |         34        1.24       97.74
    paxlovid |         33        1.20       98.94
molnupiravir |         29        1.06      100.00
-------------+-----------------------------------
       Total |      2,743      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      9,153       96.85       96.85
  sotrovimab |         99        1.05       97.89
    paxlovid |         91        0.96       98.86
molnupiravir |        108        1.14      100.00
-------------+-----------------------------------
       Total |      9,451      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vaccine-breakthrough/blob/updates-feb/analysis/data_process.R*
. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  57.00538  48.06602  59.06091  69.41504 -7.423844  122.2147
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_ctv3_date>start_date
(13,406 real changes made, 13,406 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.18135  50.12827  60.03422  69.91559  20.05574  114.8595
--------------------------------------------------------------------------

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(13,556 real changes made)

. gen min_creatinine_ctv3=.
(26,962 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(6,961 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(6,595 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(3,772 real changes made)

. gen max_creatinine_ctv3=.
(26,962 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(6,961 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(6,595 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(23,190 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(13,587 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(6,862 real changes made)

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
cre~e_snomed |  22.59454         0         0  45.07763 -36.83941  118.3562
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(20,530 real changes made, 20,530 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(creatinine_snomed)
(13,811 real changes made, 3,566 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if missing(creatinine_snomed)
(11,378 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creatinine_snomed)
(20,298 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_snomed)
(20,530 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(16,044 real changes made, 16,044 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(10,918 real changes made)

. gen min_creatinine_snomed=.
(26,962 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(5,635 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(5,283 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(1,535 real changes made)

. gen max_creatinine_snomed=.
(26,962 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(5,635 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(5,283 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(25,427 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*(0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snomed<=120
(16,162 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(5,573 real changes made)

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egfr_record>
> 0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<60&egfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(23,472 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egfr_record>
> 0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<30&egfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(26,168 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      3,366       96.45       96.45
  sotrovimab |         35        1.00       97.45
    paxlovid |         44        1.26       98.71
molnupiravir |         45        1.29      100.00
-------------+-----------------------------------
       Total |      3,490      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        766       96.47       96.47
  sotrovimab |         10        1.26       97.73
    paxlovid |          6        0.76       98.49
molnupiravir |         12        1.51      100.00
-------------+-----------------------------------
       Total |        794      100.00

. *drug interactions*
. tab drug if drugs_paxlovid_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        692       96.78       96.78
  sotrovimab |          7        0.98       97.76
    paxlovid |          7        0.98       98.74
molnupiravir |          9        1.26      100.00
-------------+-----------------------------------
       Total |        715      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        692       96.78       96.78
  sotrovimab |          7        0.98       97.76
    paxlovid |          7        0.98       98.74
molnupiravir |          9        1.26      100.00
-------------+-----------------------------------
       Total |        715      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        568       96.11       96.11
  sotrovimab |          7        1.18       97.29
    paxlovid |          7        1.18       98.48
molnupiravir |          9        1.52      100.00
-------------+-----------------------------------
       Total |        591      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        344       96.63       96.63
  sotrovimab |          4        1.12       97.75
    paxlovid |          4        1.12       98.88
molnupiravir |          4        1.12      100.00
-------------+-----------------------------------
       Total |        356      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        688       95.96       95.96
  sotrovimab |         10        1.39       97.35
    paxlovid |          6        0.84       98.19
molnupiravir |         13        1.81      100.00
-------------+-----------------------------------
       Total |        717      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_interaction>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        688       95.96       95.96
  sotrovimab |         10        1.39       97.35
    paxlovid |          6        0.84       98.19
molnupiravir |         13        1.81      100.00
-------------+-----------------------------------
       Total |        717      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_interaction>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        547       95.30       95.30
  sotrovimab |         10        1.74       97.04
    paxlovid |          4        0.70       97.74
molnupiravir |         13        2.26      100.00
-------------+-----------------------------------
       Total |        574      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_interaction>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        328       95.35       95.35
  sotrovimab |          5        1.45       96.80
    paxlovid |          1        0.29       97.09
molnupiravir |         10        2.91      100.00
-------------+-----------------------------------
       Total |        344      100.00

. gen paxlovid_interaction=(drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction>=(start_date-180))  

. gen nirmatrelvir_interaction=(drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_interaction>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contraindicated = 1 if egfr_30==1 | dialysis==1
(23,493 missing values generated)

. replace paxlovid_contraindicated = 1 if liver_disease==1 
(4,487 real changes made)

. replace paxlovid_contraindicated = 1 if organ_transplant==1 
(5,943 real changes made)

. replace paxlovid_contraindicated = 1 if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction>=(start_date-180)
(184 real changes made)

. recode paxlovid_contraindicated . = 0
(12879 changes made to paxlovid_contraindicated)

. by drug, sort: count if paxlovid_contraindicated==1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  13,627
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  165
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  138
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  153

. 
. ****************************
. *       COX MODEL               *
. ****************************
. global ae               ae_spc_all                              ///
>                                 ae_drug_all                             ///             
>                                 ae_imae_all                     ///                             
>                                 ae_all                                  ///
>                                 allcause_emerg_aande    ///
>                                 covid_hosp_date                 ///
>                                 all_hosp_date                   ///
>                                 died_date_ons

. * Generate failure 
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         by drug, sort: count if `x'!=.
  4.         by drug, sort: count if `x'>=start_date & `x'!=.
  5.         by drug, sort: count if `x'>=start_date & `x'<start_date_28 &`x'!=.
  6.         gen fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, paxlovid, molnupiravir)) if drug==1
  7.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, sotrovimab, molnupiravir)) if drug==2
  8.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, sotrovimab, paxlovid)) if drug==3
  9.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, sotrovimab, paxlovid, molnupiravir)) if drug==0
 10.         tab drug fail_`x', m
 11. }
ae_spc_all

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  24,921
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  263
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  275
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  276

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,135
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  91
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  84
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  90

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,130
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  22
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  12
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     8,983     17,132 |    26,115 
  sotrovimab |        89        186 |       275 
    paxlovid |        88        194 |       282 
molnupiravir |        99        191 |       290 
-------------+----------------------+----------
       Total |     9,259     17,703 |    26,962 
ae_drug_all

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  24,851
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  267
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  265
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  275

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  7,988
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  83
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  74
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  99

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,154
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  12
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  13
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |   fail_ae_drug_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     8,881     17,234 |    26,115 
  sotrovimab |        87        188 |       275 
    paxlovid |        81        201 |       282 
molnupiravir |       111        179 |       290 
-------------+----------------------+----------
       Total |     9,160     17,802 |    26,962 
ae_imae_all

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  25,986
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  274
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  281
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  288

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,317
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  57
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  46
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  62

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,135
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  10
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  14
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  16
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     4,565     21,550 |    26,115 
  sotrovimab |        47        228 |       275 
    paxlovid |        33        249 |       282 
molnupiravir |        48        242 |       290 
-------------+----------------------+----------
       Total |     4,693     22,269 |    26,962 
ae_all

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  26,113
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  275
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  282
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  290

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,899
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  24
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  28
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  35

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,046
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  10
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  14
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  15
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     1,887     24,228 |    26,115 
  sotrovimab |        14        261 |       275 
    paxlovid |        14        268 |       282 
molnupiravir |        18        272 |       290 
-------------+----------------------+----------
       Total |     1,933     25,029 |    26,962 
allcause_emerg_aande

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,298
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  16
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  16

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  721
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  10
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  54
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_allcause_emerg_a
             |         ande
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,588        527 |    26,115 
  sotrovimab |       269          6 |       275 
    paxlovid |       279          3 |       282 
molnupiravir |       284          6 |       290 
-------------+----------------------+----------
       Total |    26,420        542 |    26,962 
covid_hosp_date

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,612
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  27
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  23
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  25

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,432
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  11
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  13
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  17

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  125
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_covid_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,018      1,097 |    26,115 
  sotrovimab |       261         14 |       275 
    paxlovid |       272         10 |       282 
molnupiravir |       281          9 |       290 
-------------+----------------------+----------
       Total |    25,832      1,130 |    26,962 
all_hosp_date

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,662
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  19
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  28
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  35

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,487
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  19
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  23

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  121
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_all_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,011      1,104 |    26,115 
  sotrovimab |       265         10 |       275 
    paxlovid |       273          9 |       282 
molnupiravir |       275         15 |       290 
-------------+----------------------+----------
       Total |    25,824      1,138 |    26,962 
died_date_ons

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  15,705
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  167
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  175
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  182

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,960
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  59
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  51
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  62

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  472
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_died_date_ons
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    15,677     10,438 |    26,115 
  sotrovimab |       167        108 |       275 
    paxlovid |       164        118 |       282 
molnupiravir |       173        117 |       290 
-------------+----------------------+----------
       Total |    16,181     10,781 |    26,962 
ae_diverticulitis_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,360
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  121
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  104
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  110

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,253
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  64
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  57
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  53

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  491
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  14
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,339      4,776 |    26,115 
  sotrovimab |       217         58 |       275 
    paxlovid |       243         39 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    22,036      4,926 |    26,962 
ae_diarrhoea_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,548
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  99
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  116
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  108

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,347
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  54
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  54

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  479
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  11
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  6
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,240      4,875 |    26,115 
  sotrovimab |       229         46 |       275 
    paxlovid |       222         60 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    21,928      5,034 |    26,962 
ae_taste_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,480
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  112
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  115
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  117

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,288
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  60
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  56

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  447
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,263      4,852 |    26,115 
  sotrovimab |       219         56 |       275 
    paxlovid |       230         52 |       282 
molnupiravir |       232         58 |       290 
-------------+----------------------+----------
       Total |    21,944      5,018 |    26,962 
ae_diverticulitis_icd_prim

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,490
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  108
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  119
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  108

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,411
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  66
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  60
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  52

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  489
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  10
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diverticuliti
             |      s_icd_prim
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,346      4,769 |    26,115 
  sotrovimab |       230         45 |       275 
    paxlovid |       227         55 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    22,043      4,919 |    26,962 
ae_taste_icd_prim

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,347
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  106
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  110
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  116

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,192
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  54
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  75

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  469
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  8
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  12
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_taste_icd_pri
             |           m
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,299      4,816 |    26,115 
  sotrovimab |       232         43 |       275 
    paxlovid |       230         52 |       282 
molnupiravir |       249         41 |       290 
-------------+----------------------+----------
       Total |    22,010      4,952 |    26,962 
ae_diverticulitis_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,362
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  103
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  117
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  113

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,282
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  50
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  55
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  51

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  479
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diverticuliti
             |         s_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,354      4,761 |    26,115 
  sotrovimab |       226         49 |       275 
    paxlovid |       221         61 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    22,041      4,921 |    26,962 
ae_anaphylaxis_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,394
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  115
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  118
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  98

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,300
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  60
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  62
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  52

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  536
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,289      4,826 |    26,115 
  sotrovimab |       224         51 |       275 
    paxlovid |       223         59 |       282 
molnupiravir |       250         40 |       290 
-------------+----------------------+----------
       Total |    21,986      4,976 |    26,962 
ae_rash_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,438
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  116
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  105
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  110

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,321
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  63
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  48
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  61

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  527
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_ae_rash_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,277      4,838 |    26,115 
  sotrovimab |       224         51 |       275 
    paxlovid |       228         54 |       282 
molnupiravir |       242         48 |       290 
-------------+----------------------+----------
       Total |    21,971      4,991 |    26,962 
ae_anaphylaxis_icd_prim

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,482
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  111
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  115
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  112

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,331
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  50
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  52
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  57

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  480
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  8
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  6
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_anaphylaxis_i
             |        cd_prim
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,262      4,853 |    26,115 
  sotrovimab |       215         60 |       275 
    paxlovid |       219         63 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    21,933      5,029 |    26,962 
ae_anaphlaxis_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,492
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  113
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  114
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  118

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,386
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  48
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  60
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  66

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  509
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  7
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_anaphlaxis_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,274      4,841 |    26,115 
  sotrovimab |       213         62 |       275 
    paxlovid |       229         53 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    21,956      5,006 |    26,962 
ae_drugreact_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,450
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  111
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  107
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  125

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,309
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  59
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  58
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  59

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  498
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_drugreact_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,312      4,803 |    26,115 
  sotrovimab |       225         50 |       275 
    paxlovid |       235         47 |       282 
molnupiravir |       225         65 |       290 
-------------+----------------------+----------
       Total |    21,997      4,965 |    26,962 
ae_allergic_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  10,428
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  112
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  112
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  119

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,268
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  59
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  53
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  67

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  464
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_ae_allergic_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,258      4,857 |    26,115 
  sotrovimab |       225         50 |       275 
    paxlovid |       228         54 |       282 
molnupiravir |       244         46 |       290 
-------------+----------------------+----------
       Total |    21,955      5,007 |    26,962 
new_ae_ra_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,382
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  100
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  85
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  90

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,204
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  48
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  42
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  44

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  377
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,169      3,946 |    26,115 
  sotrovimab |       226         49 |       275 
    paxlovid |       242         40 |       282 
molnupiravir |       248         42 |       290 
-------------+----------------------+----------
       Total |    22,885      4,077 |    26,962 
new_ae_sle_ctv

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,401
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  83
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  85
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  104

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,177
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  40
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  45
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  55

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  396
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,171      3,944 |    26,115 
  sotrovimab |       234         41 |       275 
    paxlovid |       240         42 |       282 
molnupiravir |       242         48 |       290 
-------------+----------------------+----------
       Total |    22,887      4,075 |    26,962 
new_ae_psoriasis_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,458
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  95
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  97
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  105

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,792
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  49
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  50
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  53

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  490
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,632      4,483 |    26,115 
  sotrovimab |       231         44 |       275 
    paxlovid |       234         48 |       282 
molnupiravir |       243         47 |       290 
-------------+----------------------+----------
       Total |    22,340      4,622 |    26,962 
new_ae_psa_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,385
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  103
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  117
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  104

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,806
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  41
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  62
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  52

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  437
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  8
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,764      4,351 |    26,115 
  sotrovimab |       212         63 |       275 
    paxlovid |       229         53 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    22,445      4,517 |    26,962 
new_ae_ankspon_ctv

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,394
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  101
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  96
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  112

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,813
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  49
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  43
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  56

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  448
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  10
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,779      4,336 |    26,115 
  sotrovimab |       226         49 |       275 
    paxlovid |       232         50 |       282 
molnupiravir |       234         56 |       290 
-------------+----------------------+----------
       Total |    22,471      4,491 |    26,962 
new_ae_ibd_snomed

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,458
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  107
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  114
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  105

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,833
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  53
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  58
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  47

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  450
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,734      4,381 |    26,115 
  sotrovimab |       225         50 |       275 
    paxlovid |       226         56 |       282 
molnupiravir |       234         56 |       290 
-------------+----------------------+----------
       Total |    22,419      4,543 |    26,962 
new_ae_ra_icd_prim

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,452
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  81
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  100
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  80

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,254
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  36
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  52
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  41

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  394
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ra_icd_pr
             |          im
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,176      3,939 |    26,115 
  sotrovimab |       233         42 |       275 
    paxlovid |       237         45 |       282 
molnupiravir |       248         42 |       290 
-------------+----------------------+----------
       Total |    22,894      4,068 |    26,962 
new_ae_sle_icd_prim

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,522
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  94
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  97
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  100

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,410
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  48
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  40
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  56

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  422
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  8
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_sle_icd_p
             |          rim
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,205      3,910 |    26,115 
  sotrovimab |       234         41 |       275 
    paxlovid |       225         57 |       282 
molnupiravir |       247         43 |       290 
-------------+----------------------+----------
       Total |    22,911      4,051 |    26,962 
new_ae_ra_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,427
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  86
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  84
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  86

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,255
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  47
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  41
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  39

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  383
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  7
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |   fail_new_ae_ra_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,175      3,940 |    26,115 
  sotrovimab |       231         44 |       275 
    paxlovid |       239         43 |       282 
molnupiravir |       243         47 |       290 
-------------+----------------------+----------
       Total |    22,888      4,074 |    26,962 
new_ae_sle_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,442
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  86
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  74
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  91

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,262
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  40
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  31
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  56

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  389
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_sle_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,172      3,943 |    26,115 
  sotrovimab |       230         45 |       275 
    paxlovid |       244         38 |       282 
molnupiravir |       253         37 |       290 
-------------+----------------------+----------
       Total |    22,899      4,063 |    26,962 
new_ae_psoriasis_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,378
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  101
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  87
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  113

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,797
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  54
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  38
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  59

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  431
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_psoriasis
             |          _ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,800      4,315 |    26,115 
  sotrovimab |       228         47 |       275 
    paxlovid |       238         44 |       282 
molnupiravir |       239         51 |       290 
-------------+----------------------+----------
       Total |    22,505      4,457 |    26,962 
new_ae_psa_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,352
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  98
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  93
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  93

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,742
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  58
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  47
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  48

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  451
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  6
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_psa_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,757      4,358 |    26,115 
  sotrovimab |       233         42 |       275 
    paxlovid |       239         43 |       282 
molnupiravir |       248         42 |       290 
-------------+----------------------+----------
       Total |    22,477      4,485 |    26,962 
new_ae_ankspon_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,425
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  93
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  100
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  106

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,780
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  50
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  44
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  54

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  433
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ankspon_a
             |           e
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,745      4,370 |    26,115 
  sotrovimab |       236         39 |       275 
    paxlovid |       230         52 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    22,448      4,514 |    26,962 
new_ae_ibd_ae

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,338
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  101
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  98
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  88

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,757
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  44
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  45
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  37

---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  439
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_ibd_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,793      4,322 |    26,115 
  sotrovimab |       218         57 |       275 
    paxlovid |       232         50 |       282 
molnupiravir |       238         52 |       290 
-------------+----------------------+----------
       Total |    22,481      4,481 |    26,962 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         replace `x'=`x'+0.5 if `x'==start_date
  4. }
ae_spc_all
(52 real changes made)
ae_drug_all
(48 real changes made)
ae_imae_all
(51 real changes made)
ae_all
(54 real changes made)
allcause_emerg_aande
(4 real changes made)
covid_hosp_date
(8 real changes made)
all_hosp_date
(3 real changes made)
died_date_ons
(13 real changes made)
ae_diverticulitis_snomed
(15 real changes made)
ae_diarrhoea_snomed
(20 real changes made)
ae_taste_snomed
(19 real changes made)
ae_diverticulitis_icd_prim
(26 real changes made)
ae_taste_icd_prim
(23 real changes made)
ae_diverticulitis_ae
(12 real changes made)
ae_anaphylaxis_snomed
(17 real changes made)
ae_rash_snomed
(26 real changes made)
ae_anaphylaxis_icd_prim
(18 real changes made)
ae_anaphlaxis_ae
(28 real changes made)
ae_drugreact_ae
(23 real changes made)
ae_allergic_ae
(13 real changes made)
new_ae_ra_snomed
(19 real changes made)
new_ae_sle_ctv
(15 real changes made)
new_ae_psoriasis_snomed
(22 real changes made)
new_ae_psa_snomed
(17 real changes made)
new_ae_ankspon_ctv
(15 real changes made)
new_ae_ibd_snomed
(21 real changes made)
new_ae_ra_icd_prim
(14 real changes made)
new_ae_sle_icd_prim
(19 real changes made)
new_ae_ra_ae
(20 real changes made)
new_ae_sle_ae
(23 real changes made)
new_ae_psoriasis_ae
(11 real changes made)
new_ae_psa_ae
(15 real changes made)
new_ae_ankspon_ae
(9 real changes made)
new_ae_ibd_ae
(12 real changes made)

. 
. *Generate censor date
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         gen stop_`x'=`x' if fail_`x'==1
  3.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_date_28,paxlovid,molnupiravir) if fail_`x'==0&drug==1
  4.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_date_28,sotrovimab,molnupiravir) if fail_`x'==0&drug==2
  5.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_date_28,sotrovimab,paxlovid) if fail_`x'==0&drug==3
  6.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_date_28,sotrovimab,paxlovid,molnupiravir) if fail_`x'==0&drug==0
  7.         format %td stop_`x'
  8. }
(9,259 missing values generated)
(89 real changes made)
(88 real changes made)
(99 real changes made)
(8,983 real changes made)
(9,160 missing values generated)
(87 real changes made)
(81 real changes made)
(111 real changes made)
(8,881 real changes made)
(4,693 missing values generated)
(47 real changes made)
(33 real changes made)
(48 real changes made)
(4,565 real changes made)
(1,933 missing values generated)
(14 real changes made)
(14 real changes made)
(18 real changes made)
(1,887 real changes made)
(26,420 missing values generated)
(269 real changes made)
(279 real changes made)
(284 real changes made)
(25,588 real changes made)
(25,832 missing values generated)
(261 real changes made)
(272 real changes made)
(281 real changes made)
(25,018 real changes made)
(25,824 missing values generated)
(265 real changes made)
(273 real changes made)
(275 real changes made)
(25,011 real changes made)
(16,181 missing values generated)
(167 real changes made)
(164 real changes made)
(173 real changes made)
(15,677 real changes made)
(22,036 missing values generated)
(217 real changes made)
(243 real changes made)
(237 real changes made)
(21,339 real changes made)
(21,928 missing values generated)
(229 real changes made)
(222 real changes made)
(237 real changes made)
(21,240 real changes made)
(21,944 missing values generated)
(219 real changes made)
(230 real changes made)
(232 real changes made)
(21,263 real changes made)
(22,043 missing values generated)
(230 real changes made)
(227 real changes made)
(240 real changes made)
(21,346 real changes made)
(22,010 missing values generated)
(232 real changes made)
(230 real changes made)
(249 real changes made)
(21,299 real changes made)
(22,041 missing values generated)
(226 real changes made)
(221 real changes made)
(240 real changes made)
(21,354 real changes made)
(21,986 missing values generated)
(224 real changes made)
(223 real changes made)
(250 real changes made)
(21,289 real changes made)
(21,971 missing values generated)
(224 real changes made)
(228 real changes made)
(242 real changes made)
(21,277 real changes made)
(21,933 missing values generated)
(215 real changes made)
(219 real changes made)
(237 real changes made)
(21,262 real changes made)
(21,956 missing values generated)
(213 real changes made)
(229 real changes made)
(240 real changes made)
(21,274 real changes made)
(21,997 missing values generated)
(225 real changes made)
(235 real changes made)
(225 real changes made)
(21,312 real changes made)
(21,955 missing values generated)
(225 real changes made)
(228 real changes made)
(244 real changes made)
(21,258 real changes made)
(22,885 missing values generated)
(226 real changes made)
(242 real changes made)
(248 real changes made)
(22,169 real changes made)
(22,887 missing values generated)
(234 real changes made)
(240 real changes made)
(242 real changes made)
(22,171 real changes made)
(22,340 missing values generated)
(231 real changes made)
(234 real changes made)
(243 real changes made)
(21,632 real changes made)
(22,445 missing values generated)
(212 real changes made)
(229 real changes made)
(240 real changes made)
(21,764 real changes made)
(22,471 missing values generated)
(226 real changes made)
(232 real changes made)
(234 real changes made)
(21,779 real changes made)
(22,419 missing values generated)
(225 real changes made)
(226 real changes made)
(234 real changes made)
(21,734 real changes made)
(22,894 missing values generated)
(233 real changes made)
(237 real changes made)
(248 real changes made)
(22,176 real changes made)
(22,911 missing values generated)
(234 real changes made)
(225 real changes made)
(247 real changes made)
(22,205 real changes made)
(22,888 missing values generated)
(231 real changes made)
(239 real changes made)
(243 real changes made)
(22,175 real changes made)
(22,899 missing values generated)
(230 real changes made)
(244 real changes made)
(253 real changes made)
(22,172 real changes made)
(22,505 missing values generated)
(228 real changes made)
(238 real changes made)
(239 real changes made)
(21,800 real changes made)
(22,477 missing values generated)
(233 real changes made)
(239 real changes made)
(248 real changes made)
(21,757 real changes made)
(22,448 missing values generated)
(236 real changes made)
(230 real changes made)
(237 real changes made)
(21,745 real changes made)
(22,481 missing values generated)
(218 real changes made)
(232 real changes made)
(238 real changes made)
(21,793 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_date) failure(fail_ae_all==1) 

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date

--------------------------------------------------------------------------
     26,962  total observations
     23,988  observations end on or before enter()
--------------------------------------------------------------------------
      2,974  observations remaining, representing
      2,974  subjects
      1,128  failures in single-failure-per-subject data
   65,324.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        28

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==1&min(paxlovid,molnupiravir)==stop_ae_all
  0

. count if fail_ae_all==0&drug==2&min(sotrovimab,molnupiravir)==stop_ae_all
  0

. count if fail_ae_all==0&drug==3&min(sotrovimab,paxlovid,remdesivir,casirivimab)==stop_ae_all
  0

. count if fail_ae_all==0&drug==0&min(sotrovimab,paxlovid,molnupiravir)==stop_ae_all
  72

. tab _st  // keep if _st==1 -> removes observations that end on or before enter 

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,988       88.97       88.97
          1 |      2,974       11.03      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. count if start_date>=stop_ae_all & _st==0
  23,988

. count if start_date==stop_ae_all & _st==0
  6

. tab _t,m

   Analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
         .5 |         53        0.20        0.20
          1 |         50        0.19        0.38
          2 |         52        0.19        0.57
          3 |         46        0.17        0.75
          4 |         58        0.22        0.96
          5 |         61        0.23        1.19
          6 |         47        0.17        1.36
          7 |         46        0.17        1.53
          8 |         42        0.16        1.69
          9 |         32        0.12        1.81
         10 |         39        0.14        1.95
         11 |         48        0.18        2.13
         12 |         33        0.12        2.25
         13 |         43        0.16        2.41
         14 |         40        0.15        2.56
         15 |         39        0.14        2.70
         16 |         39        0.14        2.85
         17 |         45        0.17        3.02
         18 |         23        0.09        3.10
         19 |         31        0.11        3.22
         20 |         28        0.10        3.32
         21 |         28        0.10        3.42
         22 |         41        0.15        3.58
         23 |         40        0.15        3.72
         24 |         22        0.08        3.81
         25 |         40        0.15        3.95
         26 |         31        0.11        4.07
         27 |         29        0.11        4.18
         28 |      1,848        6.85       11.03
          . |     23,988       88.97      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        50          0          1          2 |        53 
           |      0.19       0.00       0.35       0.69 |      0.20 
-----------+--------------------------------------------+----------
         1 |        49          1          0          0 |        50 
           |      0.19       0.36       0.00       0.00 |      0.19 
-----------+--------------------------------------------+----------
         2 |        48          2          2          0 |        52 
           |      0.18       0.73       0.71       0.00 |      0.19 
-----------+--------------------------------------------+----------
         3 |        44          1          0          1 |        46 
           |      0.17       0.36       0.00       0.34 |      0.17 
-----------+--------------------------------------------+----------
         4 |        52          3          2          1 |        58 
           |      0.20       1.09       0.71       0.34 |      0.22 
-----------+--------------------------------------------+----------
         5 |        60          0          1          0 |        61 
           |      0.23       0.00       0.35       0.00 |      0.23 
-----------+--------------------------------------------+----------
         6 |        47          0          0          0 |        47 
           |      0.18       0.00       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
         7 |        45          1          0          0 |        46 
           |      0.17       0.36       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
         8 |        40          0          1          1 |        42 
           |      0.15       0.00       0.35       0.34 |      0.16 
-----------+--------------------------------------------+----------
         9 |        30          1          1          0 |        32 
           |      0.11       0.36       0.35       0.00 |      0.12 
-----------+--------------------------------------------+----------
        10 |        39          0          0          0 |        39 
           |      0.15       0.00       0.00       0.00 |      0.14 
-----------+--------------------------------------------+----------
        11 |        47          0          0          1 |        48 
           |      0.18       0.00       0.00       0.34 |      0.18 
-----------+--------------------------------------------+----------
        12 |        32          0          1          0 |        33 
           |      0.12       0.00       0.35       0.00 |      0.12 
-----------+--------------------------------------------+----------
        13 |        41          0          1          1 |        43 
           |      0.16       0.00       0.35       0.34 |      0.16 
-----------+--------------------------------------------+----------
        14 |        38          0          0          2 |        40 
           |      0.15       0.00       0.00       0.69 |      0.15 
-----------+--------------------------------------------+----------
        15 |        39          0          0          0 |        39 
           |      0.15       0.00       0.00       0.00 |      0.14 
-----------+--------------------------------------------+----------
        16 |        37          0          1          1 |        39 
           |      0.14       0.00       0.35       0.34 |      0.14 
-----------+--------------------------------------------+----------
        17 |        44          1          0          0 |        45 
           |      0.17       0.36       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
        18 |        21          1          1          0 |        23 
           |      0.08       0.36       0.35       0.00 |      0.09 
-----------+--------------------------------------------+----------
        19 |        31          0          0          0 |        31 
           |      0.12       0.00       0.00       0.00 |      0.11 
-----------+--------------------------------------------+----------
        20 |        27          0          0          1 |        28 
           |      0.10       0.00       0.00       0.34 |      0.10 
-----------+--------------------------------------------+----------
        21 |        28          0          0          0 |        28 
           |      0.11       0.00       0.00       0.00 |      0.10 
-----------+--------------------------------------------+----------
        22 |        39          0          0          2 |        41 
           |      0.15       0.00       0.00       0.69 |      0.15 
-----------+--------------------------------------------+----------
        23 |        39          0          1          0 |        40 
           |      0.15       0.00       0.35       0.00 |      0.15 
-----------+--------------------------------------------+----------
        24 |        22          0          0          0 |        22 
           |      0.08       0.00       0.00       0.00 |      0.08 
-----------+--------------------------------------------+----------
        25 |        38          0          1          1 |        40 
           |      0.15       0.00       0.35       0.34 |      0.15 
-----------+--------------------------------------------+----------
        26 |        30          0          0          1 |        31 
           |      0.11       0.00       0.00       0.34 |      0.11 
-----------+--------------------------------------------+----------
        27 |        28          0          1          0 |        29 
           |      0.11       0.00       0.35       0.00 |      0.11 
-----------+--------------------------------------------+----------
        28 |     1,802         13         13         20 |     1,848 
           |      6.90       4.73       4.61       6.90 |      6.85 
-----------+--------------------------------------------+----------
         . |    23,228        251        254        255 |    23,988 
           |     88.95      91.27      90.07      87.93 |     88.97 
-----------+--------------------------------------------+----------
     Total |    26,115        275        282        290 |    26,962 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        50          0          1          2 |        53 
           |      0.21       0.00       0.37       0.74 |      0.21 
-----------+--------------------------------------------+----------
         1 |        45          1          0          0 |        46 
           |      0.19       0.38       0.00       0.00 |      0.18 
-----------+--------------------------------------------+----------
         2 |        42          1          1          0 |        44 
           |      0.17       0.38       0.37       0.00 |      0.18 
-----------+--------------------------------------------+----------
         3 |        38          1          0          1 |        40 
           |      0.16       0.38       0.00       0.37 |      0.16 
-----------+--------------------------------------------+----------
         4 |        40          3          2          1 |        46 
           |      0.17       1.15       0.75       0.37 |      0.18 
-----------+--------------------------------------------+----------
         5 |        54          0          1          0 |        55 
           |      0.22       0.00       0.37       0.00 |      0.22 
-----------+--------------------------------------------+----------
         6 |        41          0          0          0 |        41 
           |      0.17       0.00       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
         7 |        45          1          0          0 |        46 
           |      0.19       0.38       0.00       0.00 |      0.18 
-----------+--------------------------------------------+----------
         8 |        40          0          1          1 |        42 
           |      0.17       0.00       0.37       0.37 |      0.17 
-----------+--------------------------------------------+----------
         9 |        30          1          1          0 |        32 
           |      0.12       0.38       0.37       0.00 |      0.13 
-----------+--------------------------------------------+----------
        10 |        39          0          0          0 |        39 
           |      0.16       0.00       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
        11 |        47          0          0          1 |        48 
           |      0.19       0.00       0.00       0.37 |      0.19 
-----------+--------------------------------------------+----------
        12 |        32          0          1          0 |        33 
           |      0.13       0.00       0.37       0.00 |      0.13 
-----------+--------------------------------------------+----------
        13 |        41          0          1          1 |        43 
           |      0.17       0.00       0.37       0.37 |      0.17 
-----------+--------------------------------------------+----------
        14 |        36          0          0          2 |        38 
           |      0.15       0.00       0.00       0.74 |      0.15 
-----------+--------------------------------------------+----------
        15 |        39          0          0          0 |        39 
           |      0.16       0.00       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
        16 |        37          0          1          1 |        39 
           |      0.15       0.00       0.37       0.37 |      0.16 
-----------+--------------------------------------------+----------
        17 |        44          1          0          0 |        45 
           |      0.18       0.38       0.00       0.00 |      0.18 
-----------+--------------------------------------------+----------
        18 |        20          1          1          0 |        22 
           |      0.08       0.38       0.37       0.00 |      0.09 
-----------+--------------------------------------------+----------
        19 |        31          0          0          0 |        31 
           |      0.13       0.00       0.00       0.00 |      0.12 
-----------+--------------------------------------------+----------
        20 |        27          0          0          1 |        28 
           |      0.11       0.00       0.00       0.37 |      0.11 
-----------+--------------------------------------------+----------
        21 |        28          0          0          0 |        28 
           |      0.12       0.00       0.00       0.00 |      0.11 
-----------+--------------------------------------------+----------
        22 |        39          0          0          2 |        41 
           |      0.16       0.00       0.00       0.74 |      0.16 
-----------+--------------------------------------------+----------
        23 |        39          0          1          0 |        40 
           |      0.16       0.00       0.37       0.00 |      0.16 
-----------+--------------------------------------------+----------
        24 |        22          0          0          0 |        22 
           |      0.09       0.00       0.00       0.00 |      0.09 
-----------+--------------------------------------------+----------
        25 |        38          0          1          1 |        40 
           |      0.16       0.00       0.37       0.37 |      0.16 
-----------+--------------------------------------------+----------
        26 |        30          0          0          1 |        31 
           |      0.12       0.00       0.00       0.37 |      0.12 
-----------+--------------------------------------------+----------
        27 |        28          0          1          0 |        29 
           |      0.12       0.00       0.37       0.00 |      0.12 
-----------+--------------------------------------------+----------
        28 |        45          0          0          2 |        47 
           |      0.19       0.00       0.00       0.74 |      0.19 
-----------+--------------------------------------------+----------
         . |    23,141        251        254        255 |    23,901 
           |     95.51      96.17      94.78      93.75 |     95.49 
-----------+--------------------------------------------+----------
     Total |    24,228        261        268        272 |    25,029 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        50          0          1          2 |        53 
         1 |        45          1          0          0 |        46 
         2 |        42          1          1          0 |        44 
         3 |        38          1          0          1 |        40 
         4 |        40          3          2          1 |        46 
         5 |        54          0          1          0 |        55 
         6 |        41          0          0          0 |        41 
         7 |        45          1          0          0 |        46 
         8 |        40          0          1          1 |        42 
         9 |        30          1          1          0 |        32 
        10 |        39          0          0          0 |        39 
        11 |        47          0          0          1 |        48 
        12 |        32          0          1          0 |        33 
        13 |        41          0          1          1 |        43 
        14 |        36          0          0          2 |        38 
        15 |        39          0          0          0 |        39 
        16 |        37          0          1          1 |        39 
        17 |        44          1          0          0 |        45 
        18 |        20          1          1          0 |        22 
        19 |        31          0          0          0 |        31 
        20 |        27          0          0          1 |        28 
        21 |        28          0          0          0 |        28 
        22 |        39          0          0          2 |        41 
        23 |        39          0          1          0 |        40 
        24 |        22          0          0          0 |        22 
        25 |        38          0          1          1 |        40 
        26 |        30          0          0          1 |        31 
        27 |        28          0          1          0 |        29 
        28 |        45          0          0          2 |        47 
-----------+--------------------------------------------+----------
     Total |     1,087         10         14         17 |     1,128 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |     1,887         14         14         18 |     1,933 
           |      7.23       5.09       4.96       6.21 |      7.17 
-----------+--------------------------------------------+----------
         1 |    24,228        261        268        272 |    25,029 
           |     92.77      94.91      95.04      93.79 |     92.83 
-----------+--------------------------------------------+----------
     Total |    26,115        275        282        290 |    26,962 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |               drug
      ends |   control  sotrovima   paxlovid |     Total
-----------+---------------------------------+----------
         1 |         1          0          0 |         1 
           |      5.56       0.00       0.00 |      5.00 
-----------+---------------------------------+----------
         2 |         3          1          1 |         5 
           |     16.67     100.00     100.00 |     25.00 
-----------+---------------------------------+----------
         3 |         3          0          0 |         3 
           |     16.67       0.00       0.00 |     15.00 
-----------+---------------------------------+----------
         4 |         8          0          0 |         8 
           |     44.44       0.00       0.00 |     40.00 
-----------+---------------------------------+----------
         5 |         1          0          0 |         1 
           |      5.56       0.00       0.00 |      5.00 
-----------+---------------------------------+----------
         6 |         2          0          0 |         2 
           |     11.11       0.00       0.00 |     10.00 
-----------+---------------------------------+----------
     Total |        18          1          1 |        20 
           |    100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         3 |         3 
           |     15.79 |     15.79 
-----------+-----------+----------
         2 |         2 |         2 
           |     10.53 |     10.53 
-----------+-----------+----------
         3 |         3 |         3 
           |     15.79 |     15.79 
-----------+-----------+----------
         4 |         4 |         4 
           |     21.05 |     21.05 
-----------+-----------+----------
         5 |         5 |         5 
           |     26.32 |     26.32 
-----------+-----------+----------
         6 |         2 |         2 
           |     10.53 |     10.53 
-----------+-----------+----------
     Total |        19 |        19 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid,molnupiravir)&drug==1,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,molnupiravir)&drug==2,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid)&drug==3,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid,molnupiravir)&drug==0,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         6 |         1 |         1 
           |     50.00 |     50.00 
-----------+-----------+----------
        14 |         1 |         1 
           |     50.00 |     50.00 
-----------+-----------+----------
     Total |         2 |         2 
           |    100.00 |    100.00 

. 
. 
. save "$projectdir/output/data/main.dta", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/data/main.dta
    saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_data
> set_combine.log
  log type:  text
 closed on:  24 Jul 2023, 13:06:52
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
