-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:  17 May 2023, 13:54:37

. 
. * import dataset
. import delimited "$projectdir/output/input.csv", clear
(199 vars, 50,000 obs)

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. //describe
. //codebook
. 
. *  Convert strings to dates  *
. foreach var of varlist   covid_test_positive_date                            
>    ///
>                                                  covid_test_positive_date2   
>                            ///
>                                                  covid_symptoms_snomed       
>                            ///     
>                                                  prior_covid_date            
>                            ///
>                                                  sotrovimab                  
>                                            ///
>                                                  molnupiravir                
>                                    /// 
>                                                  paxlovid                    
>                                            ///
>                                                  remdesivir                  
>                                            ///
>                                                  casirivimab                 
>                                    ///
>                                                  sotrovimab_not_start        
>                            ///
>                                                  molnupiravir_not_start      
>                            ///
>                                                  paxlovid_not_start          
>                                    ///
>                                                  casirivimab_not_start       
>                            ///
>                                                  remdesivir_not_start        
>                            ///
>                                                  sotrovimab_stopped          
>                                    ///
>                                                  molnupiravir_stopped        
>                            ///
>                                                  paxlovid_stopped            
>                                    ///
>                                                  casirivimab_stopped         
>                            ///
>                                                  remdesivir_stopped          
>                                    ///
>                                                  date_treated                
>                                    ///
>                                                  drugs_do_not_use            
>                                    ///
>                                                  drugs_consider_risk         
>                            ///
>                                                  last_vaccination_date       
>                            ///
>                                                  covid_test_positive_pre_date
>                    ///
>                                                  death_date                  
>                                            ///
>                                                  dereg_date                  
>                                    ///
>                                                  bmi_date_measured           
>                                    ///
>                                                  creatinine_ctv3_date        
>                            ///
>                                                  creatinine_snomed_date      
>                            ///
>                                                  creatinine_short_snomed_date
>                    ///
>                                                  covid_discharge_date_primary
>                    ///
>                                                  any_covid_hosp_discharge    
>                            ///                     
>                                                  ae_diverticulitis_icd       
>                            ///
>                                                  ae_diverticulitis_snomed    
>                            ///
>                                              ae_diarrhoea_snomed             
>                            ///
>                                                  ae_taste_snomed             
>                                    ///
>                                                  ae_taste_icd                
>                                    ///
>                                                  ae_anaphylaxis_icd          
>                                    ///
>                                                  ae_anaphylaxis_snomed       
>                            ///
>                                                  ae_rheumatoid_arthritis_snom
> ed                 ///
>                                                  ae_rheumatoid_arthritis_icd 
>                    ///
>                                                  ae_sle_ctv                  
>                                            ///
>                                                  ae_sle_icd                  
>                                            ///
>                                                  ae_psoriasis_snomed         
>                            ///
>                                                  ae_psoriatic_arthritis_snome
> d                  ///
>                                                  ae_ankylosing_spondylitis_ct
> v                  ///
>                                                  ae_ibd_snomed               
>                                    ///
>                                                  rheumatoid_arthritis_nhsd_sn
> omed               ///
>                                                  rheumatoid_arthritis_nhsd_ic
> d10                ///
>                                                  sle_nhsd_ctv                
>                                    ///
>                                                  sle_nhsd_icd10              
>                                    ///
>                                                  psoriasis_nhsd              
>                                    ///
>                                                  psoriatic_arthritis_nhsd    
>                            ///
>                                                  ankylosing_spondylitis_nhsd 
>                    ///
>                                                  ibd_ctv                     
>                                            ///
>                                                  all_hosp_date               
>                                    ///
>                                                  all_hosp_date0              
>                                    ///
>                                                  all_hosp_date1              
>                                    ///
>                                                  all_hosp_date2              
>                                    ///
>                                                  hosp_discharge_date         
>                            ///
>                                                  hosp_discharge_date0        
>                            ///
>                                                  hosp_discharge_date1        
>                            ///
>                                                  hosp_discharge_date2        
>                            ///
>                                                  covid_hosp_date             
>                                    ///
>                                                  covid_hosp_date_primary     
>                            ///
>                                                  covid_hosp_date0            
>                                    ///
>                                                  covid_hosp_date1            
>                                    ///
>                                                  covid_hosp_date2            
>                                    ///                                       
>       
>                                                  covid_discharge_date0       
>                      ///                                           
>                                                  covid_discharge_date1       
>                            /// 
>                                                  covid_discharge_date2       
>                            /// 
>                                                  covid_hosp_date_mabs        
>                            /// 
>                                                  covid_hosp_date_mabs_not_pri
> mary               /// 
>                                                  covid_hosp_date_mabs_day    
>                            ///
>                                                  died_date_ons               
>                                    ///
>                                                  died_ons_covid {            
>                             
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(47,689 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(1 missing value generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(45,000 missing values generated)
(47,500 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)

. 
. *check hosp/death event date range*
. codebook covid_test_positive_date date_treated all_hosp_date died_date_ons

-------------------------------------------------------------------------------
covid_test_positive_date                                            (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [22626,23147]                units:  1
       or equivalently:  [12dec2021,17may2023]        units:  days
         unique values:  522                      missing .:  4,999/50,000

                  mean:   22886.7 = 29aug2022 (+ 16 hours)
              std. dev:   151.318

           percentiles:        10%       25%       50%       75%       90%
                             22677     22756     22886     23019     23096
                         01feb2022 21apr2022 29aug2022 09jan2023 27mar2023

-------------------------------------------------------------------------------
date_treated                                                        (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [22631,23142]                units:  1
       or equivalently:  [17dec2021,12may2023]        units:  days
         unique values:  461                      missing .:  1/50,000

                  mean:   22726.4 = 22mar2022 (+ 10 hours)
              std. dev:   80.9197

           percentiles:        10%       25%       50%       75%       90%
                             22643     22663     22705     22770     22843
                         29dec2021 18jan2022 01mar2022 05may2022 17jul2022

-------------------------------------------------------------------------------
all_hosp_date                                                       (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [22693,23147]                units:  1
       or equivalently:  [17feb2022,17may2023]        units:  days
         unique values:  455                      missing .:  45,000/50,000

                  mean:   22920.3 = 02oct2022 (+ 7 hours)
              std. dev:   129.756

           percentiles:        10%       25%       50%       75%       90%
                             22741     22808     22923     23030     23100
                         06apr2022 12jun2022 05oct2022 20jan2023 31mar2023

-------------------------------------------------------------------------------
died_date_ons                                                       (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [22282,23147]                units:  1
       or equivalently:  [02jan2021,17may2023]        units:  days
         unique values:  866                      missing .:  20,000/50,000

                  mean:   22716.5 = 12mar2022 (+ 12 hours)
              std. dev:   248.909

           percentiles:        10%       25%       50%       75%       90%
                             22371     22503   22716.5     22933     23062
                         01apr2021 11aug2021 12mar2022 15oct2022 21feb2023

. 
. 
. ****************************
. *       EXPOSURE                *
. ****************************
. foreach var of varlist sotrovimab molnupiravir paxlovid remdesivir casirivima
> b{
  2.     display "`var'"
  3.         gen `var'_check = 1 if `var'>=covid_test_positive_date & `var'<=co
> vid_test_positive_date+5 & `var'!=.
  4.         replace `var'_check = 0 if (`var' < covid_test_positive_date | `va
> r' > covid_test_positive_date + 5) & `var'!=.
  5.         sum `var'
  6.         tab `var'_check, m  // should be no 0s
  7.         sum `var'_not_start // number prescribed but not started
  8.         gen `var'_started = 1 if `var'_not_start==. & `var'_check==1
  9.         tab `var'_started, m
 10.         gen `var'_date_started = `var' if `var'==date_treated & `var'_star
> ted==1 
 11.         sum `var'_date_started
 12. }
sotrovimab
(49,563 missing values generated)
(44,564 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  sotrovimab |     45,001    22889.43    149.3683      22631      23147

sotrovimab_ |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,564       89.13       89.13
          1 |        437        0.87       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
sotrovimab~t |      5,000    22887.64    146.7487      22631      23147
(49,615 missing values generated)

sotrovimab_ |
    started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        385        0.77        0.77
          . |     49,615       99.23      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,922 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
so~e_started |         78    22718.23    67.71252      22633      22935
molnupiravir
(49,535 missing values generated)
(44,536 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
molnupiravir |     45,001    22889.64    149.1931      22631      23147

molnupiravi |
    r_check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,536       89.07       89.07
          1 |        465        0.93       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
molnupirav~t |      5,000    22888.83    149.3653      22631      23147
(49,592 missing values generated)

molnupiravi |
  r_started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        408        0.82        0.82
          . |     49,592       99.18      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,908 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
mo~e_started |         92    22724.58    89.55068      22632      23027
paxlovid
(49,544 missing values generated)
(44,545 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    paxlovid |     45,001     22888.2    149.6065      22631      23147

paxlovid_ch |
        eck |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,545       89.09       89.09
          1 |        456        0.91       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
paxlovid_n~t |      5,000    22885.16    150.6159      22631      23147
(49,587 missing values generated)

paxlovid_st |
      arted |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        413        0.83        0.83
          . |     49,587       99.17      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,903 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
paxlovid_d~d |         97    22705.87    56.10586      22632      22870
remdesivir
(49,553 missing values generated)
(44,554 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  remdesivir |     45,001    22890.09    148.7578      22631      23147

remdesivir_ |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,554       89.11       89.11
          1 |        447        0.89       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
remdesivir~t |      5,000    22887.64    150.4153      22631      23147
(49,592 missing values generated)

remdesivir_ |
    started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        408        0.82        0.82
          . |     49,592       99.18      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,889 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
re~e_started |        111    22717.29    69.43426      22631      22932
casirivimab
(49,524 missing values generated)
(44,525 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 casirivimab |     45,001    22889.84    149.2918      22631      23147

casirivimab |
     _check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,525       89.05       89.05
          1 |        476        0.95       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
casirivima~t |      5,000    22884.91    151.3076      22631      23147
(49,572 missing values generated)

casirivimab |
   _started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        428        0.86        0.86
          . |     49,572       99.14      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,899 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ca~e_started |        101    22723.81    83.90706      22631      23005

. gen drug=1 if sotrovimab==date_treated & sotrovimab_start==1 
(49,922 missing values generated)

. replace drug=2 if paxlovid==date_treated & paxlovid_start==1
(97 real changes made)

. replace drug=3 if molnupiravir==date_treated & molnupiravir_start==1
(92 real changes made)

. replace drug=4 if (remdesivir==date_treated & remdesivir_start==1)  | (casiri
> vimab==date_treated & casirivimab==1)
(111 real changes made)

. replace drug=0 if drug==.
(49,623 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir" 4"o
> ther", replace

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     49,623       99.25       99.25
  sotrovimab |         77        0.15       99.40
    paxlovid |         97        0.19       99.59
molnupiravir |         92        0.18       99.78
       other |        111        0.22      100.00
-------------+-----------------------------------
       Total |     50,000      100.00

. gen start_date=date_treated if drug>0 
(49,623 missing values generated)

. format start_date %td

. egen median_time = median(date_treated - covid_test_positive_date) if drug>0 
> & drug<4
(49734 missing values generated)

. egen median_max = max(median_time)

. sum median_time

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 median_time |        266           2           0          2          2

. replace start_date = covid_test_positive_date + median_max if drug==0
(44,624 real changes made)

. bys drug: count if start_date==. // should be no 0s

-------------------------------------------------------------------------------
-> drug = control
  4,999
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. *start and end date
. gen study_end_date=mdy(06,01,2023)

. gen start_date_29=start_date+28
(4,999 missing values generated)

. format study_end_date start_date_29 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ***Inclusion criteria*
. keep if age>=18 & age<110
(10,611 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(1,962 observations deleted)

. *check covid positive, and not repeat covid test after an infection within 30
>  days prior
. tab covid_test_positive covid_positive_previous_30_days, m

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,552        176 |     3,728 
         1 |    31,975      1,724 |    33,699 
-----------+----------------------+----------
     Total |    35,527      1,900 |    37,427 

. keep if covid_test_positive==1 & covid_positive_previous_30_days==0
(5,452 observations deleted)

. 
. ***Exclusion criteria*
. *capture and exclude if death or deregistration is on the start date 
. count if start_date>=dereg_date & start_date!=.
  2,877

. count if start_date>=death_date & start_date!=.
  2,864

. drop if start_date>=death_date | start_date>=dereg_date
(8,648 observations deleted)

. 
. 
. ****************************
. *       OUTCOME         *
. ****************************
. 
. *** Primary outcome - AESI
. bys drug: count if ae_rheumatoid_arthritis_icd!=. & (rheumatoid_arthritis_nhs
> d_snomed==1 | rheumatoid_arthritis_nhsd_icd10==1)

-------------------------------------------------------------------------------
-> drug = control
  859
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  3

. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_
> snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(19,547 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis
> _nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(19,596 missing values generated)

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(19,561 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(19,553 missing values generated)

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(19,186 missing values generated)

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_
> nhsd==0
(19,128 missing values generated)

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondyli
> tis_nhsd==0
(19,174 missing values generated)

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(19,116 missing values generated)

. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed          
>                    ///
>                                                 ae_taste_snomed              
>                            

. global ae_spc_icd               ae_diverticulitis_icd                   ///
>                                                 ae_taste_icd                 
>                    

. global ae_drug                  ae_anaphylaxis_snomed                   

. global ae_drug_icd              ae_anaphylaxis_icd

. global ae_imae                  new_ae_ra_snomed                             
>    ///
>                                                 new_ae_sle_ctv               
>                    ///
>                                                 new_ae_psoriasis_snomed      
>            ///
>                                                 new_ae_psa_snomed            
>                    ///
>                                                 new_ae_ankspon_ctv           
>                    ///
>                                                 new_ae_ibd      

. global ae_imae_icd              new_ae_ra_icd                                
>    ///
>                                                 new_ae_sle_icd               
>                                    

. *remove event if occurred before start (including new start date for control)
. foreach x in $ae_spc $ae_spc_icd $ae_drug $ae_drug_icd $ae_imae $ae_imae_icd{
  2.                                 display "`x'"
  3.                                 bys drug: count if (`x' < start_date | `x'
>  > start_date + 28) & `x'!=.
  4.                                 replace `x'=. if (`x' < start_date | `x' >
>  start_date + 28) & `x'!=.
  5. }
ae_diverticulitis_snomed

-------------------------------------------------------------------------------
-> drug = control
  4,384
-------------------------------------------------------------------------------
-> drug = sotrovimab
  12
-------------------------------------------------------------------------------
-> drug = paxlovid
  11
-------------------------------------------------------------------------------
-> drug = molnupiravir
  9
-------------------------------------------------------------------------------
-> drug = other
  12
(4,428 real changes made, 4,428 to missing)
ae_diarrhoea_snomed

-------------------------------------------------------------------------------
-> drug = control
  4,350
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  15
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-------------------------------------------------------------------------------
-> drug = other
  10
(4,393 real changes made, 4,393 to missing)
ae_taste_snomed

-------------------------------------------------------------------------------
-> drug = control
  4,404
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  12
-------------------------------------------------------------------------------
-> drug = other
  7
(4,439 real changes made, 4,439 to missing)
ae_diverticulitis_icd

-------------------------------------------------------------------------------
-> drug = control
  4,399
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-------------------------------------------------------------------------------
-> drug = other
  9
(4,429 real changes made, 4,429 to missing)
ae_taste_icd

-------------------------------------------------------------------------------
-> drug = control
  4,401
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  14
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-------------------------------------------------------------------------------
-> drug = other
  14
(4,445 real changes made, 4,445 to missing)
ae_anaphylaxis_snomed

-------------------------------------------------------------------------------
-> drug = control
  4,432
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  12
-------------------------------------------------------------------------------
-> drug = other
  9
(4,462 real changes made, 4,462 to missing)
ae_anaphylaxis_icd

-------------------------------------------------------------------------------
-> drug = control
  4,279
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  9
-------------------------------------------------------------------------------
-> drug = molnupiravir
  9
-------------------------------------------------------------------------------
-> drug = other
  7
(4,314 real changes made, 4,314 to missing)
new_ae_ra_snomed

-------------------------------------------------------------------------------
-> drug = control
  3,516
-------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-------------------------------------------------------------------------------
-> drug = other
  9
(3,551 real changes made, 3,551 to missing)
new_ae_sle_ctv

-------------------------------------------------------------------------------
-> drug = control
  3,526
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7
-------------------------------------------------------------------------------
-> drug = other
  5
(3,549 real changes made, 3,549 to missing)
new_ae_psoriasis_snomed

-------------------------------------------------------------------------------
-> drug = control
  3,911
-------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-------------------------------------------------------------------------------
-> drug = paxlovid
  14
-------------------------------------------------------------------------------
-> drug = molnupiravir
  9
-------------------------------------------------------------------------------
-> drug = other
  7
(3,952 real changes made, 3,952 to missing)
new_ae_psa_snomed

-------------------------------------------------------------------------------
-> drug = control
  3,956
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  6
-------------------------------------------------------------------------------
-> drug = other
  10
(3,983 real changes made, 3,983 to missing)
new_ae_ankspon_ctv

-------------------------------------------------------------------------------
-> drug = control
  3,894
-------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  11
-------------------------------------------------------------------------------
-> drug = other
  10
(3,932 real changes made, 3,932 to missing)
new_ae_ibd

-------------------------------------------------------------------------------
-> drug = control
  3,958
-------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  11
-------------------------------------------------------------------------------
-> drug = other
  9
(3,991 real changes made, 3,991 to missing)
new_ae_ra_icd

-------------------------------------------------------------------------------
-> drug = control
  3,526
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  11
-------------------------------------------------------------------------------
-> drug = molnupiravir
  10
-------------------------------------------------------------------------------
-> drug = other
  14
(3,567 real changes made, 3,567 to missing)
new_ae_sle_icd

-------------------------------------------------------------------------------
-> drug = control
  3,519
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  10
-------------------------------------------------------------------------------
-> drug = other
  14
(3,557 real changes made, 3,557 to missing)

. egen ae_spc_gp = rmin($ae_spc)
(22590 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(22835 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd)
(22113 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(23053 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(23079 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd)
(22806 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)        
(22100 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(22908 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd)  
(21702 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_drug $ae_drug_icd $ae_imae $ae_ima
> e_icd)
(20106 missing values generated)

. egen ae_all_serious = rmin($ae_spc_icd $ae_drug_icd $ae_imae_icd)
(22191 missing values generated)

. by drug, sort: count if ae_spc_all!=.

-------------------------------------------------------------------------------
-> drug = control
  1,206
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-------------------------------------------------------------------------------
-> drug = other
  2

. by drug, sort: count if ae_drug_all!=.

-------------------------------------------------------------------------------
-> drug = control
  516
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  2

. by drug, sort: count if ae_imae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  1,604
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5
-------------------------------------------------------------------------------
-> drug = other
  4

. by drug, sort: count if ae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  3,187
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  9
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7
-------------------------------------------------------------------------------
-> drug = other
  8

. 
. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - t
> o ignore sotro initiators with mab procedure codes*
. by drug, sort: count if covid_hosp_date!=.

-------------------------------------------------------------------------------
-> drug = control
  2,335
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-------------------------------------------------------------------------------
-> drug = other
  8

. by drug, sort: count if covid_hosp_date0!=. // *nb: control group will not ha
> ve covid_hosp_date0 - as do not have date_treated

-------------------------------------------------------------------------------
-> drug = control
  2,345
-------------------------------------------------------------------------------
-> drug = sotrovimab
  5
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-------------------------------------------------------------------------------
-> drug = other
  5

. // covid admission is the same date as date treated 
. by drug, sort: count if covid_hosp_date0!=date_treated&covid_hosp_date0!=.&da
> te_treated!=.

-------------------------------------------------------------------------------
-> drug = control
  2,344
-------------------------------------------------------------------------------
-> drug = sotrovimab
  5
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-------------------------------------------------------------------------------
-> drug = other
  5

. by drug, sort: count if covid_hosp_date1!=(date_treated+1) &covid_hosp_date1!
> =.&date_treated!=.

-------------------------------------------------------------------------------
-> drug = control
  2,299
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  10
-------------------------------------------------------------------------------
-> drug = other
  6

. // covid admission is the same date as date treated and is a daycase
. by drug, sort: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_da
> te0!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_da
> te1!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is the same date as mab
. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_dat
> e_mabs!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_dat
> e_mabs!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is the same date as mab and is a daycase, 1 day admission
. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_dat
> e0!=.&covid_hosp_date0==covid_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_dat
> e1!=.&covid_hosp_date1==covid_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_dat
> e0!=.&(covid_discharge_date0 - covid_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_dat
> e1!=.&(covid_discharge_date1 - covid_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is PM but discharged in AM 
. count if covid_hosp_date!=.&covid_discharge_date_primary==.
  2,115

. count if covid_hosp_date==.&covid_discharge_date_primary!=.
  2,051

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date==
> covid_discharge_date_primary
  1

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date<c
> ovid_discharge_date_primary
  122

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date>c
> ovid_discharge_date_primary
  116

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_ho
> sp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_ho
> sp_date1!=.  // [? Bang is your code for this correct~line 135]
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date AND a mab procedures for sotro 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hos
> p_date_mabs!=.&drug==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hos
> p_date_mabs!=.&drug==1 
(0 real changes made)

. 
. *correcting all hosp admission: admitted on day 0 or day 1 after treatment - 
> to ignore sotro initiators with mab procedure codes*
. by drug, sort: count if all_hosp_date!=.

-------------------------------------------------------------------------------
-> drug = control
  2,300
-------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-------------------------------------------------------------------------------
-> drug = other
  3

. by drug, sort: count if all_hosp_date0!=. // *nb: control group will not have
>  covid_hosp_date0 - as do not have date_treated

-------------------------------------------------------------------------------
-> drug = control
  2,296
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-------------------------------------------------------------------------------
-> drug = other
  5

. // admission is the same date as date treated 
. by drug, sort: count if all_hosp_date0!=date_treated&all_hosp_date0!=.&date_t
> reated!=.

-------------------------------------------------------------------------------
-> drug = control
  2,294
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-------------------------------------------------------------------------------
-> drug = other
  5

. by drug, sort: count if all_hosp_date1!=(date_treated+1) &all_hosp_date1!=.&d
> ate_treated!=.

-------------------------------------------------------------------------------
-> drug = control
  2,334
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5
-------------------------------------------------------------------------------
-> drug = other
  6

. // admission is the same date as date treated and is a daycase
. by drug, sort: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is the same date as mab
. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_
> mabs!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_
> mabs!=.

-------------------------------------------------------------------------------
-> drug = control
  1
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=
> .&all_hosp_date0==hosp_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=
> .&all_hosp_date1==hosp_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=
> .&(hosp_discharge_date0-all_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=
> .&(hosp_discharge_date1-all_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is PM but discharged in AM 
. count if all_hosp_date!=.&hosp_discharge_date==.
  2,103

. count if all_hosp_date==.&hosp_discharge_date!=.
  2,098

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharg
> e_date
  0

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge
> _date
  114

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge
> _date
  105

. // REPLACE - ignore admission if admission it is the day 0 or day 1 after tre
> atment date AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_da
> te_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_da
> te_mabs!=.&drug==1 
(0 real changes made)

. // Decision not to REPLACE admission if admission is the day 0 or day 1 after
>  treatment date treated AND a day case
. 
. foreach var of varlist covid_hosp_date all_hosp_date died_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' < start_date | `
> var' > start_date + 28) & `var'!=.                            
  4.                                 replace `var'=. if (`var' < start_date | `
> var' > start_date + 28) & `var'!=.
  5. }
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  2,198
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-------------------------------------------------------------------------------
-> drug = other
  8
(2,217 real changes made, 2,217 to missing)
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  2,174
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-------------------------------------------------------------------------------
-> drug = other
  3
(2,195 real changes made, 2,195 to missing)
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  13,498
-------------------------------------------------------------------------------
-> drug = sotrovimab
  21
-------------------------------------------------------------------------------
-> drug = paxlovid
  36
-------------------------------------------------------------------------------
-> drug = molnupiravir
  36
-------------------------------------------------------------------------------
-> drug = other
  35
(13,626 real changes made, 13,626 to missing)

. 
. *** Secondary outcome - severe drug reactions (including DRESS, SJS, TEN, ana
> phylaxis) 
. 
. ****************************
. *       COVARIATES              *
. ****************************
. by drug,sort: tab high_risk_cohort_covid_therapeut,m

-------------------------------------------------------------------------------
-> drug = control

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |      2,326       10.06       10.06
                    HIV or AIDS |      1,160        5.02       15.08
                           IMID |      2,305        9.97       25.05
              IMID,solid cancer |      2,307        9.98       35.02
                             NA |      1,121        4.85       39.87
        haematological diseases |      1,203        5.20       45.07
    haematological malignancies |      1,165        5.04       50.11
                  liver disease |      1,183        5.12       55.23
    primary immune deficiencies |      2,276        9.84       65.07
                  renal disease |      2,231        9.65       74.72
            sickle cell disease |      2,363       10.22       84.94
                   solid cancer |      2,364       10.22       95.16
stem cell transplant recipients |      1,118        4.84      100.00
--------------------------------+-----------------------------------
                          Total |     23,122      100.00

-------------------------------------------------------------------------------
-> drug = sotrovimab

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          3        6.82        6.82
                    HIV or AIDS |          2        4.55       11.36
                           IMID |          7       15.91       27.27
              IMID,solid cancer |          2        4.55       31.82
                             NA |          4        9.09       40.91
        haematological diseases |          1        2.27       43.18
    haematological malignancies |          5       11.36       54.55
    primary immune deficiencies |          5       11.36       65.91
                  renal disease |          3        6.82       72.73
            sickle cell disease |          6       13.64       86.36
                   solid cancer |          6       13.64      100.00
--------------------------------+-----------------------------------
                          Total |         44      100.00

-------------------------------------------------------------------------------
-> drug = paxlovid

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          1        1.92        1.92
                    HIV or AIDS |          3        5.77        7.69
                           IMID |         12       23.08       30.77
              IMID,solid cancer |          3        5.77       36.54
                             NA |          6       11.54       48.08
        haematological diseases |          2        3.85       51.92
                  liver disease |          6       11.54       63.46
    primary immune deficiencies |          2        3.85       67.31
                  renal disease |          3        5.77       73.08
            sickle cell disease |          4        7.69       80.77
                   solid cancer |          5        9.62       90.38
stem cell transplant recipients |          5        9.62      100.00
--------------------------------+-----------------------------------
                          Total |         52      100.00

-------------------------------------------------------------------------------
-> drug = molnupiravir

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          5        9.43        9.43
                    HIV or AIDS |          1        1.89       11.32
                           IMID |          4        7.55       18.87
              IMID,solid cancer |          8       15.09       33.96
                             NA |          3        5.66       39.62
        haematological diseases |          3        5.66       45.28
                  liver disease |          1        1.89       47.17
    primary immune deficiencies |          5        9.43       56.60
                  renal disease |          7       13.21       69.81
            sickle cell disease |          6       11.32       81.13
                   solid cancer |          6       11.32       92.45
stem cell transplant recipients |          4        7.55      100.00
--------------------------------+-----------------------------------
                          Total |         53      100.00

-------------------------------------------------------------------------------
-> drug = other

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          5        8.93        8.93
                    HIV or AIDS |          6       10.71       19.64
                           IMID |          5        8.93       28.57
              IMID,solid cancer |          5        8.93       37.50
                             NA |          1        1.79       39.29
        haematological diseases |          3        5.36       44.64
    haematological malignancies |          3        5.36       50.00
                  liver disease |          3        5.36       55.36
    primary immune deficiencies |          4        7.14       62.50
                  renal disease |          9       16.07       78.57
            sickle cell disease |          3        5.36       83.93
                   solid cancer |          7       12.50       96.43
stem cell transplant recipients |          2        3.57      100.00
--------------------------------+-----------------------------------
                          Total |         56      100.00


. gen downs_syndrome_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut
> , "Downs syndrome")
(20,987 missing values generated)

. gen solid_cancer_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "
> solid cancer")
(18,614 missing values generated)

. gen haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "
> haematological malignancies")
(22,154 missing values generated)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeu
> t, "sickle cell disease")
(2,382 real changes made)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeu
> t, "haematological diseases")
(1,212 real changes made)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeu
> t, "stem cell transplant")
(1,129 real changes made)

. gen renal_disease_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut,
>  "renal disease")
(21,074 missing values generated)

. gen liver_disease_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut,
>  "liver disease")
(22,134 missing values generated)

. gen imid_on_drug_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, 
> "IMID")
(18,669 missing values generated)

. gen immunosupression_therapeutics= 1 if strpos(high_risk_cohort_covid_therape
> ut, "primary immune deficiencies")
(21,035 missing values generated)

. gen hiv_aids_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "HIV
>  or AIDS")
(22,155 missing values generated)

. gen solid_organ_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "
> solid organ recipients")
(23,327 missing values generated)

. replace solid_organ_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeu
> t, "solid organ transplant")
(0 real changes made)

. gen rare_neuro_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "r
> are neurological conditions")
(23,327 missing values generated)

. *check if all diseases have been captured*
. by drug,sort: count if high_risk_cohort_covid_therapeut!=""&high_risk_cohort_
> covid_therapeut!="other"& min(downs_syndrome_therapeutics,solid_cancer_therap
> eutics,haem_disease_therapeutics,renal_disease_therapeutics,liver_disease_the
> rapeutics,imid_on_drug_therapeutics,immunosupression_therapeutics,hiv_aids_th
> erapeutics,solid_organ_therapeutics,rare_neuro_therapeutics)==.

-------------------------------------------------------------------------------
-> drug = control
  1,121
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-------------------------------------------------------------------------------
-> drug = other
  1

. tab high_risk_cohort_covid_therapeut if high_risk_cohort_covid_therapeut!=""&
> high_risk_cohort_covid_therapeut!="other"& min(downs_syndrome_therapeutics,so
> lid_cancer_therapeutics,haem_disease_therapeutics,renal_disease_therapeutics,
> liver_disease_therapeutics,imid_on_drug_therapeutics,immunosupression_therape
> utics,hiv_aids_therapeutics,solid_organ_therapeutics,rare_neuro_therapeutics)
> ==.

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                             NA |      1,135      100.00      100.00
--------------------------------+-----------------------------------
                          Total |      1,135      100.00

. 
. *clean eligible
. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  236

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_
> hcd==0
  181

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_
> hcd==0 &imid_on_drug==1
  97

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_
> hcd==0 &imid_on_drug==1 &downs_syndrome==0 &solid_cancer==0 &haem_disease==0 
> &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &solid_
> organ_transplant==0 &rare_neuro==0
  7

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & imid_drug_hcd==0 
  5,124

. // REPLACE - ignore eligible steriods<4 scripts in last 6m
. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_
> steroid_drugs_nhsd==1
(236 real changes made)

. replace imid_drug_all=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_dr
> ugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenol
> ate==0 &imid_drug_hcd==0
(0 real changes made)

. // REPLACE - ignore eligible if not coded for imid AND (imid_drug or drug_HCD
> ) & if <4 scripts steriod
. replace imid_on_drug=0 if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & imi
> d_drug_hcd==0 
(5,124 real changes made)

. gen eligible_clean=((downs_syndrome + solid_cancer + haem_disease + renal_dis
> ease + liver_disease + imid_on_drug + immunosupression + hiv_aids + solid_org
> an_transplant + rare_neuro )>0)

. rename solid_organ_transplant solid_organ

. tab eligible_clean eligible

eligible_c |       eligible
      lean |         0          1 |     Total
-----------+----------------------+----------
         0 |       553        239 |       792 
         1 |         0     22,535 |    22,535 
-----------+----------------------+----------
     Total |       553     22,774 |    23,327 

. count if high_risk_cohort_covid_therapeut=="" & eligible_clean==1
  0

. count if high_risk_cohort_covid_therapeut!="" & eligible_clean==0
  792

. 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease
>  liver_disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro 
> {
  2.         replace `var'_therapeutics=0 if `var'_therapeutics==.
  3.         display `var'
  4.         tab `var'_therapeutics `var'
  5.         gen `var'_all = 1 if `var'==1 | `var'_therapeutics==1
  6. }
(20,987 real changes made)
0

downs_synd |
rome_thera |    downs_syndrome
   peutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,008      3,979 |    20,987 
         1 |     1,875        465 |     2,340 
-----------+----------------------+----------
     Total |    18,883      4,444 |    23,327 
(17,008 missing values generated)
(18,614 real changes made)
0

solid_canc |
er_therape |     solid_cancer
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,776      1,838 |    18,614 
         1 |     4,238        475 |     4,713 
-----------+----------------------+----------
     Total |    21,014      2,313 |    23,327 
(16,776 missing values generated)
(17,431 real changes made)
0

haem_disea |
se_therape |     haem_disease
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,191      8,240 |    17,431 
         1 |     3,114      2,782 |     5,896 
-----------+----------------------+----------
     Total |    12,305     11,022 |    23,327 
(9,191 missing values generated)
(21,074 real changes made)
0

renal_dise |
ase_therap |     renal_disease
    eutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,945      7,129 |    21,074 
         1 |     1,469        784 |     2,253 
-----------+----------------------+----------
     Total |    15,414      7,913 |    23,327 
(13,945 missing values generated)
(22,134 real changes made)
0

liver_dise |
ase_therap |     liver_disease
    eutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,031      4,103 |    22,134 
         1 |       946        247 |     1,193 
-----------+----------------------+----------
     Total |    18,977      4,350 |    23,327 
(18,031 missing values generated)
(18,669 real changes made)
0

imid_on_dr |
ug_therape |     imid_on_drug
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,496      5,173 |    18,669 
         1 |     3,406      1,252 |     4,658 
-----------+----------------------+----------
     Total |    16,902      6,425 |    23,327 
(13,496 missing values generated)
(21,035 real changes made)
0

immunosupr |
ession_the |   immunosupression
 rapeutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,938      2,097 |    21,035 
         1 |     2,048        244 |     2,292 
-----------+----------------------+----------
     Total |    20,986      2,341 |    23,327 
(18,938 missing values generated)
(22,155 real changes made)
0

hiv_aids_t |
herapeutic |       hiv_aids
         s |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,950      4,205 |    22,155 
         1 |       948        224 |     1,172 
-----------+----------------------+----------
     Total |    18,898      4,429 |    23,327 
(17,950 missing values generated)
(23,327 real changes made)
0

solid_orga |
n_therapeu |      solid_organ
      tics |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,002      7,325 |    23,327 
-----------+----------------------+----------
     Total |    16,002      7,325 |    23,327 
(16,002 missing values generated)
(23,327 real changes made)
1

rare_neuro |
_therapeut |      rare_neuro
       ics |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,019     13,308 |    23,327 
-----------+----------------------+----------
     Total |    10,019     13,308 |    23,327 
(10,019 missing values generated)

. // decision to use primary care variable for identification of high risk rath
> er than CMU as not present for ocontrol group
. 
. *Time between positive test and treatment*
. gen postest_treat=start_date-covid_test_positive_date

. tab postest_treat,m

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         39        0.17        0.17
          1 |         41        0.18        0.34
          2 |     23,150       99.24       99.58
          3 |         24        0.10       99.69
          4 |         29        0.12       99.81
          5 |         44        0.19      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. by drug, sort: tab postest_treat 

-------------------------------------------------------------------------------
-> drug = control

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |     23,122      100.00      100.00
------------+-----------------------------------
      Total |     23,122      100.00

-------------------------------------------------------------------------------
-> drug = sotrovimab

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       20.45       20.45
          1 |          9       20.45       40.91
          2 |          5       11.36       52.27
          3 |          5       11.36       63.64
          4 |          3        6.82       70.45
          5 |         13       29.55      100.00
------------+-----------------------------------
      Total |         44      100.00

-------------------------------------------------------------------------------
-> drug = paxlovid

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       15.38       15.38
          1 |         11       21.15       36.54
          2 |          6       11.54       48.08
          3 |          5        9.62       57.69
          4 |          7       13.46       71.15
          5 |         15       28.85      100.00
------------+-----------------------------------
      Total |         52      100.00

-------------------------------------------------------------------------------
-> drug = molnupiravir

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       15.09       15.09
          1 |          9       16.98       32.08
          2 |          9       16.98       49.06
          3 |          9       16.98       66.04
          4 |          9       16.98       83.02
          5 |          9       16.98      100.00
------------+-----------------------------------
      Total |         53      100.00

-------------------------------------------------------------------------------
-> drug = other

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         14       25.00       25.00
          1 |         12       21.43       46.43
          2 |          8       14.29       60.71
          3 |          5        8.93       69.64
          4 |         10       17.86       87.50
          5 |          7       12.50      100.00
------------+-----------------------------------
      Total |         56      100.00


. replace postest_treat=. if postest_treat<0|postest_treat>7
(0 real changes made)

. gen postest_treat_cat=(postest_treat>=3) if postest_treat<=5

. replace postest_treat_cat=9 if postest_treat_cat==. 
(0 real changes made)

. label define postest_treat_cat 0 "<3 days" 1 "3-5 days"  9 "missing", replace
>  

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     23,327     48.7232    19.03464         18        106

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) 
> label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |      8,571       36.74       36.74
      40-59 |      7,724       33.11       69.85
       >=60 |      7,032       30.15      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      2,571       11.02       11.02
        25- |      2,009        8.61       19.63
        30- |      2,047        8.78       28.41
        35- |      1,944        8.33       36.74
        40- |      1,791        7.68       44.42
        45- |      1,973        8.46       52.88
        50- |      2,094        8.98       61.86
        55- |      1,866        8.00       69.85
        60- |      1,656        7.10       76.95
        65- |      1,454        6.23       83.19
        70- |      1,425        6.11       89.30
        75- |      1,033        4.43       93.72
        80- |        702        3.01       96.73
        85- |        762        3.27      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. * Sex
. gen male = 1 if sex == "M"
(11,786 missing values generated)

. replace male = 0 if sex == "F"
(11,786 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(11,786 missing values generated)

. replace sex=1 if sex_str=="F"
(11,786 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     13,955       59.82       59.82
      Black |        947        4.06       63.88
      Mixed |        952        4.08       67.96
      Other |        988        4.24       72.20
South Asian |        939        4.03       76.22
      White |      5,546       23.78      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity                            
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. gen ethnicity_with_missing=ethnicity
(13,955 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(13,955 real changes made)

. gen White=1 if ethnicity==5
(17,781 missing values generated)

. replace White=0 if ethnicity!=5&ethnicity!=.
(3,826 real changes made)

. gen White_with_missing=White
(13,955 missing values generated)

. replace White_with_missing=9 if White==.
(13,955 real changes made)

. * IMD
. tab imd,m

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        227        0.97        0.97
          1 |      4,681       20.07       21.04
          2 |      4,591       19.68       40.72
          3 |      4,609       19.76       60.48
          4 |      4,746       20.35       80.82
          5 |      4,473       19.18      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. replace imd=. if imd==0
(227 real changes made, 227 to missing)

. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so high is mor
> e deprived)
(imd: 18491 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived", 
> replace

. label values imd imd

. gen imd_with_missing=imd
(227 missing values generated)

. replace imd_with_missing=9 if imd==.
(227 real changes made)

. tab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      4,473       19.36       19.36
               2 |      4,746       20.55       39.91
               3 |      4,609       19.95       59.86
               4 |      4,591       19.87       79.74
 5 most deprived |      4,681       20.26      100.00
-----------------+-----------------------------------
           Total |     23,100      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,336       10.01       10.01
           East Midlands |      2,318        9.94       19.95
                  London |      4,633       19.86       39.81
              North East |      2,360       10.12       49.93
              North West |      2,346       10.06       59.99
              South East |      2,289        9.81       69.80
              South West |      2,334       10.01       79.80
           West Midlands |      2,368       10.15       89.96
Yorkshire and The Humber |      2,343       10.04      100.00
-------------------------+-----------------------------------
                   Total |     23,327      100.00

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,356       10.10       10.10
           East Midlands |      2,329        9.98       20.08
                  London |      4,665       20.00       40.08
              North East |      2,346       10.06       50.14
              North West |      2,345       10.05       60.19
              South East |      2,346       10.06       70.25
              South West |      2,290        9.82       80.07
           West Midlands |      2,348       10.07       90.13
Yorkshire and The Humber |      2,302        9.87      100.00
-------------------------+-----------------------------------
                   Total |     23,327      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,283        9.79        9.79
      STP10 |      2,230        9.56       19.35
       STP2 |      2,436       10.44       29.79
       STP3 |      2,379       10.20       39.99
       STP4 |      2,315        9.92       49.91
       STP5 |      2,346       10.06       59.97
       STP6 |      2,350       10.07       70.04
       STP7 |      2,395       10.27       80.31
       STP8 |      2,247        9.63       89.94
       STP9 |      2,346       10.06      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Oth
> er"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,283        9.79        9.79
      STP10 |      2,230        9.56       19.35
       STP2 |      2,436       10.44       29.79
       STP3 |      2,379       10.20       39.99
       STP4 |      2,315        9.92       49.91
       STP5 |      2,346       10.06       59.97
       STP6 |      2,350       10.07       70.04
       STP7 |      2,395       10.27       80.31
       STP8 |      2,247        9.63       89.94
       STP9 |      2,346       10.06      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
         bmi |  26.51865  21.45033  27.40596  33.03505 -2.684986  59.68214
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(1,467 real changes made, 1,467 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*1
> 0 & (age+((bmi_date_measured-start_date)/365)>=18)
(1,933 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(1,933 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(6,015 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(1,467 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(1,467 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(1,467 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(1,467 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(1,467 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,039       90.19       90.19
          1 |      2,288        9.81      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,049       90.23       90.23
          1 |      2,278        9.77      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,995       90.00       90.00
          1 |      2,332       10.00      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,069       90.32       90.32
          1 |      2,258        9.68      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      2,392       10.25       10.25
          One vaccination |      2,357       10.10       20.36
       Three vaccinations |     11,723       50.26       70.61
         Two vaccinations |      2,335       10.01       80.62
            Un-vaccinated |      2,254        9.66       90.29
 Un-vaccinated (declined) |      2,266        9.71      100.00
--------------------------+-----------------------------------
                    Total |     23,327      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination
> _status_g=="Un-vaccinated (declined)"
(18,807 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(2,357 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(2,335 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(11,723 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinati
> ons"
(2,392 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two 
> vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(9,212 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(9,212 real changes made)

. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(1,141 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -420           -517
 5%         -289           -517
10%         -192           -516       Obs              22,186
25%           12           -512       Sum of Wgt.      22,186

50%          278                      Mean           276.3905
                        Largest       Std. Dev.       345.262
75%          544           1060
90%          735           1064       Variance       119205.8
95%          837           1064       Skewness      -.0208187
99%          971           1069       Kurtosis       2.190706

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(1,141 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -17 |          5        0.02        0.02
        -16 |         38        0.16        0.18
        -15 |         73        0.31        0.50
        -14 |        107        0.46        0.96
        -13 |        161        0.69        1.65
        -12 |        189        0.81        2.46
        -11 |        237        1.02        3.47
        -10 |        209        0.90        4.37
         -9 |        297        1.27        5.64
         -8 |        336        1.44        7.08
         -7 |        338        1.45        8.53
         -6 |        382        1.64       10.17
         -5 |        439        1.88       12.05
         -4 |        432        1.85       13.90
         -3 |        491        2.10       16.01
         -2 |        512        2.19       18.20
         -1 |        522        2.24       20.44
          0 |        549        2.35       22.79
          1 |        635        2.72       25.52
          2 |        594        2.55       28.06
          3 |        591        2.53       30.60
          4 |        614        2.63       33.23
          5 |        676        2.90       36.13
          6 |        613        2.63       38.75
          7 |        653        2.80       41.55
          8 |        647        2.77       44.33
          9 |        611        2.62       46.95
         10 |        581        2.49       49.44
         11 |        644        2.76       52.20
         12 |        597        2.56       54.76
         13 |        636        2.73       57.48
         14 |        612        2.62       60.11
         15 |        623        2.67       62.78
         16 |        601        2.58       65.35
         17 |        660        2.83       68.18
         18 |        651        2.79       70.97
         19 |        657        2.82       73.79
         20 |        589        2.52       76.31
         21 |        574        2.46       78.78
         22 |        483        2.07       80.85
         23 |        469        2.01       82.86
         24 |        427        1.83       84.69
         25 |        418        1.79       86.48
         26 |        342        1.47       87.95
         27 |        309        1.32       89.27
         28 |        278        1.19       90.46
         29 |        239        1.02       91.49
         30 |        224        0.96       92.45
         31 |        187        0.80       93.25
         32 |        170        0.73       93.98
         33 |        122        0.52       94.50
         34 |         94        0.40       94.90
         35 |         40        0.17       95.07
         36 |          8        0.03       95.11
          . |      1,141        4.89      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             -1
 5%           22             -1
10%           48             -1       Obs              23,327
25%          125             -1       Sum of Wgt.      23,327

50%          255                      Mean           257.0373
                        Largest       Std. Dev.      151.6837
75%          390            520
90%          468            520       Variance       23007.93
95%          496            520       Skewness       .0239046
99%          515            520       Kurtosis        1.79561

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130        0.56        0.56
          1 |      1,392        5.97        6.52
          2 |      1,356        5.81       12.34
          3 |      1,325        5.68       18.02
          4 |      1,400        6.00       24.02
          5 |      1,401        6.01       30.03
          6 |      1,304        5.59       35.62
          7 |      1,352        5.80       41.41
          8 |      1,332        5.71       47.12
          9 |      1,408        6.04       53.16
         10 |      1,337        5.73       58.89
         11 |      1,248        5.35       64.24
         12 |      1,272        5.45       69.69
         13 |      1,266        5.43       75.12
         14 |      1,334        5.72       80.84
         15 |      1,360        5.83       86.67
         16 |      1,305        5.59       92.26
         17 |      1,341        5.75       98.01
         18 |        464        1.99      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. mkspline calendar_day_spline = day_after_campaign, cubic nknots(4)

. * Variant
. tab sgtf,m

       sgtf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,321       69.97       69.97
          1 |      2,351       10.08       80.04
          9 |      2,308        9.89       89.94
          . |      2,347       10.06      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab sgtf_new, m

   sgtf_new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,459       70.56       70.56
          1 |      2,313        9.92       80.47
          9 |      2,313        9.92       90.39
          . |      2,242        9.61      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. tab variant_recorded,m

variant_reco |
        rded |      Freq.     Percent        Cum.
-------------+-----------------------------------
             |      2,356       10.10       10.10
   B.1.617.2 |     16,338       70.04       80.14
VOC-21JAN-02 |      4,633       19.86      100.00
-------------+-----------------------------------
       Total |     23,327      100.00

. tab sgtf_new variant_recorded ,m

                |         variant_recorded
       sgtf_new |            B.1.617.2  VOC-21J.. |     Total
----------------+---------------------------------+----------
S gene detected |     1,668     11,489      3,302 |    16,459 
 confirmed SGTF |       240      1,629        444 |     2,313 
             NA |       239      1,630        444 |     2,313 
              . |       209      1,590        443 |     2,242 
----------------+---------------------------------+----------
          Total |     2,356     16,338      4,633 |    23,327 

. * Prior infection
. gen prior_infection=(covid_test_positive_pre_date<=(covid_test_positive_date-
> 30) & covid_test_positive_pre_date >mdy(1,1,2020) & covid_test_positive_pre_d
> ate!=.)

. tab prior_infection,m

prior_infec |
       tion |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,163       90.72       90.72
          1 |      2,164        9.28      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. *Contraindications for Pax*
. tab drug if solid_organ==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      7,254       99.03       99.03
  sotrovimab |         21        0.29       99.32
    paxlovid |         11        0.15       99.47
molnupiravir |         16        0.22       99.69
       other |         23        0.31      100.00
-------------+-----------------------------------
       Total |      7,325      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,276       99.13       99.13
  sotrovimab |          4        0.17       99.30
    paxlovid |          7        0.30       99.61
molnupiravir |          4        0.17       99.78
       other |          5        0.22      100.00
-------------+-----------------------------------
       Total |      2,296      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      7,832       98.98       98.98
  sotrovimab |         19        0.24       99.22
    paxlovid |         22        0.28       99.49
molnupiravir |         18        0.23       99.72
       other |         22        0.28      100.00
-------------+-----------------------------------
       Total |      7,913      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vacci
> ne-breakthrough/blob/updates-feb/analysis/data_process.R*
. tab creatinine_operator_ctv3,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,330        9.99        9.99
          < |      1,101        4.72       14.71
         <= |      1,174        5.03       19.74
          = |     15,249       65.37       85.11
          > |      1,204        5.16       90.27
         >= |      1,110        4.76       95.03
          ~ |      1,159        4.97      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
creat~e_ctv3 |  56.97696  47.88067  59.04771  69.49277         0  115.7247
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_c
> tv3_date>start_date
(11,523 real changes made, 11,523 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.22905  50.08902  60.15518  70.17934  20.02689  115.7247
--------------------------------------------------------------------------

. tab creatinine_operator_ctv3 if creatinine_ctv3!=.,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      1,243       10.53       10.53
          < |        568        4.81       15.34
         <= |        595        5.04       20.38
          = |      7,616       64.52       84.90
          > |        588        4.98       89.88
         >= |        585        4.96       94.84
          ~ |        609        5.16      100.00
------------+-----------------------------------
      Total |     11,804      100.00

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(11,804 real changes made)

. gen min_creatinine_ctv3=.
(23,327 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(5,875 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(5,929 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(3,212 real changes made)

. gen max_creatinine_ctv3=.
(23,327 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(5,875 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(5,929 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(20,115 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993
> ^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(11,675 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(5,805 real changes made)

. tab creatinine_operator_snomed,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,323        9.96        9.96
          < |      1,187        5.09       15.05
         <= |      1,152        4.94       19.99
          = |     15,046       64.50       84.49
          > |      1,240        5.32       89.80
         >= |      1,214        5.20       95.01
          ~ |      1,165        4.99      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab creatinine_operator_snomed if creatinine_snomed!=.,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,323        9.96        9.96
          < |      1,187        5.09       15.05
         <= |      1,152        4.94       19.99
          = |     15,046       64.50       84.49
          > |      1,240        5.32       89.80
         >= |      1,214        5.20       95.01
          ~ |      1,165        4.99      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
cre~e_snomed |  22.12467         0         0   44.7054 -32.63255   124.454
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(17,953 real changes made, 17,953 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(crea
> tinine_snomed)
(12,092 real changes made, 3,058 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if miss
> ing(creatinine_snomed)
(9,961 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creati
> nine_snomed)
(17,730 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_sno
> med)
(17,953 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(13,999 real changes made, 13,999 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(9,328 real changes made)

. gen min_creatinine_snomed=.
(23,327 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(4,669 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(4,659 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(1,200 real changes made)

. gen max_creatinine_snomed=.
(23,327 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(4,669 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(4,659 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(22,127 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*
> (0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snome
> d<=120
(14,106 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(4,618 real changes made)

. tab egfr_operator if egfr_record!=.,m

eGFR_operat |
         or |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,335       10.01       10.01
          < |      1,182        5.07       15.08
         <= |      1,146        4.91       19.99
          = |     15,127       64.85       84.84
          > |      1,161        4.98       89.81
         >= |      1,180        5.06       94.87
          ~ |      1,196        5.13      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. tab egfr_short_operator if egfr_short_record!=.,m

eGFR_short_ |
   operator |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,327        9.98        9.98
          < |      1,154        4.95       14.92
         <= |      1,170        5.02       19.94
          = |     15,125       64.84       84.78
          > |      1,153        4.94       89.72
         >= |      1,245        5.34       95.06
          ~ |      1,153        4.94      100.00
------------+-----------------------------------
      Total |     23,327      100.00

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<60&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(20,258 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<30&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(22,619 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      3,047       99.28       99.28
  sotrovimab |          4        0.13       99.41
    paxlovid |          8        0.26       99.67
molnupiravir |          6        0.20       99.87
       other |          4        0.13      100.00
-------------+-----------------------------------
       Total |      3,069      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        702       99.15       99.15
    paxlovid |          1        0.14       99.29
molnupiravir |          3        0.42       99.72
       other |          2        0.28      100.00
-------------+-----------------------------------
       Total |        708      100.00

. *drug interactions*
. tab drug if drugs_do_not_use<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        625       99.52       99.52
  sotrovimab |          1        0.16       99.68
molnupiravir |          1        0.16       99.84
       other |          1        0.16      100.00
-------------+-----------------------------------
       Total |        628      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-3*365.
> 25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        625       99.52       99.52
  sotrovimab |          1        0.16       99.68
molnupiravir |          1        0.16       99.84
       other |          1        0.16      100.00
-------------+-----------------------------------
       Total |        628      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-365.25
> )

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        551       99.46       99.46
  sotrovimab |          1        0.18       99.64
molnupiravir |          1        0.18       99.82
       other |          1        0.18      100.00
-------------+-----------------------------------
       Total |        554      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        315       99.06       99.06
  sotrovimab |          1        0.31       99.37
molnupiravir |          1        0.31       99.69
       other |          1        0.31      100.00
-------------+-----------------------------------
       Total |        318      100.00

. tab drug if drugs_consider_risk<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        617       99.84       99.84
       other |          1        0.16      100.00
-------------+-----------------------------------
       Total |        618      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-
> 3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        617       99.84       99.84
       other |          1        0.16      100.00
-------------+-----------------------------------
       Total |        618      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-
> 365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        542       99.82       99.82
       other |          1        0.18      100.00
-------------+-----------------------------------
       Total |        543      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-
> 180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        343       99.71       99.71
       other |          1        0.29      100.00
-------------+-----------------------------------
       Total |        344      100.00

. gen drugs_do_not_use_contra=(drugs_do_not_use<=start_date&drugs_do_not_use>=(
> start_date-180))  // Are these CI drug for paxlovid only??

. gen drugs_consider_risk_contra=(drugs_consider_risk<=start_date&drugs_conside
> r_risk>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contra = 1 if egfr_30==1 | dialysis==1
(20,411 missing values generated)

. replace paxlovid_contra = 1 if liver_disease==1 
(3,806 real changes made)

. replace paxlovid_contra = 1 if solid_organ==1 
(5,189 real changes made)

. replace paxlovid_contra = 1 if drugs_do_not_use<=start_date&drugs_do_not_use>
> =(start_date-180)
(162 real changes made)

. recode paxlovid_contra . = 0
(paxlovid_contra: 11254 changes made)

. by drug, sort: count if paxlovid_contra==1

-------------------------------------------------------------------------------
-> drug = control
  11,967
-------------------------------------------------------------------------------
-> drug = sotrovimab
  27
-------------------------------------------------------------------------------
-> drug = paxlovid
  21
-------------------------------------------------------------------------------
-> drug = molnupiravir
  27
-------------------------------------------------------------------------------
-> drug = other
  31

. 
. 
. ****************************
. *       COX MODEL               *
. ****************************
. drop if drug==4 // removing those on casirivimab or remdesivir as first drug 
> after covid test
(56 observations deleted)

. rename covid_hosp_date covid_hosp

. rename all_hosp_date all_hosp

. rename died_date_ons died

. 
. * Generate failure 
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_d
> iarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd ae_anaphylaxis_icd ae
> _anaphylaxis_snomed new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed /
> //
>                                            new_ae_psa_snomed new_ae_ankspon_c
> tv new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         display "`var'"
  3.         by drug, sort: count if `var'!=.
  4.         by drug, sort: count if `var'<start_date & `var' 
  5.         replace `var'=. if `var'<start_date & `var'!=.
  6.         gen fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29
> , paxlovid_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==1
  7.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_dat
> e_29, sotrovimab_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==2
  8.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_dat
> e_29, sotrovimab_d, paxlovid_d, remdesivir_d, casirivimab_d)) if drug==3
  9.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_dat
> e_29, sotrovimab_d, paxlovid_d, molnupiravir_d, remdesivir_d, casirivimab_d))
>  if drug==0
 10.         tab drug fail_`var', m
 11. }
ae_spc_gp

-------------------------------------------------------------------------------
-> drug = control
  732
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |    fail_ae_spc_gp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,393        729 |    23,122 
  sotrovimab |        43          1 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        51          2 |        53 
-------------+----------------------+----------
       Total |    22,539        732 |    23,271 
ae_spc_serious

-------------------------------------------------------------------------------
-> drug = control
  489
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |  fail_ae_spc_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,634        488 |    23,122 
  sotrovimab |        41          3 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    22,780        491 |    23,271 
ae_spc_all

-------------------------------------------------------------------------------
-> drug = control
  1,206
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,920      1,202 |    23,122 
  sotrovimab |        40          4 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        51          2 |        53 
-------------+----------------------+----------
       Total |    22,063      1,208 |    23,271 
ae_imae_gp

-------------------------------------------------------------------------------
-> drug = control
  1,215
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |    fail_ae_imae_gp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,909      1,213 |    23,122 
  sotrovimab |        40          4 |        44 
    paxlovid |        48          4 |        52 
molnupiravir |        50          3 |        53 
-------------+----------------------+----------
       Total |    22,047      1,224 |    23,271 
ae_imae_serious

-------------------------------------------------------------------------------
-> drug = control
  410
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_imae_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,713        409 |    23,122 
  sotrovimab |        42          2 |        44 
    paxlovid |        50          2 |        52 
molnupiravir |        51          2 |        53 
-------------+----------------------+----------
       Total |    22,856        415 |    23,271 
ae_imae_all

-------------------------------------------------------------------------------
-> drug = control
  1,604
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,521      1,601 |    23,122 
  sotrovimab |        38          6 |        44 
    paxlovid |        46          6 |        52 
molnupiravir |        48          5 |        53 
-------------+----------------------+----------
       Total |    21,653      1,618 |    23,271 
ae_all

-------------------------------------------------------------------------------
-> drug = control
  3,187
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  9
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    19,943      3,179 |    23,122 
  sotrovimab |        34         10 |        44 
    paxlovid |        43          9 |        52 
molnupiravir |        46          7 |        53 
-------------+----------------------+----------
       Total |    20,066      3,205 |    23,271 
ae_all_serious

-------------------------------------------------------------------------------
-> drug = control
  1,122
-------------------------------------------------------------------------------
-> drug = sotrovimab
  5
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |  fail_ae_all_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,003      1,119 |    23,122 
  sotrovimab |        39          5 |        44 
    paxlovid |        49          3 |        52 
molnupiravir |        51          2 |        53 
-------------+----------------------+----------
       Total |    22,142      1,129 |    23,271 
ae_diverticulitis_snomed

-------------------------------------------------------------------------------
-> drug = control
  250
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,874        248 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,023        248 |    23,271 
ae_diarrhoea_snomed

-------------------------------------------------------------------------------
-> drug = control
  255
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,868        254 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,016        255 |    23,271 
ae_taste_snomed

-------------------------------------------------------------------------------
-> drug = control
  236
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,886        236 |    23,122 
  sotrovimab |        43          1 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,033        238 |    23,271 
ae_diverticulitis_icd

-------------------------------------------------------------------------------
-> drug = control
  264
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_diverticuliti
             |         s_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,859        263 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,008        263 |    23,271 
ae_taste_icd

-------------------------------------------------------------------------------
-> drug = control
  229
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |   fail_ae_taste_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,893        229 |    23,122 
  sotrovimab |        41          3 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,039        232 |    23,271 
ae_anaphylaxis_icd

-------------------------------------------------------------------------------
-> drug = control
  246
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_anaphylaxis_i
             |          cd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,877        245 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,025        246 |    23,271 
ae_anaphylaxis_snomed

-------------------------------------------------------------------------------
-> drug = control
  271
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,851        271 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        50          2 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    22,998        273 |    23,271 
new_ae_ra_snomed

-------------------------------------------------------------------------------
-> drug = control
  179
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,943        179 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,091        180 |    23,271 
new_ae_sle_ctv

-------------------------------------------------------------------------------
-> drug = control
  222
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,901        221 |    23,122 
  sotrovimab |        42          2 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,047        224 |    23,271 
new_ae_psoriasis_snomed

-------------------------------------------------------------------------------
-> drug = control
  186
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,936        186 |    23,122 
  sotrovimab |        43          1 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,082        189 |    23,271 
new_ae_psa_snomed

-------------------------------------------------------------------------------
-> drug = control
  213
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,909        213 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,056        215 |    23,271 
new_ae_ankspon_ctv

-------------------------------------------------------------------------------
-> drug = control
  220
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,902        220 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,050        221 |    23,271 
new_ae_ibd_snomed

-------------------------------------------------------------------------------
-> drug = control
  219
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,904        218 |    23,122 
  sotrovimab |        43          1 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,052        219 |    23,271 
new_ae_ra_icd

-------------------------------------------------------------------------------
-> drug = control
  210
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |  fail_new_ae_ra_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,913        209 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,060        211 |    23,271 
new_ae_sle_icd

-------------------------------------------------------------------------------
-> drug = control
  203
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |  fail_new_ae_sle_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,919        203 |    23,122 
  sotrovimab |        42          2 |        44 
    paxlovid |        51          1 |        52 
molnupiravir |        52          1 |        53 
-------------+----------------------+----------
       Total |    23,064        207 |    23,271 
covid_hosp

-------------------------------------------------------------------------------
-> drug = control
  137
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |    fail_covid_hosp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,985        137 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,134        137 |    23,271 
all_hosp

-------------------------------------------------------------------------------
-> drug = control
  126
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |     fail_all_hosp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,996        126 |    23,122 
  sotrovimab |        43          1 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        53          0 |        53 
-------------+----------------------+----------
       Total |    23,144        127 |    23,271 
died

-------------------------------------------------------------------------------
-> drug = control
  450
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,227 missing values generated)
(52 real changes made)
(53 real changes made)
(23,122 real changes made)

             |       fail_died
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,674        448 |    23,122 
  sotrovimab |        44          0 |        44 
    paxlovid |        52          0 |        52 
molnupiravir |        51          2 |        53 
-------------+----------------------+----------
       Total |    22,821        450 |    23,271 

. * Add half-day buffer if outcome on indexdate
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_d
> iarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd ae_anaphylaxis_icd ae
> _anaphylaxis_snomed new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed /
> //
>                                            new_ae_psa_snomed new_ae_ankspon_c
> tv new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         display "`var'"
  3.         replace `var'=`var'+0.5 if `var'==start_date
  4. }
ae_spc_gp
(33 real changes made)
ae_spc_serious
(18 real changes made)
ae_spc_all
(51 real changes made)
ae_imae_gp
(37 real changes made)
ae_imae_serious
(13 real changes made)
ae_imae_all
(50 real changes made)
ae_all
(115 real changes made)
ae_all_serious
(40 real changes made)
ae_diverticulitis_snomed
(13 real changes made)
ae_diarrhoea_snomed
(10 real changes made)
ae_taste_snomed
(10 real changes made)
ae_diverticulitis_icd
(13 real changes made)
ae_taste_icd
(5 real changes made)
ae_anaphylaxis_icd
(9 real changes made)
ae_anaphylaxis_snomed
(5 real changes made)
new_ae_ra_snomed
(5 real changes made)
new_ae_sle_ctv
(9 real changes made)
new_ae_psoriasis_snomed
(4 real changes made)
new_ae_psa_snomed
(5 real changes made)
new_ae_ankspon_ctv
(4 real changes made)
new_ae_ibd_snomed
(10 real changes made)
new_ae_ra_icd
(8 real changes made)
new_ae_sle_icd
(5 real changes made)
covid_hosp
(4 real changes made)
all_hosp
(6 real changes made)
died
(11 real changes made)

. *Generate censor date
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_d
> iarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd ae_anaphylaxis_icd ae
> _anaphylaxis_snomed new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed /
> //
>                                            new_ae_psa_snomed new_ae_ankspon_c
> tv new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         gen stop_`var'=`var' if fail_`var'==1
  3.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_
> date_29,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d) if fail_`var'==
> 0&drug==1
  4.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_
> date_29,sotrovimab_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==2
  5.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_
> date_29,sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d) if fail_`var'==0&
> drug==3
  6.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_
> date_29,sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d) if
>  fail_`var'==0&drug==0
  7.         format %td stop_`var'
  8. }
(22,539 missing values generated)
(43 real changes made)
(52 real changes made)
(51 real changes made)
(22,393 real changes made)
(22,780 missing values generated)
(41 real changes made)
(52 real changes made)
(53 real changes made)
(22,634 real changes made)
(22,063 missing values generated)
(40 real changes made)
(52 real changes made)
(51 real changes made)
(21,920 real changes made)
(22,047 missing values generated)
(40 real changes made)
(48 real changes made)
(50 real changes made)
(21,909 real changes made)
(22,856 missing values generated)
(42 real changes made)
(50 real changes made)
(51 real changes made)
(22,713 real changes made)
(21,653 missing values generated)
(38 real changes made)
(46 real changes made)
(48 real changes made)
(21,521 real changes made)
(20,066 missing values generated)
(34 real changes made)
(43 real changes made)
(46 real changes made)
(19,943 real changes made)
(22,142 missing values generated)
(39 real changes made)
(49 real changes made)
(51 real changes made)
(22,003 real changes made)
(23,023 missing values generated)
(44 real changes made)
(52 real changes made)
(53 real changes made)
(22,874 real changes made)
(23,016 missing values generated)
(44 real changes made)
(52 real changes made)
(52 real changes made)
(22,868 real changes made)
(23,033 missing values generated)
(43 real changes made)
(52 real changes made)
(52 real changes made)
(22,886 real changes made)
(23,008 missing values generated)
(44 real changes made)
(52 real changes made)
(53 real changes made)
(22,859 real changes made)
(23,039 missing values generated)
(41 real changes made)
(52 real changes made)
(53 real changes made)
(22,893 real changes made)
(23,025 missing values generated)
(44 real changes made)
(51 real changes made)
(53 real changes made)
(22,877 real changes made)
(22,998 missing values generated)
(44 real changes made)
(50 real changes made)
(53 real changes made)
(22,851 real changes made)
(23,091 missing values generated)
(44 real changes made)
(51 real changes made)
(53 real changes made)
(22,943 real changes made)
(23,047 missing values generated)
(42 real changes made)
(51 real changes made)
(53 real changes made)
(22,901 real changes made)
(23,082 missing values generated)
(43 real changes made)
(51 real changes made)
(52 real changes made)
(22,936 real changes made)
(23,056 missing values generated)
(44 real changes made)
(51 real changes made)
(52 real changes made)
(22,909 real changes made)
(23,050 missing values generated)
(44 real changes made)
(52 real changes made)
(52 real changes made)
(22,902 real changes made)
(23,052 missing values generated)
(43 real changes made)
(52 real changes made)
(53 real changes made)
(22,904 real changes made)
(23,060 missing values generated)
(44 real changes made)
(51 real changes made)
(52 real changes made)
(22,913 real changes made)
(23,064 missing values generated)
(42 real changes made)
(51 real changes made)
(52 real changes made)
(22,919 real changes made)
(23,134 missing values generated)
(44 real changes made)
(52 real changes made)
(53 real changes made)
(22,985 real changes made)
(23,144 missing values generated)
(43 real changes made)
(52 real changes made)
(53 real changes made)
(22,996 real changes made)
(22,821 missing values generated)
(44 real changes made)
(52 real changes made)
(51 real changes made)
(22,674 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_da
> te) failure(fail_ae_all==1) 

                id:  patient_id
     failure event:  fail_ae_all == 1
obs. time interval:  (stop_ae_all[_n-1], stop_ae_all]
 enter on or after:  time start_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_date

------------------------------------------------------------------------------
     23,271  total observations
         30  observations end on or before enter()
------------------------------------------------------------------------------
     23,241  observations remaining, representing
     23,241  subjects
      3,205  failures in single-failure-per-subject data
    597,562  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        28

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==0&min(sotrovimab_d,paxlovid_d,molnupiravir_d,re
> mdesivir_d,casirivimab_d)==stop_ae_all
  54

. count if fail_ae_all==0&drug==1&min(paxlovid_d,molnupiravir_d,remdesivir_d,ca
> sirivimab_d)==stop_ae_all
  0

. count if fail_ae_all==0&drug==2&min(sotrovimab_d,molnupiravir_d,remdesivir_d,
> casirivimab_d)==stop_ae_all
  0

. count if fail_ae_all==0&drug==3&min(sotrovimab_d,paxlovid_d,remdesivir_d,casi
> rivimab_d)==stop_ae_all
  0

. // keep if _st==1 -> observations end on or before enter -> should be 0 in ac
> tual dataset
. tab _t,m

   analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
         .5 |        114        0.49        0.49
          1 |        139        0.60        1.09
          2 |        142        0.61        1.70
          3 |        135        0.58        2.28
          4 |        118        0.51        2.78
          5 |        109        0.47        3.25
          6 |        136        0.58        3.84
          7 |        127        0.55        4.38
          8 |         93        0.40        4.78
          9 |        101        0.43        5.22
         10 |        130        0.56        5.78
         11 |        111        0.48        6.25
         12 |        117        0.50        6.76
         13 |        144        0.62        7.37
         14 |        170        0.73        8.10
         15 |        164        0.70        8.81
         16 |        151        0.65        9.46
         17 |        160        0.69       10.15
         18 |        151        0.65       10.79
         19 |        137        0.59       11.38
         20 |        156        0.67       12.05
         21 |        157        0.67       12.73
         22 |        130        0.56       13.29
         23 |        150        0.64       13.93
         24 |        163        0.70       14.63
         25 |        132        0.57       15.20
         26 |        148        0.64       15.84
         27 |        147        0.63       16.47
         28 |     19,409       83.40       99.87
          . |         30        0.13      100.00
------------+-----------------------------------
      Total |     23,271      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |       112          0          1          1 |       114 
           |      0.48       0.00       1.92       1.89 |      0.49 
-----------+--------------------------------------------+----------
         1 |       139          0          0          0 |       139 
           |      0.60       0.00       0.00       0.00 |      0.60 
-----------+--------------------------------------------+----------
         2 |       142          0          0          0 |       142 
           |      0.61       0.00       0.00       0.00 |      0.61 
-----------+--------------------------------------------+----------
         3 |       134          0          1          0 |       135 
           |      0.58       0.00       1.92       0.00 |      0.58 
-----------+--------------------------------------------+----------
         4 |       116          1          0          1 |       118 
           |      0.50       2.27       0.00       1.89 |      0.51 
-----------+--------------------------------------------+----------
         5 |       108          0          1          0 |       109 
           |      0.47       0.00       1.92       0.00 |      0.47 
-----------+--------------------------------------------+----------
         6 |       136          0          0          0 |       136 
           |      0.59       0.00       0.00       0.00 |      0.58 
-----------+--------------------------------------------+----------
         7 |       125          1          1          0 |       127 
           |      0.54       2.27       1.92       0.00 |      0.55 
-----------+--------------------------------------------+----------
         8 |        93          0          0          0 |        93 
           |      0.40       0.00       0.00       0.00 |      0.40 
-----------+--------------------------------------------+----------
         9 |       101          0          0          0 |       101 
           |      0.44       0.00       0.00       0.00 |      0.43 
-----------+--------------------------------------------+----------
        10 |       130          0          0          0 |       130 
           |      0.56       0.00       0.00       0.00 |      0.56 
-----------+--------------------------------------------+----------
        11 |       108          1          1          1 |       111 
           |      0.47       2.27       1.92       1.89 |      0.48 
-----------+--------------------------------------------+----------
        12 |       115          1          1          0 |       117 
           |      0.50       2.27       1.92       0.00 |      0.50 
-----------+--------------------------------------------+----------
        13 |       143          0          0          1 |       144 
           |      0.62       0.00       0.00       1.89 |      0.62 
-----------+--------------------------------------------+----------
        14 |       168          1          0          1 |       170 
           |      0.73       2.27       0.00       1.89 |      0.73 
-----------+--------------------------------------------+----------
        15 |       163          0          0          1 |       164 
           |      0.70       0.00       0.00       1.89 |      0.70 
-----------+--------------------------------------------+----------
        16 |       150          1          0          0 |       151 
           |      0.65       2.27       0.00       0.00 |      0.65 
-----------+--------------------------------------------+----------
        17 |       159          0          1          0 |       160 
           |      0.69       0.00       1.92       0.00 |      0.69 
-----------+--------------------------------------------+----------
        18 |       150          1          0          0 |       151 
           |      0.65       2.27       0.00       0.00 |      0.65 
-----------+--------------------------------------------+----------
        19 |       136          0          0          1 |       137 
           |      0.59       0.00       0.00       1.89 |      0.59 
-----------+--------------------------------------------+----------
        20 |       155          1          0          0 |       156 
           |      0.67       2.27       0.00       0.00 |      0.67 
-----------+--------------------------------------------+----------
        21 |       157          0          0          0 |       157 
           |      0.68       0.00       0.00       0.00 |      0.67 
-----------+--------------------------------------------+----------
        22 |       130          0          0          0 |       130 
           |      0.56       0.00       0.00       0.00 |      0.56 
-----------+--------------------------------------------+----------
        23 |       150          0          0          0 |       150 
           |      0.65       0.00       0.00       0.00 |      0.64 
-----------+--------------------------------------------+----------
        24 |       163          0          0          0 |       163 
           |      0.70       0.00       0.00       0.00 |      0.70 
-----------+--------------------------------------------+----------
        25 |       132          0          0          0 |       132 
           |      0.57       0.00       0.00       0.00 |      0.57 
-----------+--------------------------------------------+----------
        26 |       147          1          0          0 |       148 
           |      0.64       2.27       0.00       0.00 |      0.64 
-----------+--------------------------------------------+----------
        27 |       147          0          0          0 |       147 
           |      0.64       0.00       0.00       0.00 |      0.63 
-----------+--------------------------------------------+----------
        28 |    19,283         35         45         46 |    19,409 
           |     83.40      79.55      86.54      86.79 |     83.40 
-----------+--------------------------------------------+----------
         . |        30          0          0          0 |        30 
           |      0.13       0.00       0.00       0.00 |      0.13 
-----------+--------------------------------------------+----------
     Total |    23,122         44         52         53 |    23,271 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |       112          0          1          1 |       114 
           |      3.52       0.00      11.11      14.29 |      3.56 
-----------+--------------------------------------------+----------
         1 |       118          0          0          0 |       118 
           |      3.71       0.00       0.00       0.00 |      3.68 
-----------+--------------------------------------------+----------
         2 |       131          0          0          0 |       131 
           |      4.12       0.00       0.00       0.00 |      4.09 
-----------+--------------------------------------------+----------
         3 |       118          0          1          0 |       119 
           |      3.71       0.00      11.11       0.00 |      3.71 
-----------+--------------------------------------------+----------
         4 |       110          1          0          1 |       112 
           |      3.46      10.00       0.00      14.29 |      3.49 
-----------+--------------------------------------------+----------
         5 |       108          0          1          0 |       109 
           |      3.40       0.00      11.11       0.00 |      3.40 
-----------+--------------------------------------------+----------
         6 |       136          0          0          0 |       136 
           |      4.28       0.00       0.00       0.00 |      4.24 
-----------+--------------------------------------------+----------
         7 |       125          1          1          0 |       127 
           |      3.93      10.00      11.11       0.00 |      3.96 
-----------+--------------------------------------------+----------
         8 |        93          0          0          0 |        93 
           |      2.93       0.00       0.00       0.00 |      2.90 
-----------+--------------------------------------------+----------
         9 |       101          0          0          0 |       101 
           |      3.18       0.00       0.00       0.00 |      3.15 
-----------+--------------------------------------------+----------
        10 |       130          0          0          0 |       130 
           |      4.09       0.00       0.00       0.00 |      4.06 
-----------+--------------------------------------------+----------
        11 |       108          1          1          1 |       111 
           |      3.40      10.00      11.11      14.29 |      3.46 
-----------+--------------------------------------------+----------
        12 |       115          1          1          0 |       117 
           |      3.62      10.00      11.11       0.00 |      3.65 
-----------+--------------------------------------------+----------
        13 |       104          0          0          1 |       105 
           |      3.27       0.00       0.00      14.29 |      3.28 
-----------+--------------------------------------------+----------
        14 |       118          1          0          1 |       120 
           |      3.71      10.00       0.00      14.29 |      3.74 
-----------+--------------------------------------------+----------
        15 |       121          0          0          1 |       122 
           |      3.81       0.00       0.00      14.29 |      3.81 
-----------+--------------------------------------------+----------
        16 |       109          1          0          0 |       110 
           |      3.43      10.00       0.00       0.00 |      3.43 
-----------+--------------------------------------------+----------
        17 |       111          0          1          0 |       112 
           |      3.49       0.00      11.11       0.00 |      3.49 
-----------+--------------------------------------------+----------
        18 |        99          1          0          0 |       100 
           |      3.11      10.00       0.00       0.00 |      3.12 
-----------+--------------------------------------------+----------
        19 |        95          0          0          1 |        96 
           |      2.99       0.00       0.00      14.29 |      3.00 
-----------+--------------------------------------------+----------
        20 |       114          1          0          0 |       115 
           |      3.59      10.00       0.00       0.00 |      3.59 
-----------+--------------------------------------------+----------
        21 |       103          0          0          0 |       103 
           |      3.24       0.00       0.00       0.00 |      3.21 
-----------+--------------------------------------------+----------
        22 |        82          0          0          0 |        82 
           |      2.58       0.00       0.00       0.00 |      2.56 
-----------+--------------------------------------------+----------
        23 |       111          0          0          0 |       111 
           |      3.49       0.00       0.00       0.00 |      3.46 
-----------+--------------------------------------------+----------
        24 |       109          0          0          0 |       109 
           |      3.43       0.00       0.00       0.00 |      3.40 
-----------+--------------------------------------------+----------
        25 |        91          0          0          0 |        91 
           |      2.86       0.00       0.00       0.00 |      2.84 
-----------+--------------------------------------------+----------
        26 |       103          1          0          0 |       104 
           |      3.24      10.00       0.00       0.00 |      3.24 
-----------+--------------------------------------------+----------
        27 |       104          0          0          0 |       104 
           |      3.27       0.00       0.00       0.00 |      3.24 
-----------+--------------------------------------------+----------
        28 |       100          1          2          0 |       103 
           |      3.15      10.00      22.22       0.00 |      3.21 
-----------+--------------------------------------------+----------
     Total |     3,179         10          9          7 |     3,205 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |       112          0          1          1 |       114 
         1 |       118          0          0          0 |       118 
         2 |       131          0          0          0 |       131 
         3 |       118          0          1          0 |       119 
         4 |       110          1          0          1 |       112 
         5 |       108          0          1          0 |       109 
         6 |       136          0          0          0 |       136 
         7 |       125          1          1          0 |       127 
         8 |        93          0          0          0 |        93 
         9 |       101          0          0          0 |       101 
        10 |       130          0          0          0 |       130 
        11 |       108          1          1          1 |       111 
        12 |       115          1          1          0 |       117 
        13 |       104          0          0          1 |       105 
        14 |       118          1          0          1 |       120 
        15 |       121          0          0          1 |       122 
        16 |       109          1          0          0 |       110 
        17 |       111          0          1          0 |       112 
        18 |        99          1          0          0 |       100 
        19 |        95          0          0          1 |        96 
        20 |       114          1          0          0 |       115 
        21 |       103          0          0          0 |       103 
        22 |        82          0          0          0 |        82 
        23 |       111          0          0          0 |       111 
        24 |       109          0          0          0 |       109 
        25 |        91          0          0          0 |        91 
        26 |       103          1          0          0 |       104 
        27 |       104          0          0          0 |       104 
        28 |       100          1          2          0 |       103 
-----------+--------------------------------------------+----------
     Total |     3,179         10          9          7 |     3,205 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |    19,943         34         43         46 |    20,066 
           |     86.25      77.27      82.69      86.79 |     86.23 
-----------+--------------------------------------------+----------
         1 |     3,179         10          9          7 |     3,205 
           |     13.75      22.73      17.31      13.21 |     13.77 
-----------+--------------------------------------------+----------
     Total |    23,122         44         52         53 |    23,271 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         5 |         5 
           |     45.45 |     45.45 
-----------+-----------+----------
         2 |         1 |         1 
           |      9.09 |      9.09 
-----------+-----------+----------
         3 |         5 |         5 
           |     45.45 |     45.45 
-----------+-----------+----------
     Total |        11 |        11 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         6 |         6 
           |     30.00 |     30.00 
-----------+-----------+----------
         2 |         3 |         3 
           |     15.00 |     15.00 
-----------+-----------+----------
         3 |         5 |         5 
           |     25.00 |     25.00 
-----------+-----------+----------
         4 |         6 |         6 
           |     30.00 |     30.00 
-----------+-----------+----------
     Total |        20 |        20 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid_d,molnupiravir_
> d,remdesivir_d,casirivimab_d)&drug==1,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,molnupiravi
> r_d,remdesivir_d,casirivimab_d)&drug==2,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,paxlovid_d,
> remdesivir_d,casirivimab_d)&drug==3,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,paxlovid_d,
> molnupiravir_d,remdesivir_d,casirivimab_d)&drug==0,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |        11 |        11 
           |     45.83 |     45.83 
-----------+-----------+----------
         2 |         7 |         7 
           |     29.17 |     29.17 
-----------+-----------+----------
         3 |         6 |         6 
           |     25.00 |     25.00 
-----------+-----------+----------
     Total |        24 |        24 
           |    100.00 |    100.00 

. 
. save "$projectdir/output/data/main.dta", replace
(note: file /workspace/output/data/main.dta not found)
file /workspace/output/data/main.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:  17 May 2023, 13:54:47
-------------------------------------------------------------------------------
