-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset_combine_2.log
  log type:  text
 opened on:  28 Jul 2023, 12:40:24

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/ado"

. 
. *       Import control dataset
. import delimited "$projectdir/output/input_control.csv", clear
(221 vars, 50,000 obs)

. gen control_dataset=1

. *       Convert control strings to dates     * 
. foreach var of varlist   covid_test_positive_date                            
>    ///
>                                                  covid_test_positive_date2   
>                            ///
>                                                  covid_test_positive_date3   
>                            ///
>                                                  covid_test_positive_treat   
>                            ///
>                                                  prior_covid_date            
>                            ///
>                                                  sotrovimab                  
>                                            ///
>                                                  molnupiravir                
>                                    /// 
>                                                  paxlovid                    
>                                            ///
>                                                  remdesivir                  
>                                            ///
>                                                  casirivimab                 
>                                    ///
>                                                  sotrovimab_not_start        
>                            ///
>                                                  molnupiravir_not_start      
>                            ///
>                                                  paxlovid_not_start          
>                                    ///
>                                                  date_treated                
>                                    ///
>                                                  start_date                  
>                                            ///
>                                                  drugs_paxlovid_interaction  
>                            ///
>                                                  drugs_nirmatrelvir_interacti
> on                 ///
>                                                  last_vaccination_date       
>                            ///
>                                                  death_date                  
>                                            ///
>                                                  dereg_date                  
>                                    ///
>                                                  bmi_date_measured           
>                                    ///
>                                                  creatinine_ctv3_date        
>                            ///
>                                                  creatinine_snomed_date      
>                            ///
>                                                  creatinine_short_snomed_date
>                    ///
>                                                  ae_diverticulitis_icd       
>                            ///
>                                                  ae_diverticulitis_snomed    
>                            ///
>                                                  ae_diarrhoea_snomed         
>                            ///
>                                                  ae_taste_snomed             
>                                    ///
>                                                  ae_taste_icd                
>                                    ///
>                                                  ae_rash_snomed              
>                                    ///
>                                                  ae_anaphylaxis_icd          
>                                    ///
>                                                  ae_anaphylaxis_snomed       
>                            ///
>                                                  ae_anaphlaxis_ae            
>                                    ///
>                                                  ae_drugreact_ae             
>                                    ///
>                                                  ae_allergic_ae              
>                                    ///
>                                                  ae_rheumatoid_arthritis_snom
> ed                 ///
>                                                  ae_rheumatoid_arthritis_icd 
>                    ///
>                                                  ae_sle_ctv                  
>                                            ///
>                                                  ae_sle_icd                  
>                                            ///
>                                                  ae_psoriasis_snomed         
>                            ///
>                                                  ae_psoriatic_arthritis_snome
> d                  ///
>                                                  ae_ankylosing_spondylitis_ct
> v                  ///
>                                                  ae_ibd_snomed               
>                                    ///
>                                                  ae_diverticulitis_ae        
>                            ///
>                                                  ae_rheumatoid_arthritis_ae  
>                            ///
>                                                  ae_sle_ae                   
>                                            ///
>                                                  ae_psoriasis_ae             
>                                    ///
>                                                  ae_psoriatic_arthritis_ae   
>                            ///
>                                                  ae_ankylosing_spondylitis_ae
>                    ///
>                                                  ae_ibd_ae                   
>                                            ///
>                                                  ae_diverticulitis_icd_prim  
>                            ///     
>                                                  ae_taste_icd_prim           
>                                    ///
>                                                  ae_anaphylaxis_icd_prim     
>                            ///
>                                                  ae_rheumatoid_arthritis_icd_
> prim               ///
>                                                  ae_sle_icd_prim             
>                                    ///
>                                                  pre_diverticulitis_icd_prim 
>                    ///
>                                                  pre_taste_icd_prim          
>                                    ///
>                                                  pre_anaphylaxis_icd_prim    
>                            ///
>                                                  pre_sle_icd_prim            
>                                    ///
>                                                  pre_rheumatoid_icd_prim     
>                            ///
>                                                  rheumatoid_arthritis_nhsd_sn
> omed               ///
>                                                  rheumatoid_arthritis_nhsd_ic
> d10                ///
>                                                  sle_nhsd_ctv                
>                                    ///
>                                                  sle_nhsd_icd10              
>                                    ///
>                                                  psoriasis_nhsd              
>                                    ///
>                                                  psoriatic_arthritis_nhsd    
>                            ///
>                                                  ankylosing_spondylitis_nhsd 
>                    ///
>                                                  ibd_ctv                     
>                                            ///
>                                                  allcause_emerg_aande        
>                            ///
>                                                  all_hosp_date               
>                                    ///
>                                                  all_hosp_date0              
>                                    ///
>                                                  all_hosp_date1              
>                                    ///
>                                                  all_hosp_date2              
>                                    ///
>                                                  hosp_discharge_date         
>                            ///
>                                                  hosp_discharge_date0        
>                            ///
>                                                  hosp_discharge_date1        
>                            ///
>                                                  hosp_discharge_date2        
>                            ///
>                                                  covid_hosp_date             
>                                    ///
>                                                  covid_hosp_date0            
>                                    ///
>                                                  covid_hosp_date1            
>                                    ///
>                                                  covid_hosp_date2            
>                                    ///                                       
>       
>                                                  covid_discharge_date        
>                            ///
>                                                  covid_discharge_date0       
>                            ///                                             
>                                                  covid_discharge_date1       
>                            /// 
>                                                  covid_discharge_date2       
>                            /// 
>                                                  any_covid_hosp_discharge    
>                            ///                     
>                                                  covid_hosp_date_mabs        
>                            /// 
>                                                  covid_hosp_date_mabs_not_pri
> mary               /// 
>                                                  died_date_ons               
>                                    ///
>                                                  died_ons_covid              
>                                    ///
>                                                  pre_diverticulitis_icd      
>                            ///
>                                                  pre_diverticulitis_snomed   
>                            ///
>                                                  pre_diverticulitis_ae       
>                            ///
>                                                  pre_diarrhoea_snomed        
>                            ///
>                                                  pre_taste_snomed            
>                                    ///
>                                                  pre_taste_icd               
>                                    ///
>                                                  pre_rash_snomed             
>                                    ///
>                                                  pre_anaphylaxis_icd         
>                            ///
>                                                  pre_anaphylaxis_snomed      
>                            ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_drugreact_ae            
>                                    ///
>                                                  pre_allergic_ae             
>                                    ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_rheumatoid_arthritis_ae 
>                    ///
>                                                  pre_rheumatoid_arthritis_sno
> med                ///
>                                                  pre_rheumatoid_arthritis_icd
>                    ///
>                                                  pre_ankylosing_spondylitis_c
> tv                 ///
>                                                  pre_ankylosing_spondylitis_a
> e                  ///
>                                                  pre_psoriasis_snomed        
>                            ///
>                                                  pre_psoriasis_ae            
>                                    ///
>                                                  pre_psoriatic_arthritis_ae  
>                            ///
>                                                  pre_psoriatic_arthritis_snom
> ed                 ///
>                                                  pre_sle_ctv                 
>                                    ///
>                                                  pre_sle_icd                 
>                                    ///
>                                                  pre_sle_ae                  
>                                            ///
>                                                  pre_ibd_ae                  
>                                            ///
>                                                  pre_ibd_snomed {            
>                             
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(30,000 missing values generated)
(4,999 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,558 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)

. tab control_dataset

control_dat |
       aset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000      100.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

. save "$projectdir/output/data/control.dta", replace 
file /workspace/output/data/control.dta saved

. //                                               //                          
>    ///
. 
. * import treatment dataset
. import delimited "$projectdir/output/input_treatment.csv", clear
(221 vars, 50,000 obs)

. gen treatment_dataset=1

. *       Convert control strings to dates     * 
. foreach var of varlist   covid_test_positive_date                            
>    ///
>                                                  covid_test_positive_date2   
>                            ///
>                                                  covid_test_positive_date3   
>                            ///
>                                                  covid_test_positive_treat   
>                            ///
>                                                  prior_covid_date            
>                            ///
>                                                  sotrovimab                  
>                                            ///
>                                                  molnupiravir                
>                                    /// 
>                                                  paxlovid                    
>                                            ///
>                                                  remdesivir                  
>                                            ///
>                                                  casirivimab                 
>                                    ///
>                                                  sotrovimab_not_start        
>                            ///
>                                                  molnupiravir_not_start      
>                            ///
>                                                  paxlovid_not_start          
>                                    ///
>                                                  date_treated                
>                                    ///
>                                                  start_date                  
>                                            ///
>                                                  drugs_paxlovid_interaction  
>                            ///
>                                                  drugs_nirmatrelvir_interacti
> on                 ///
>                                                  last_vaccination_date       
>                            ///
>                                                  death_date                  
>                                            ///
>                                                  dereg_date                  
>                                    ///
>                                                  bmi_date_measured           
>                                    ///
>                                                  creatinine_ctv3_date        
>                            ///
>                                                  creatinine_snomed_date      
>                            ///
>                                                  creatinine_short_snomed_date
>                    ///
>                                                  ae_diverticulitis_icd       
>                            ///
>                                                  ae_diverticulitis_snomed    
>                            ///
>                                                  ae_diarrhoea_snomed         
>                            ///
>                                                  ae_taste_snomed             
>                                    ///
>                                                  ae_taste_icd                
>                                    ///
>                                                  ae_rash_snomed              
>                                    ///
>                                                  ae_anaphylaxis_icd          
>                                    ///
>                                                  ae_anaphylaxis_snomed       
>                            ///
>                                                  ae_anaphlaxis_ae            
>                                    ///
>                                                  ae_drugreact_ae             
>                                    ///
>                                                  ae_allergic_ae              
>                                    ///
>                                                  ae_rheumatoid_arthritis_snom
> ed                 ///
>                                                  ae_rheumatoid_arthritis_icd 
>                    ///
>                                                  ae_sle_ctv                  
>                                            ///
>                                                  ae_sle_icd                  
>                                            ///
>                                                  ae_psoriasis_snomed         
>                            ///
>                                                  ae_psoriatic_arthritis_snome
> d                  ///
>                                                  ae_ankylosing_spondylitis_ct
> v                  ///
>                                                  ae_ibd_snomed               
>                                    ///
>                                                  ae_diverticulitis_ae        
>                            ///
>                                                  ae_rheumatoid_arthritis_ae  
>                            ///
>                                                  ae_sle_ae                   
>                                            ///
>                                                  ae_psoriasis_ae             
>                                    ///
>                                                  ae_psoriatic_arthritis_ae   
>                            ///
>                                                  ae_ankylosing_spondylitis_ae
>                    ///
>                                                  ae_ibd_ae                   
>                                            ///
>                                                  ae_diverticulitis_icd_prim  
>                            ///     
>                                                  ae_taste_icd_prim           
>                                    ///
>                                                  ae_anaphylaxis_icd_prim     
>                            ///
>                                                  ae_rheumatoid_arthritis_icd_
> pri                ///
>                                                  ae_sle_icd_prim             
>                                    ///
>                                                  pre_diverticulitis_icd_prim 
>                    ///
>                                                  pre_taste_icd_prim          
>                                    ///
>                                                  pre_anaphylaxis_icd_prim    
>                            ///
>                                                  pre_rheumatoid_icd_prim     
>                            ///
>                                                  pre_sle_icd_prim            
>                                    ///
>                                                  rheumatoid_arthritis_nhsd_sn
> omed               ///
>                                                  rheumatoid_arthritis_nhsd_ic
> d10                ///
>                                                  sle_nhsd_ctv                
>                                    ///
>                                                  sle_nhsd_icd10              
>                                    ///
>                                                  psoriasis_nhsd              
>                                    ///
>                                                  psoriatic_arthritis_nhsd    
>                            ///
>                                                  ankylosing_spondylitis_nhsd 
>                    ///
>                                                  ibd_ctv                     
>                                            ///
>                                                  allcause_emerg_aande        
>                            ///
>                                                  all_hosp_date               
>                                    ///
>                                                  all_hosp_date0              
>                                    ///
>                                                  all_hosp_date1              
>                                    ///
>                                                  all_hosp_date2              
>                                    ///
>                                                  hosp_discharge_date         
>                            ///
>                                                  hosp_discharge_date0        
>                            ///
>                                                  hosp_discharge_date1        
>                            ///
>                                                  hosp_discharge_date2        
>                            ///
>                                                  covid_hosp_date             
>                                    ///
>                                                  covid_hosp_date0            
>                                    ///
>                                                  covid_hosp_date1            
>                                    ///
>                                                  covid_hosp_date2            
>                                    ///                                       
>       
>                                                  covid_discharge_date        
>                            ///
>                                                  covid_discharge_date0       
>                            ///                                             
>                                                  covid_discharge_date1       
>                            /// 
>                                                  covid_discharge_date2       
>                            /// 
>                                                  any_covid_hosp_discharge    
>                            ///                     
>                                                  covid_hosp_date_mabs        
>                            /// 
>                                                  covid_hosp_date_mabs_not_pri
> mary               /// 
>                                                  died_date_ons               
>                                    ///
>                                                  died_ons_covid              
>                                    ///
>                                                  pre_diverticulitis_icd      
>                            ///
>                                                  pre_diverticulitis_snomed   
>                            ///
>                                                  pre_diverticulitis_ae       
>                            ///
>                                                  pre_diarrhoea_snomed        
>                            ///
>                                                  pre_taste_snomed            
>                                    ///
>                                                  pre_taste_icd               
>                                    ///
>                                                  pre_rash_snomed             
>                                    ///
>                                                  pre_anaphylaxis_icd         
>                            ///
>                                                  pre_anaphylaxis_snomed      
>                            ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_drugreact_ae            
>                                    ///
>                                                  pre_allergic_ae             
>                                    ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_rheumatoid_arthritis_ae 
>                    ///
>                                                  pre_rheumatoid_arthritis_sno
> med                ///
>                                                  pre_rheumatoid_arthritis_icd
>                    ///
>                                                  pre_ankylosing_spondylitis_c
> tv                 ///
>                                                  pre_ankylosing_spondylitis_a
> e                  ///
>                                                  pre_psoriasis_snomed        
>                            ///
>                                                  pre_psoriasis_ae            
>                                    ///
>                                                  pre_psoriatic_arthritis_ae  
>                            ///
>                                                  pre_psoriatic_arthritis_snom
> ed                 ///
>                                                  pre_sle_ctv                 
>                                    ///
>                                                  pre_sle_icd                 
>                                    ///
>                                                  pre_sle_ae                  
>                                            ///
>                                                  pre_ibd_ae                  
>                                            ///
>                                                  pre_ibd_snomed {            
>                             
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(30,000 missing values generated)
(4,999 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,544 missing values generated)
(48,518 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)

. tab treatment_dataset

treatment_d |
     ataset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000      100.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

. *********************************
. *  Append control & treatment datasets     *
. ********************************* 
. append using "$projectdir/output/data/control.dta"

. duplicates tag patient_id, gen(duplicate_patient_id)

Duplicates in terms of patient_id

. bys patient_id (treatment_dataset duplicate_patient_id): gen n=_n

. tab n

          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     95,013       95.01       95.01
          2 |      4,987        4.99      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. drop if n>1  // drops duplicate patient id and in control group
(4,987 observations deleted)

. tab control_dataset,m

control_dat |
       aset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     45,013       47.38       47.38
          . |     50,000       52.62      100.00
------------+-----------------------------------
      Total |     95,013      100.00

. tab treatment_dataset,m

treatment_d |
     ataset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000       52.62       52.62
          . |     45,013       47.38      100.00
------------+-----------------------------------
      Total |     95,013      100.00

. count if start_date==.
  48,518

. count if start_date!=date_treated & treatment_dataset==1
  984

. count if start_date!=covid_test_positive_date & control_dataset==1
  44,939

. gen dataset = 0 if control_dataset==1
(50,000 missing values generated)

. replace dataset= 1 if treatment_dataset==1
(50,000 real changes made)

. label define dataset 0 "control" 1 "drug" 

. label values dataset dataset

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ** inclusion criteria*
. keep if age>=18 & age<110
(20,258 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(3,738 observations deleted)

. ** exclusion criteria*
. count if start_date>dereg_date & start_date!=.
  3,446

. count if start_date>death_date & start_date!=.
  3,476

. drop if start_date>death_date | start_date>dereg_date
(13,457 observations deleted)

. 
. ** high risk cohort from blueteq therapeutics datafor drug arms
. tab high_risk_cohort_therapeutics dataset,m //should be 0 in control group

high_risk_cohort_ther |        dataset
             apeutics |   control       drug |     Total
----------------------+----------------------+----------
       Downs syndrome |     2,705      3,018 |     5,723 
          HIV or AIDS |     1,333      1,543 |     2,876 
                 IMID |     2,795      2,933 |     5,728 
    IMID,solid cancer |     2,693      3,124 |     5,817 
                   NA |     1,416      1,454 |     2,870 
haematological dise.. |     1,326      1,475 |     2,801 
haematological mali.. |     1,403      1,560 |     2,963 
        liver disease |     1,353      1,520 |     2,873 
primary immune defi.. |     2,708      2,975 |     5,683 
sickle cell disease.. |     2,853      3,048 |     5,901 
         solid cancer |     2,742      3,033 |     5,775 
solid organ transpl.. |     2,668      2,937 |     5,605 
stem cell transplan.. |     1,376      1,569 |     2,945 
----------------------+----------------------+----------
                Total |    27,371     30,189 |    57,560 

. gen downs_syndrome_therap= 1 if strpos(high_risk_cohort_therapeutics, "Downs 
> syndrome")
(51,837 missing values generated)

. gen solid_cancer_therap=1 if strpos(high_risk_cohort_therapeutics, "solid can
> cer")
(45,968 missing values generated)

. gen haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematolo
> gical malignancies")
(54,597 missing values generated)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haema
> tologic malignancy")
(0 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "sickl
> e cell disease")
(5,901 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haema
> tological diseases")
(2,801 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "stem 
> cell transplant")
(2,945 real changes made)

. gen renal_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "renal d
> isease")
(51,955 missing values generated)

. gen liver_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "liver d
> isease")
(54,687 missing values generated)

. gen imid_on_drug_therap= 1 if strpos(high_risk_cohort_therapeutics, "IMID")
(46,015 missing values generated)

. gen immunosupression_therap= 1 if strpos(high_risk_cohort_therapeutics, "prim
> ary immune deficiencies")
(51,877 missing values generated)

. gen hiv_aids_therap= 1 if strpos(high_risk_cohort_therapeutics, "HIV or AIDS"
> )
(54,684 missing values generated)

. gen organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "soli
> d organ recipients")
(57,560 missing values generated)

. replace organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "
> solid organ transplant")
(5,605 real changes made)

. gen rare_neuro_therap= 1 if strpos(high_risk_cohort_therapeutics, "rare neuro
> logical conditions")
(51,659 missing values generated)

. count if high_risk_cohort_therapeutics!=""&high_risk_cohort_therapeutics!="ot
> her"& min(downs_syndrome_therap,solid_cancer_therap,haem_disease_therap,renal
> _disease_therap,liver_disease_therap,imid_on_drug_therap,immunosupression_the
> rap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==. //check if 
> all diseases have been captured
  2,870

. tab high_risk_cohort_therapeutics if high_risk_cohort_therapeutics!=""&high_r
> isk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer_ther
> ap,haem_disease_therap,renal_disease_therap,liver_disease_therap,imid_on_drug
> _therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,rare_
> neuro_therap)==.

          high_risk_cohort_therapeutics |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                     NA |      2,870      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      2,870      100.00

. foreach var of varlist downs_syndrome_therap solid_cancer_therap haem_disease
> _therap renal_disease_therap liver_disease_therap imid_on_drug_therap immunos
> upression_therap hiv_aids_therap organ_transplant_therap rare_neuro_therap{
  2.         replace `var'=0 if `var'==. 
  3. }
(51,837 real changes made)
(45,968 real changes made)
(42,950 real changes made)
(51,955 real changes made)
(54,687 real changes made)
(46,015 real changes made)
(51,877 real changes made)
(54,684 real changes made)
(51,955 real changes made)
(51,659 real changes made)

. 
. ** high risk cohort from open codelist from control group
. tab high_risk_cohort_nhsd,m 

high_risk_c |
 ohort_nhsd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,244        2.16        2.16
          1 |     56,316       97.84      100.00
------------+-----------------------------------
      Total |     57,560      100.00

. count if downs_syndrome==0
  46,605

. count if solid_cancer==0
  51,838

. count if haem_disease==0
  30,462

. count if renal_disease==0
  37,657

. count if liver_disease==0
  46,633

. count if imid_on_drug==0
  28,648

. count if hiv_aids==0
  46,594

. count if organ_transplant==0
  39,400

. count if rare_neuro==0
  24,800

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be 0
  15,646

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 //should be 0
  609

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==1 & downs_syndrome==0 &s
> olid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosu
> pression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  39

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  570

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 
  552

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_dr
> ug==1
  266

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_dr
> ug==1 &downs_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 
> &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0 &rar
> e_neuro==0
  12

. replace imid_drug=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_
> nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate=
> =0 &imid_on_drug==1 //ignore if steriods<4 scripts in 6m & not coded other im
> id drug 
(266 real changes made)

. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_
> steroid_drugs_nhsd==1 //ignore if steriods<4 scripts in 6m
(570 real changes made)

. count if imid_on_drug==0 & imid_nhsd==1 & imid_drug==0 //should be same numbe
> r as those dropped above 
  15,575

. replace imid_on_drug=0 if imid_nhsd==1 & imid_drug==0 
(15,804 real changes made)

. replace imid_on_drug=0 if imid_nhsd==0 & imid_drug==1 
(501 real changes made)

. gen high_risk_cohort_codelist=((downs_syndrome + solid_cancer + haem_disease 
> + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids 
> + organ_transplant + rare_neuro )>0)

. tab high_risk_cohort_codelist dataset

high_risk_ |
cohort_cod |        dataset
     elist |   control       drug |     Total
-----------+----------------------+----------
         0 |       893      1,037 |     1,930 
         1 |    26,478     29,152 |    55,630 
-----------+----------------------+----------
     Total |    27,371     30,189 |    57,560 

. tab high_risk_cohort_nhsd dataset

high_risk_ |
cohort_nhs |        dataset
         d |   control       drug |     Total
-----------+----------------------+----------
         0 |       566        678 |     1,244 
         1 |    26,805     29,511 |    56,316 
-----------+----------------------+----------
     Total |    27,371     30,189 |    57,560 

. bys dataset:count if high_risk_cohort_codelist==. & high_risk_cohort_nhsd==.

-------------------------------------------------------------------------------
-> dataset = control
  0
-------------------------------------------------------------------------------
-> dataset = drug
  0

. tab high_risk_cohort_nhsd high_risk_cohort_codelist

high_risk_ | high_risk_cohort_code
cohort_nhs |         list
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,244          0 |     1,244 
         1 |       686     55,630 |    56,316 
-----------+----------------------+----------
     Total |     1,930     55,630 |    57,560 

. tab high_risk_cohort_nhsd high_risk_cohort_codelist if high_risk_cohort_thera
> peutics!="other"

high_risk_ | high_risk_cohort_code
cohort_nhs |         list
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,244          0 |     1,244 
         1 |       686     55,630 |    56,316 
-----------+----------------------+----------
     Total |     1,930     55,630 |    57,560 

. ** combine two high risk cohorts into one 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease
>  liver_disease imid_on_drug immunosupression hiv_aids organ_transplant rare_n
> euro {
  2.         gen `var'_comb = `var'
  3.         replace `var'_comb = 1 if `var'_therap==1 
  4.         tab `var' `var'_therap 
  5.         tab dataset `var'_comb 
  6. }
(4,626 real changes made)

downs_synd | downs_syndrome_therap
      rome |         0          1 |     Total
-----------+----------------------+----------
         0 |    41,979      4,626 |    46,605 
         1 |     9,858      1,097 |    10,955 
-----------+----------------------+----------
     Total |    51,837      5,723 |    57,560 

           |  downs_syndrome_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    20,002      7,369 |    27,371 
      drug |    21,977      8,212 |    30,189 
-----------+----------------------+----------
     Total |    41,979     15,581 |    57,560 
(10,436 real changes made)

solid_canc |  solid_cancer_therap
        er |         0          1 |     Total
-----------+----------------------+----------
         0 |    41,402     10,436 |    51,838 
         1 |     4,566      1,156 |     5,722 
-----------+----------------------+----------
     Total |    45,968     11,592 |    57,560 

           |   solid_cancer_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    19,762      7,609 |    27,371 
      drug |    21,640      8,549 |    30,189 
-----------+----------------------+----------
     Total |    41,402     16,158 |    57,560 
(7,745 real changes made)

haem_disea |  haem_disease_therap
        se |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,717      7,745 |    30,462 
         1 |    20,233      6,865 |    27,098 
-----------+----------------------+----------
     Total |    42,950     14,610 |    57,560 

           |   haem_disease_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    10,848     16,523 |    27,371 
      drug |    11,869     18,320 |    30,189 
-----------+----------------------+----------
     Total |    22,717     34,843 |    57,560 
(3,655 real changes made)

renal_dise | renal_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    34,002      3,655 |    37,657 
         1 |    17,953      1,950 |    19,903 
-----------+----------------------+----------
     Total |    51,955      5,605 |    57,560 

           |  renal_disease_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    16,076     11,295 |    27,371 
      drug |    17,926     12,263 |    30,189 
-----------+----------------------+----------
     Total |    34,002     23,558 |    57,560 
(2,347 real changes made)

liver_dise | liver_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,286      2,347 |    46,633 
         1 |    10,401        526 |    10,927 
-----------+----------------------+----------
     Total |    54,687      2,873 |    57,560 

           |  liver_disease_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    21,075      6,296 |    27,371 
      drug |    23,211      6,978 |    30,189 
-----------+----------------------+----------
     Total |    44,286     13,274 |    57,560 
(9,053 real changes made)

imid_on_dr |  imid_on_drug_therap
        ug |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,900      9,053 |    44,953 
         1 |    10,115      2,492 |    12,607 
-----------+----------------------+----------
     Total |    46,015     11,545 |    57,560 

           |   imid_on_drug_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    17,077     10,294 |    27,371 
      drug |    18,823     11,366 |    30,189 
-----------+----------------------+----------
     Total |    35,900     21,660 |    57,560 
(5,118 real changes made)

           | immunosupression_ther
immunosupr |          ap
    ession |         0          1 |     Total
-----------+----------------------+----------
         0 |    46,719      5,118 |    51,837 
         1 |     5,158        565 |     5,723 
-----------+----------------------+----------
     Total |    51,877      5,683 |    57,560 

           | immunosupression_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    22,193      5,178 |    27,371 
      drug |    24,526      5,663 |    30,189 
-----------+----------------------+----------
     Total |    46,719     10,841 |    57,560 
(2,309 real changes made)

           |    hiv_aids_therap
  hiv_aids |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,285      2,309 |    46,594 
         1 |    10,399        567 |    10,966 
-----------+----------------------+----------
     Total |    54,684      2,876 |    57,560 

           |     hiv_aids_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    21,086      6,285 |    27,371 
      drug |    23,199      6,990 |    30,189 
-----------+----------------------+----------
     Total |    44,285     13,275 |    57,560 
(3,849 real changes made)

           | organ_transplant_ther
organ_tran |          ap
    splant |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,551      3,849 |    39,400 
         1 |    16,404      1,756 |    18,160 
-----------+----------------------+----------
     Total |    51,955      5,605 |    57,560 

           | organ_transplant_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    16,985     10,386 |    27,371 
      drug |    18,566     11,623 |    30,189 
-----------+----------------------+----------
     Total |    35,551     22,009 |    57,560 
(2,552 real changes made)

           |   rare_neuro_therap
rare_neuro |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,248      2,552 |    24,800 
         1 |    29,411      3,349 |    32,760 
-----------+----------------------+----------
     Total |    51,659      5,901 |    57,560 

           |    rare_neuro_comb
   dataset |         0          1 |     Total
-----------+----------------------+----------
   control |    10,633     16,738 |    27,371 
      drug |    11,615     18,574 |    30,189 
-----------+----------------------+----------
     Total |    22,248     35,312 |    57,560 

. 
. ****************************
. *       EXPOSURE                *
. ****************************
. ** removing individuals who did not start therapy
. foreach var of varlist sotrovimab molnupiravir paxlovid {
  2.     display "`var'"
  3.         count if `var'!=.
  4.         count if `var'==date_treated & `var'!=. & date_treated!=.
  5.         count if `var'==date_treated & `var'!=. & date_treated!=. & `var'_
> not_start!=.
  6.         gen `var'_start = 1 if `var'==date_treated & `var'!=. & date_treat
> ed!=. & `var'_not_start==.
  7.         replace `var'_start = 0 if `var'==date_treated & `var'!=. & date_t
> reated!=. & `var'_not_start!=.
  8.         tab `var'_start, m  //number on treatment, first drug given, and d
> rug was started
  9. }
sotrovimab
  552
  543
  7
(57,024 missing values generated)
(7 real changes made)

sotrovimab_ |
      start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7        0.01        0.01
          1 |        536        0.93        0.94
          . |     57,017       99.06      100.00
------------+-----------------------------------
      Total |     57,560      100.00
molnupiravir
  564
  555
  5
(57,010 missing values generated)
(5 real changes made)

molnupiravi |
    r_start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5        0.01        0.01
          1 |        550        0.96        0.96
          . |     57,005       99.04      100.00
------------+-----------------------------------
      Total |     57,560      100.00
paxlovid
  561
  549
  5
(57,016 missing values generated)
(5 real changes made)

paxlovid_st |
        art |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5        0.01        0.01
          1 |        544        0.95        0.95
          . |     57,011       99.05      100.00
------------+-----------------------------------
      Total |     57,560      100.00

. gen drug=7 if remdesivir==date_treated&remdesivir!=.&date_treated!=.
(56,997 missing values generated)

. replace drug=8 if casirivimab==date_treated&casirivimab!=.&date_treated!=.
(550 real changes made)

. tab drug 

       drug |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |        563       50.58       50.58
          8 |        550       49.42      100.00
------------+-----------------------------------
      Total |      1,113      100.00

. replace drug=1 if sotrovimab_start==1 
(536 real changes made)

. replace drug=2 if paxlovid_start==1
(544 real changes made)

. replace drug=3 if molnupiravir_start==1
(550 real changes made)

. replace drug=4 if sotrovimab==date_treated & sotrovimab_start==0 
(7 real changes made)

. replace drug=5 if paxlovid==date_treated & paxlovid_start==0 
(5 real changes made)

. replace drug=6 if molnupiravir==date_treated & molnupiravir_start==0 
(5 real changes made)

. replace drug=0 if control_dataset==1
(27,371 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir", re
> place

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     27,371       47.55       47.55
  sotrovimab |        275        0.48       48.03
    paxlovid |        282        0.49       48.52
molnupiravir |        290        0.50       49.02
           4 |          4        0.01       49.03
           5 |          4        0.01       49.04
           6 |          5        0.01       49.05
           7 |        282        0.49       49.54
           8 |        289        0.50       50.04
           . |     28,758       49.96      100.00
-------------+-----------------------------------
       Total |     57,560      100.00

. drop if drug>3
(29,342 observations deleted)

. 
. ** start date is date treatment for treatment arms and date of covid test for
>  control arm 
. count if start_date==. //should be 0
  0

. count if start_date!=covid_test_positive_date & drug==0  //should be 0
  27,323

. count if start_date!=date_treated & drug>0 //should be 0
  0

. 
. ** check number of positive covid tests prior to drug in treatment arms
. bys drug:count if covid_test_positive_date==. // should be 0 in control arm

-------------------------------------------------------------------------------
-> drug = control
  2,710
-------------------------------------------------------------------------------
-> drug = sotrovimab
  30
-------------------------------------------------------------------------------
-> drug = paxlovid
  34
-------------------------------------------------------------------------------
-> drug = molnupiravir
  30

. bys drug:count if covid_test_positive_date!=. 

-------------------------------------------------------------------------------
-> drug = control
  24,661
-------------------------------------------------------------------------------
-> drug = sotrovimab
  245
-------------------------------------------------------------------------------
-> drug = paxlovid
  248
-------------------------------------------------------------------------------
-> drug = molnupiravir
  260

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& date_treated>c
> ovid_test_positive_date //test prior to treatment

-------------------------------------------------------------------------------
-> drug = control
  613
-------------------------------------------------------------------------------
-> drug = sotrovimab
  113
-------------------------------------------------------------------------------
-> drug = paxlovid
  142
-------------------------------------------------------------------------------
-> drug = molnupiravir
  116

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& (date_treated-
> covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5) //test
>  <5d

-------------------------------------------------------------------------------
-> drug = control
  9
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& date_treated<
> covid_test_positive_date2 //2nd covid episode prior to treatment 

-------------------------------------------------------------------------------
-> drug = control
  67
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  19
-------------------------------------------------------------------------------
-> drug = molnupiravir
  14

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& (date_treated
> -covid_test_positive_date2>0)&(date_treated-covid_test_positive_date2<=5) //t
> est <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& date_treated<
> covid_test_positive_date3 //3rd covid episode prior to treatment 

-------------------------------------------------------------------------------
-> drug = control
  61
-------------------------------------------------------------------------------
-> drug = sotrovimab
  19
-------------------------------------------------------------------------------
-> drug = paxlovid
  12
-------------------------------------------------------------------------------
-> drug = molnupiravir
  6

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& (date_treated
> -covid_test_positive_date3>0)&(date_treated-covid_test_positive_date3<=5) //t
> est <5d

-------------------------------------------------------------------------------
-> drug = control
  2
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

. ** check in control group that covid positive, and not repeat covid test afte
> r an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days if drug==0

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,585        134 |     2,719 
         1 |    23,396      1,256 |    24,652 
-----------+----------------------+----------
     Total |    25,981      1,390 |    27,371 

. drop if drug==0 & covid_test_positive==1 & covid_positive_previous_30_days==1
(1,256 observations deleted)

. ** gen study start and study end date
. gen campaign_start=mdy(12,16,2021)

. gen study_end_date=mdy(01,08,2023)

. gen start_date_28=start_date + 28

. format campaign_start study_end_date start_date_28 %td

. 
. 
. 
. ****************************
. *       OUTCOME         *
. ****************************
. *** AESI, IMAE and some Drug reaction (need to add further IMAE and DRESS, SJ
> S, TEN) 
. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_
> snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(18,269 missing values generated)

. gen new_ae_ra_icd_prim = ae_rheumatoid_arthritis_icd_prim if rheumatoid_arthr
> itis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(18,249 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis
> _nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0
(18,305 missing values generated)

. gen new_ae_ra_ae = ae_rheumatoid_arthritis_ae if rheumatoid_arthritis_nhsd_sn
> omed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(18,279 missing values generated)

. count if rheumatoid_arthritis_nhsd_snomed!=0 | rheumatoid_arthritis_nhsd_icd1
> 0!=0
  5,206

. count if ae_rheumatoid_arthritis_icd!=. 
  10,786

. count if new_ae_ra_icd!=.
  8,693

. count if ae_rheumatoid_arthritis_icd_prim!=. 
  10,779

. count if new_ae_ra_icd_prim!=.
  8,713

. count if ae_rheumatoid_arthritis_snomed!=. 
  10,759

. count if new_ae_ra_snomed!=.
  8,657

. count if ae_rheumatoid_arthritis_ae!=. 
  10,745

. count if new_ae_ra_ae!=.
  8,683

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,212 missing values generated)

. gen new_ae_sle_icd_prim = ae_sle_icd_prim if sle_nhsd_ctv==0 & sle_nhsd_icd10
> ==0
(18,149 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,289 missing values generated)

. gen new_ae_sle_ae = ae_sle_ae if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(18,269 missing values generated)

. count if sle_nhsd_ctv!=0 | sle_nhsd_icd10!=0
  5,089

. count if ae_sle_icd!=. 
  10,788

. count if new_ae_sle_icd!=.
  8,750

. count if ae_sle_icd_prim!=. 
  10,857

. count if new_ae_sle_icd_prim!=.
  8,813

. count if ae_sle_ctv!=. 
  10,692

. count if new_ae_sle_ctv!=.
  8,673

. count if ae_sle_ae!=. 
  10,718

. count if new_ae_sle_ae!=.
  8,693

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(17,207 missing values generated)

. gen new_ae_psoriasis_ae = ae_psoriasis_ae if psoriasis_nhsd==0
(17,283 missing values generated)

. count if psoriasis_nhsd!=0 
  2,732

. count if ae_psoriasis_snomed!=. 
  10,824

. count if new_ae_psoriasis_snomed!=.
  9,755

. count if ae_psoriasis_ae!=. 
  10,786

. count if new_ae_psoriasis_ae!=.
  9,679

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_
> nhsd==0
(17,253 missing values generated)

. gen new_ae_psa_ae = ae_psoriatic_arthritis_ae if psoriatic_arthritis_nhsd==0
(17,326 missing values generated)

. count if psoriatic_arthritis_nhsd!=0 
  2,690

. count if ae_psoriatic_arthritis_snomed!=. 
  10,786

. count if new_ae_psa_snomed!=.
  9,709

. count if ae_psoriatic_arthritis_ae!=. 
  10,724

. count if new_ae_psa_ae!=.
  9,636

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondyli
> tis_nhsd==0
(17,259 missing values generated)

. gen new_ae_ankspon_ae = ae_ankylosing_spondylitis_ae if ankylosing_spondyliti
> s_nhsd==0
(17,238 missing values generated)

. count if ankylosing_spondylitis_nhsd!=0 
  2,717

. count if ae_ankylosing_spondylitis_ctv!=. 
  10,780

. count if new_ae_ankspon_ctv!=.
  9,703

. count if ae_ankylosing_spondylitis_ae!=. 
  10,790

. count if new_ae_ankspon_ae!=.
  9,724

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(17,178 missing values generated)

. gen new_ae_ibd_ae = ae_ibd_ae if ibd_ctv==0
(17,337 missing values generated)

. count if ibd_ctv!=0 
  2,700

. count if ae_ibd_snomed!=. 
  10,865

. count if new_ae_ibd_snomed!=.
  9,784

. count if ae_ibd_ae!=. 
  10,755

. count if new_ae_ibd_ae!=.
  9,625

. 
. *** comparison of ICD admission primary diagnosis and all diagnoses
. count if ae_diverticulitis_icd!=.
  10,836

. count if ae_diverticulitis_icd_prim!=.
  10,825

. count if ae_taste_icd!=.
  10,761

. count if ae_taste_icd_prim!=.
  10,679

. count if ae_anaphylaxis_icd!=.
  10,852

. count if ae_anaphylaxis_icd_prim!=.
  10,820

. 
. *** global all ae
. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed          
>                    ///
>                                                 ae_taste_snomed              
>                            

. global ae_spc_icd               ae_diverticulitis_icd_prim              ///
>                                                 ae_taste_icd_prim            
>                            

. global ae_spc_emerg             ae_diverticulitis_ae                         
>                                            

. global ae_drug                  ae_anaphylaxis_snomed                   ///  
>    
>                                                 ae_rash_snomed  

. global ae_drug_emerg    ae_anaphlaxis_ae                                ///
>                                                 ae_drugreact_ae              
>                    ///
>                                                 ae_allergic_ae               
>                                                                        

. global ae_drug_icd              ae_anaphylaxis_icd_prim

. global ae_imae                  new_ae_ra_snomed                             
>    ///
>                                                 new_ae_sle_ctv               
>                    ///
>                                                 new_ae_psoriasis_snomed      
>            ///
>                                                 new_ae_psa_snomed            
>                    ///
>                                                 new_ae_ankspon_ctv           
>                    ///
>                                                 new_ae_ibd_snomed       

. global ae_imae_icd              new_ae_ra_icd_prim                           
>    ///
>                                                 new_ae_sle_icd_prim          
>    

. global ae_imae_emerg    new_ae_ra_ae                                    ///
>                                                 new_ae_sle_ae                
>                    ///
>                                                 new_ae_psoriasis_ae          
>                    ///
>                                                 new_ae_psa_ae                
>                    ///
>                                                 new_ae_ankspon_ae            
>                    ///
>                                                 new_ae_ibd_ae                
>            

.                                                                         
. *remove event if occurred before start
. foreach x in $ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug
> _emerg $ae_imae $ae_imae_icd $ae_imae_emerg{
  2.                                 display "`x'"
  3.                                 count if (`x' > start_date | `x' < start_d
> ate + 28) & `x'!=. 
  4.                                 count if (`x' < start_date | `x' > start_d
> ate + 28) & `x'!=. & drug==0
  5.                                 count if (`x' < start_date | `x' > start_d
> ate + 28) & `x'!=. & drug>0
  6. }
ae_diverticulitis_snomed
  10,695
  9,849
  313
ae_diarrhoea_snomed
  10,871
  10,058
  301
ae_taste_snomed
  10,824
  10,019
  327
ae_diverticulitis_icd_prim
  10,825
  9,985
  312
ae_taste_icd_prim
  10,679
  9,867
  307
ae_diverticulitis_ae
  10,695
  9,866
  318
ae_anaphylaxis_snomed
  10,725
  9,840
  317
ae_rash_snomed
  10,769
  9,891
  314
ae_anaphylaxis_icd_prim
  10,820
  9,981
  320
ae_anaphlaxis_ae
  10,837
  9,964
  326
ae_drugreact_ae
  10,793
  9,935
  325
ae_allergic_ae
  10,771
  9,947
  332
new_ae_ra_snomed
  8,657
  7,992
  268
new_ae_sle_ctv
  8,673
  7,994
  259
new_ae_psoriasis_snomed
  9,755
  8,951
  280
new_ae_psa_snomed
  9,709
  8,928
  306
new_ae_ankspon_ctv
  9,703
  8,929
  291
new_ae_ibd_snomed
  9,784
  8,992
  311
new_ae_ra_icd_prim
  8,713
  8,048
  247
new_ae_sle_icd_prim
  8,813
  8,089
  275
new_ae_ra_ae
  8,683
  8,027
  235
new_ae_sle_ae
  8,693
  8,045
  233
new_ae_psoriasis_ae
  9,679
  8,934
  290
new_ae_psa_ae
  9,636
  8,887
  271
new_ae_ankspon_ae
  9,724
  8,979
  287
new_ae_ibd_ae
  9,625
  8,882
  273

. egen ae_spc_gp = rmin($ae_spc)
(5767 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(9748 missing values generated)

. egen ae_spc_emerg = rmin($ae_spc_emerg)
(16267 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg)
(1227 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(9786 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(16142 missing values generated)

. egen ae_drug_emerg = rmin($ae_drug_emerg)
(5807 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd $ae_drug_emerg)
(1304 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)
(2106 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(12275 missing values generated)

. egen ae_imae_emerg = rmin($ae_imae_emerg)
(2133 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd $ae_imae_emerg)   
(133 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $a
> e_drug_emerg $ae_imae $ae_imae_icd $ae_imae_emerg)
(2 missing values generated)

. egen ae_all_serious = rmin($ae_spc_icd $ae_spc_emerg $ae_drug_icd $ae_drug_em
> erg $ae_imae_icd $ae_imae_emerg)
(29 missing values generated)

. by drug, sort: count if ae_spc_all!=.

-------------------------------------------------------------------------------
-> drug = control
  24,921
-------------------------------------------------------------------------------
-> drug = sotrovimab
  263
-------------------------------------------------------------------------------
-> drug = paxlovid
  275
-------------------------------------------------------------------------------
-> drug = molnupiravir
  276

. by drug, sort: count if ae_drug_all!=.

-------------------------------------------------------------------------------
-> drug = control
  24,851
-------------------------------------------------------------------------------
-> drug = sotrovimab
  267
-------------------------------------------------------------------------------
-> drug = paxlovid
  265
-------------------------------------------------------------------------------
-> drug = molnupiravir
  275

. by drug, sort: count if ae_imae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  25,986
-------------------------------------------------------------------------------
-> drug = sotrovimab
  274
-------------------------------------------------------------------------------
-> drug = paxlovid
  281
-------------------------------------------------------------------------------
-> drug = molnupiravir
  288

. by drug, sort: count if ae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  26,113
-------------------------------------------------------------------------------
-> drug = sotrovimab
  275
-------------------------------------------------------------------------------
-> drug = paxlovid
  282
-------------------------------------------------------------------------------
-> drug = molnupiravir
  290

. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. * death
. bys drug: count if died_date_ons!=.

-------------------------------------------------------------------------------
-> drug = control
  15,705
-------------------------------------------------------------------------------
-> drug = sotrovimab
  167
-------------------------------------------------------------------------------
-> drug = paxlovid
  175
-------------------------------------------------------------------------------
-> drug = molnupiravir
  182

. 
. * a&e all admission
. bys drug: count if allcause_emerg_aande!=.

-------------------------------------------------------------------------------
-> drug = control
  1,298
-------------------------------------------------------------------------------
-> drug = sotrovimab
  16
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  16

. 
. *covid admission
. // checking admission and discharge date; missing admission, missing dischagr
> e, or dischagre preceed admission 
. count if covid_hosp_date!=.&covid_discharge_date==.
  2,656

. count if covid_hosp_date==.&covid_discharge_date!=.
  247

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date==covid_di
> scharge_date
  0

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date<covid_dis
> charge_date
  12

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date>covid_dis
> charge_date
  19

. // all covid hospitalisation
. bys drug: count if covid_hosp_date!=. 

-------------------------------------------------------------------------------
-> drug = control
  2,612
-------------------------------------------------------------------------------
-> drug = sotrovimab
  27
-------------------------------------------------------------------------------
-> drug = paxlovid
  23
-------------------------------------------------------------------------------
-> drug = molnupiravir
  25

. // covid admission on treatment date (control group will not have covid_hosp_
> date0)
. bys drug: count if covid_hosp_date0!=. 

-------------------------------------------------------------------------------
-> drug = control
  246
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

. //  covid admission is the same as date treated 
. bys drug: count if covid_hosp_date0==date_treated&covid_hosp_date0!=.&date_tr
> eated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==(date_treated+1) &covid_hosp_date1!=.&da
> te_treated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same  as date treated and is a daycase
. bys drug: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mab
> s!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mab
> s!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab and is a daycase or 24 hour admiss
> ion
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.
> &covid_hosp_date0==covid_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.
> &covid_hosp_date1==covid_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.
> &(covid_discharge_date0 - covid_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.
> &(covid_discharge_date1 - covid_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_ho
> sp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_ho
> sp_date1!=.  
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date AND a mab procedures 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hos
> p_date0!=.&covid_hosp_date0==covid_discharge_date0
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hos
> p_date1!=.&covid_hosp_date1==covid_discharge_date1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hos
> p_date0!=.&(covid_discharge_date0 - covid_hosp_date0)==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hos
> p_date1!=.&(covid_discharge_date1 - covid_hosp_date1)==1
(0 real changes made)

. 
. *hosp admission
. // checking admission and discharge date; missing admission, missing dischagr
> e, or dischagre preceed admission 
. count if all_hosp_date!=.&hosp_discharge_date==.
  2,451

. count if all_hosp_date==.&hosp_discharge_date!=.
  2,396

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharg
> e_date
  0

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge
> _date
  141

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge
> _date
  152

. // all hospitalisation
. bys drug: count if all_hosp_date!=.

-------------------------------------------------------------------------------
-> drug = control
  2,662
-------------------------------------------------------------------------------
-> drug = sotrovimab
  19
-------------------------------------------------------------------------------
-> drug = paxlovid
  28
-------------------------------------------------------------------------------
-> drug = molnupiravir
  35

. // admission on treatment date (control group will not have hosp_date0)
. bys drug: count if all_hosp_date0!=. 

-------------------------------------------------------------------------------
-> drug = control
  271
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2

. // admission is the same date as date treated 
. bys drug: count if all_hosp_date0==date_treated&all_hosp_date0!=.&date_treate
> d!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==(date_treated+1) &all_hosp_date1!=.&date_t
> reated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // admission is the same date as date treated and is a daycase
. bys drug: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // admission is for Covid and is the same date as date treated and is a dayca
> se
. bys drug: count if all_hosp_date0==covid_hosp_date0  & all_hosp_date0==hosp_d
> ischarge_date0&all_hosp_date0!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==hosp_di
> scharge_date1&all_hosp_date1!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!
> =.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!
> =.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all
> _hosp_date0==hosp_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all
> _hosp_date1==hosp_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(ho
> sp_discharge_date0-all_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(ho
> sp_discharge_date1-all_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is is for Covid and the same date as mab and is a daycase, 1 da
> y admission
. bys drug: count if all_hosp_date0==covid_hosp_date0 & all_hosp_date0==covid_h
> osp_date_mabs&all_hosp_date0!=.&all_hosp_date0==hosp_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==covid_h
> osp_date_mabs&all_hosp_date1!=.&all_hosp_date1==hosp_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date0==covid_hosp_date0 & all_hosp_date0==covid_h
> osp_date_mabs&all_hosp_date0!=.&(hosp_discharge_date0-all_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date1 & all_hosp_date1==covid_h
> osp_date_mabs&all_hosp_date1!=.&(hosp_discharge_date1-all_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // REPLACE - ignore covid admission if admission is for covid AND day 0 or da
> y 1 after treatment AND daycase
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =hosp_discharge_date0 & all_hosp_date0!=.
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date0=
> =hosp_discharge_date1 & all_hosp_date1!=.
(0 real changes made)

. // REPLACE - ignore admission if admission is for covid AND day 0 or day 1 af
> ter treatment AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =covid_hosp_date_mabs&all_hosp_date0!=.&all_hosp_date0==hosp_discharge_date0
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1=
> =covid_hosp_date_mabs&all_hosp_date1!=.&all_hosp_date1==hosp_discharge_date1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =covid_hosp_date_mabs&all_hosp_date0!=.&(hosp_discharge_date0 - all_hosp_date
> 0)==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1=
> =covid_hosp_date_mabs&all_hosp_date1!=.&(hosp_discharge_date1 - all_hosp_date
> 1)==1
(0 real changes made)

. 
. foreach var of varlist allcause_emerg_aande covid_hosp_date all_hosp_date die
> d_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' >= start_date & 
> `var' <= start_date + 28) & `var'!=.                          
  4.                                 bys drug: count if (`var' < start_date | `
> var' > start_date + 28) & `var'!=.                            
  5. }
allcause_emerg_aande

-------------------------------------------------------------------------------
-> drug = control
  54
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  1,244
-------------------------------------------------------------------------------
-> drug = sotrovimab
  16
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  16
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  130
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-------------------------------------------------------------------------------
-> drug = control
  2,482
-------------------------------------------------------------------------------
-> drug = sotrovimab
  26
-------------------------------------------------------------------------------
-> drug = paxlovid
  21
-------------------------------------------------------------------------------
-> drug = molnupiravir
  24
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  122
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4

-------------------------------------------------------------------------------
-> drug = control
  2,540
-------------------------------------------------------------------------------
-> drug = sotrovimab
  18
-------------------------------------------------------------------------------
-> drug = paxlovid
  27
-------------------------------------------------------------------------------
-> drug = molnupiravir
  31
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  488
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5

-------------------------------------------------------------------------------
-> drug = control
  15,217
-------------------------------------------------------------------------------
-> drug = sotrovimab
  163
-------------------------------------------------------------------------------
-> drug = paxlovid
  173
-------------------------------------------------------------------------------
-> drug = molnupiravir
  177

. 
. ****************************
. *       COVARIATES              *
. ****************************
. *Time between 1st positive covid test and treatment*
. gen pre_drug_test=3 if drug>0 & covid_test_positive_date!=. &(date_treated-co
> vid_test_positive_date>0)&(date_treated-covid_test_positive_date<21)
(26,937 missing values generated)

. replace pre_drug_test=2 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=7)
(9 real changes made)

. replace pre_drug_test=1 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5)
(9 real changes made)

. replace pre_drug_test=0 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>=0)&(date_treated-covid_test_positive_date<=3)
(9 real changes made)

. replace pre_drug_test=4 if drug>0 & (date_treated-covid_test_positive_date<0)
>  & (date_treated-covid_test_positive_date>-7)
(8 real changes made)

. replace pre_drug_test=5 if drug>0 & (covid_test_positive_date==. | (date_trea
> ted-covid_test_positive_date<=-7) | (date_treated-covid_test_positive_date>=2
> 1)) 
(813 real changes made)

. label define pre_drug_test 0 "<3 days" 1 "3-5 days"  2 "5-7 days" 3 ">7 days 
> & <21 days" 4 "treatment proceeds test <7 days" 5 "no test", replace 

. label values pre_drug_test pre_drug_test

. tab pre_drug_test drug,m

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
              <3 days |         0          2          5          2 |         9 
             3-5 days |         0          1          0          0 |         1 
   >7 days & <21 days |         0          1         10          5 |        16 
treatment proceeds te |         0          2          3          3 |         8 
              no test |         0        269        264        280 |       813 
                    . |    26,115          0          0          0 |    26,115 
----------------------+--------------------------------------------+----------
                Total |    26,115        275        282        290 |    26,962 

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     26,962    48.95182     18.9727         18        109

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) 
> label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |      9,704       35.99       35.99
      40-59 |      9,151       33.94       69.93
       >=60 |      8,107       30.07      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      2,857       10.60       10.60
        25- |      2,366        8.78       19.37
        30- |      2,253        8.36       27.73
        35- |      2,228        8.26       35.99
        40- |      2,065        7.66       43.65
        45- |      2,380        8.83       52.48
        50- |      2,435        9.03       61.51
        55- |      2,271        8.42       69.93
        60- |      1,800        6.68       76.61
        65- |      1,730        6.42       83.02
        70- |      1,659        6.15       89.18
        75- |      1,175        4.36       93.54
        80- |        922        3.42       96.95
        85- |        821        3.05      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Sex
. gen male = 1 if sex == "M"
(13,814 missing values generated)

. replace male = 0 if sex == "F"
(13,814 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(13,814 missing values generated)

. replace sex=1 if sex_str=="F"
(13,814 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. tab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |     13,148       48.76       48.76
     Female |     13,814       51.24      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     16,211       60.13       60.13
      Black |      1,044        3.87       64.00
      Mixed |      1,082        4.01       68.01
      Other |      1,111        4.12       72.13
South Asian |      1,067        3.96       76.09
      White |      6,447       23.91      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. replace ethnicity=. if ethnicity==2 
(1,082 real changes made, 1,082 to missing)

. tab ethnicity                           

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      Black |      1,044       10.80       10.80
      Other |      1,111       11.49       22.29
South Asian |      1,067       11.04       33.32
      White |      6,447       66.68      100.00
------------+-----------------------------------
      Total |      9,669      100.00

. gen ethnicity_with_missing=ethnicity
(17,293 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(17,293 real changes made)

. tab ethnicity_with_missing

ethnicity_w |
ith_missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,044        3.87        3.87
          3 |      1,111        4.12        7.99
          4 |      1,067        3.96       11.95
          5 |      6,447       23.91       35.86
          9 |     17,293       64.14      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. gen White=1 if ethnicity==6
(26,962 missing values generated)

. replace White=0 if ethnicity!=6&ethnicity!=.
(9,669 real changes made)

. tab White

      White |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,669      100.00      100.00
------------+-----------------------------------
      Total |      9,669      100.00

. gen White_with_missing=White
(17,293 missing values generated)

. replace White_with_missing=9 if White==.
(17,293 real changes made)

. tab White_with_missing

White_with_ |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,669       35.86       35.86
          9 |     17,293       64.14      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * IMD
. tab imdq5,m

             imdQ5 |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |      5,505       20.42       20.42
                 2 |      5,432       20.15       40.56
                 3 |      5,304       19.67       60.24
                 4 |      5,283       19.59       79.83
5 (least deprived) |      5,141       19.07       98.90
           Unknown |        297        1.10      100.00
-------------------+-----------------------------------
             Total |     26,962      100.00

. replace imdq5="." if imdq5=="Unknown" 
(297 real changes made)

. replace imdq5="1" if imdq5=="1 (most deprived)" 
(5,505 real changes made)

. replace imdq5="5" if imdq5=="5 (least deprived)" 
(5,141 real changes made)

. destring imdq5, replace
imdq5: all characters numeric; replaced as byte
(297 missing values generated)

. recode imdq5 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so 5 is more
>  deprived)
(imdq5: 21361 changes made)

. label define imdq5 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived"
> , replace

. label values imdq5 imdq5

. gen imd_with_missing=imdq5
(297 missing values generated)

. replace imd_with_missing=9 if imdq5==.
(297 real changes made)

. tab imdq5,m

           imdQ5 |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,141       19.07       19.07
               2 |      5,283       19.59       38.66
               3 |      5,304       19.67       58.33
               4 |      5,432       20.15       78.48
 5 most deprived |      5,505       20.42       98.90
               . |        297        1.10      100.00
-----------------+-----------------------------------
           Total |     26,962      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,675        9.92        9.92
           East Midlands |      2,653        9.84       19.76
                  London |      5,374       19.93       39.69
              North East |      2,721       10.09       49.78
              North West |      2,677        9.93       59.71
              South East |      2,741       10.17       69.88
              South West |      2,728       10.12       80.00
           West Midlands |      2,656        9.85       89.85
Yorkshire and The Humber |      2,737       10.15      100.00
-------------------------+-----------------------------------
                   Total |     26,962      100.00

. tab drug region_nhs

             |                 region_nhs
        drug |      East  East Mi..     London  North E.. |     Total
-------------+--------------------------------------------+----------
     control |     2,596      2,553      5,208      2,653 |    26,115 
  sotrovimab |        23         37         49         21 |       275 
    paxlovid |        27         24         51         30 |       282 
molnupiravir |        29         39         66         17 |       290 
-------------+--------------------------------------------+----------
       Total |     2,675      2,653      5,374      2,721 |    26,962 


             |                 region_nhs
        drug | North W..  South E..  South W..  West Mi.. |     Total
-------------+--------------------------------------------+----------
     control |     2,600      2,645      2,651      2,549 |    26,115 
  sotrovimab |        23         40         25         32 |       275 
    paxlovid |        25         33         20         42 |       282 
molnupiravir |        29         23         32         33 |       290 
-------------+--------------------------------------------+----------
       Total |     2,677      2,741      2,728      2,656 |    26,962 


             | region_nhs
        drug | Yorkshi.. |     Total
-------------+-----------+----------
     control |     2,660 |    26,115 
  sotrovimab |        25 |       275 
    paxlovid |        30 |       282 
molnupiravir |        22 |       290 
-------------+-----------+----------
       Total |     2,737 |    26,962 

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,681        9.94        9.94
           East Midlands |      2,644        9.81       19.75
                  London |      5,357       19.87       39.62
              North East |      2,670        9.90       49.52
              North West |      2,700       10.01       59.54
              South East |      2,835       10.51       70.05
              South West |      2,691        9.98       80.03
           West Midlands |      2,707       10.04       90.07
Yorkshire and The Humber |      2,677        9.93      100.00
-------------------------+-----------------------------------
                   Total |     26,962      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,665        9.88        9.88
      STP10 |      2,643        9.80       19.69
       STP2 |      2,734       10.14       29.83
       STP3 |      2,697       10.00       39.83
       STP4 |      2,700       10.01       49.84
       STP5 |      2,685        9.96       59.80
       STP6 |      2,694        9.99       69.79
       STP7 |      2,742       10.17       79.96
       STP8 |      2,704       10.03       89.99
       STP9 |      2,698       10.01      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Oth
> er"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,665        9.88        9.88
      STP10 |      2,643        9.80       19.69
       STP2 |      2,734       10.14       29.83
       STP3 |      2,697       10.00       39.83
       STP4 |      2,700       10.01       49.84
       STP5 |      2,685        9.96       59.80
       STP6 |      2,694        9.99       69.79
       STP7 |      2,742       10.17       79.96
       STP8 |      2,704       10.03       89.99
       STP9 |      2,698       10.01      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
         bmi |  26.58542  21.53774  27.46134  33.05623 -5.517342  57.40528
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(1,650 real changes made, 1,650 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*1
> 0 & (age+((bmi_date_measured-start_date)/365)>=18)
(26,962 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(26,962 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(26,962 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(1,650 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(1,650 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(1,650 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(1,650 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(1,650 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,275       90.03       90.03
          1 |      2,687        9.97      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,220       89.83       89.83
          1 |      2,742       10.17      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,241       89.91       89.91
          1 |      2,721       10.09      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,226       89.85       89.85
          1 |      2,736       10.15      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      2,648        9.82        9.82
          One vaccination |      2,747       10.19       20.01
       Three vaccinations |     13,508       50.10       70.11
         Two vaccinations |      2,634        9.77       79.88
            Un-vaccinated |      2,718       10.08       89.96
 Un-vaccinated (declined) |      2,707       10.04      100.00
--------------------------+-----------------------------------
                    Total |     26,962      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination
> _status_g=="Un-vaccinated (declined)"
(21,537 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(2,747 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(2,634 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(13,508 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinati
> ons"
(2,648 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two 
> vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(10,806 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(10,806 real changes made)

. * time between vaccine and covid positive test or treatment
. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date if (covi
> d_test_positive_date>last_vaccination_date & drug==0)
(10,429 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%            9              1
 5%           46              1
10%           88              1       Obs              16,533
25%          213              1       Sum of Wgt.      16,533

50%          422                      Mean           440.7111
                        Largest       Std. Dev.      270.9655
75%          638           1126
90%          826           1126       Variance       73422.31
95%          919           1126       Skewness        .303917
99%         1043           1129       Kurtosis       2.184535

. gen days_vacc_treat=date_treated - last_vaccination_date if (date_treated>las
> t_vaccination_date & drug>0)
(26,381 missing values generated)

. sum days_vacc_treat,de

                       days_vacc_treat
-------------------------------------------------------------
      Percentiles      Smallest
 1%           10              2
 5%           36              3
10%           70              7       Obs                 581
25%          186              8       Sum of Wgt.         581

50%          421                      Mean           435.8158
                        Largest       Std. Dev.      276.9805
75%          654           1069
90%          816           1075       Variance        76718.2
95%          899           1099       Skewness        .239868
99%         1054           1123       Kurtosis       2.063644

. gen days_vacc_treat_test = days_vacc_covid if drug==0
(10,429 missing values generated)

. replace days_vacc_treat_test = days_vacc_treat if drug>0
(581 real changes made)

. sum days_vacc_treat_test,de

                    days_vacc_treat_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%            9              1
 5%           45              1
10%           87              1       Obs              17,114
25%          212              1       Sum of Wgt.      17,114

50%          422                      Mean           440.5449
                        Largest       Std. Dev.      271.1651
75%          639           1126
90%          826           1126       Variance       73530.51
95%          919           1126       Skewness       .3015307
99%         1043           1129       Kurtosis       2.180349

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(10,429 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        553        2.05        2.05
          2 |        542        2.01        4.06
          3 |        600        2.23        6.29
          4 |        593        2.20        8.49
          5 |        588        2.18       10.67
          6 |        611        2.27       12.93
          7 |        592        2.20       15.13
          8 |        609        2.26       17.39
          9 |        581        2.15       19.54
         10 |        612        2.27       21.81
         11 |        575        2.13       23.94
         12 |        555        2.06       26.00
         13 |        635        2.36       28.36
         14 |        583        2.16       30.52
         15 |        592        2.20       32.72
         16 |        573        2.13       34.84
         17 |        568        2.11       36.95
         18 |        606        2.25       39.20
         19 |        612        2.27       41.47
         20 |        543        2.01       43.48
         21 |        542        2.01       45.49
         22 |        470        1.74       47.23
         23 |        429        1.59       48.82
         24 |        441        1.64       50.46
         25 |        387        1.44       51.90
         26 |        417        1.55       53.44
         27 |        316        1.17       54.61
         28 |        306        1.13       55.75
         29 |        281        1.04       56.79
         30 |        255        0.95       57.74
         31 |        226        0.84       58.58
         32 |        195        0.72       59.30
         33 |        156        0.58       59.88
         34 |        135        0.50       60.38
         35 |        106        0.39       60.77
         36 |         78        0.29       61.06
         37 |         53        0.20       61.26
         38 |         17        0.06       61.32
          . |     10,429       38.68      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             -3
 5%           26             -3
10%           56             -3       Obs              26,962
25%          143             -3       Sum of Wgt.      26,962

50%          290                      Mean           290.4837
                        Largest       Std. Dev.       170.353
75%          438            586
90%          528            586       Variance       29020.15
95%          555            586       Skewness       .0073715
99%          580            586       Kurtosis       1.792988

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        211        0.78        0.78
          1 |      1,358        5.04        5.82
          2 |      1,356        5.03       10.85
          3 |      1,396        5.18       16.03
          4 |      1,388        5.15       21.17
          5 |      1,391        5.16       26.33
          6 |      1,434        5.32       31.65
          7 |      1,350        5.01       36.66
          8 |      1,358        5.04       41.70
          9 |      1,341        4.97       46.67
         10 |      1,370        5.08       51.75
         11 |      1,408        5.22       56.97
         12 |      1,323        4.91       61.88
         13 |      1,377        5.11       66.99
         14 |      1,305        4.84       71.83
         15 |      1,394        5.17       77.00
         16 |      1,363        5.06       82.05
         17 |      1,343        4.98       87.03
         18 |      1,477        5.48       92.51
         19 |      1,339        4.97       97.48
         20 |        680        2.52      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab start_date if month_after_campaign>100
no observations

. //drop if month_after_campaign>100
. * Variant
. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. * Prior infection / check Bang code
. tab prior_covid, m

prior_covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,898       70.09       70.09
          1 |      8,064       29.91      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. gen prior_covid_index=1 if prior_covid==1 & prior_covid_date<campaign_start
(26,911 missing values generated)

. tab prior_covid_index,m

prior_covid |
     _index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         51        0.19        0.19
          . |     26,911       99.81      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. replace prior_covid_index=0 if prior_covid_index==.
(26,911 real changes made)

. *Contraindications for Pax*
. tab drug if organ_transplant==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      8,178       96.69       96.69
  sotrovimab |        105        1.24       97.93
    paxlovid |         80        0.95       98.88
molnupiravir |         95        1.12      100.00
-------------+-----------------------------------
       Total |      8,458      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,647       96.50       96.50
  sotrovimab |         34        1.24       97.74
    paxlovid |         33        1.20       98.94
molnupiravir |         29        1.06      100.00
-------------+-----------------------------------
       Total |      2,743      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      9,153       96.85       96.85
  sotrovimab |         99        1.05       97.89
    paxlovid |         91        0.96       98.86
molnupiravir |        108        1.14      100.00
-------------+-----------------------------------
       Total |      9,451      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vacci
> ne-breakthrough/blob/updates-feb/analysis/data_process.R*
. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
creat~e_ctv3 |  57.00538  48.06602  59.06091  69.41504 -7.423844  122.2147
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_c
> tv3_date>start_date
(13,406 real changes made, 13,406 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.18135  50.12827  60.03422  69.91559  20.05574  114.8595
--------------------------------------------------------------------------

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(13,556 real changes made)

. gen min_creatinine_ctv3=.
(26,962 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(6,961 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(6,595 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(3,772 real changes made)

. gen max_creatinine_ctv3=.
(26,962 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(6,961 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(6,595 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(23,190 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993
> ^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(13,587 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(6,862 real changes made)

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
cre~e_snomed |  22.59454         0         0  45.07763 -36.83941  118.3562
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(20,530 real changes made, 20,530 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(crea
> tinine_snomed)
(13,811 real changes made, 3,566 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if miss
> ing(creatinine_snomed)
(11,378 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creati
> nine_snomed)
(20,298 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_sno
> med)
(20,530 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(16,044 real changes made, 16,044 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(10,918 real changes made)

. gen min_creatinine_snomed=.
(26,962 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(5,635 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(5,283 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(1,535 real changes made)

. gen max_creatinine_snomed=.
(26,962 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(5,635 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(5,283 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(25,427 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*
> (0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snome
> d<=120
(16,162 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(5,573 real changes made)

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<60&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(23,472 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<30&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(26,168 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      3,366       96.45       96.45
  sotrovimab |         35        1.00       97.45
    paxlovid |         44        1.26       98.71
molnupiravir |         45        1.29      100.00
-------------+-----------------------------------
       Total |      3,490      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        766       96.47       96.47
  sotrovimab |         10        1.26       97.73
    paxlovid |          6        0.76       98.49
molnupiravir |         12        1.51      100.00
-------------+-----------------------------------
       Total |        794      100.00

. *drug interactions*
. tab drug if drugs_paxlovid_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        692       96.78       96.78
  sotrovimab |          7        0.98       97.76
    paxlovid |          7        0.98       98.74
molnupiravir |          9        1.26      100.00
-------------+-----------------------------------
       Total |        715      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        692       96.78       96.78
  sotrovimab |          7        0.98       97.76
    paxlovid |          7        0.98       98.74
molnupiravir |          9        1.26      100.00
-------------+-----------------------------------
       Total |        715      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        568       96.11       96.11
  sotrovimab |          7        1.18       97.29
    paxlovid |          7        1.18       98.48
molnupiravir |          9        1.52      100.00
-------------+-----------------------------------
       Total |        591      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        344       96.63       96.63
  sotrovimab |          4        1.12       97.75
    paxlovid |          4        1.12       98.88
molnupiravir |          4        1.12      100.00
-------------+-----------------------------------
       Total |        356      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        688       95.96       95.96
  sotrovimab |         10        1.39       97.35
    paxlovid |          6        0.84       98.19
molnupiravir |         13        1.81      100.00
-------------+-----------------------------------
       Total |        717      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        688       95.96       95.96
  sotrovimab |         10        1.39       97.35
    paxlovid |          6        0.84       98.19
molnupiravir |         13        1.81      100.00
-------------+-----------------------------------
       Total |        717      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        547       95.30       95.30
  sotrovimab |         10        1.74       97.04
    paxlovid |          4        0.70       97.74
molnupiravir |         13        2.26      100.00
-------------+-----------------------------------
       Total |        574      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        328       95.35       95.35
  sotrovimab |          5        1.45       96.80
    paxlovid |          1        0.29       97.09
molnupiravir |         10        2.91      100.00
-------------+-----------------------------------
       Total |        344      100.00

. gen paxlovid_interaction=(drugs_paxlovid_interaction<=start_date&drugs_paxlov
> id_interaction>=(start_date-180))  

. gen nirmatrelvir_interaction=(drugs_nirmatrelvir_interaction<=start_date&drug
> s_nirmatrelvir_interaction>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contraindicated = 1 if egfr_30==1 | dialysis==1
(23,493 missing values generated)

. replace paxlovid_contraindicated = 1 if liver_disease==1 
(4,487 real changes made)

. replace paxlovid_contraindicated = 1 if organ_transplant==1 
(5,943 real changes made)

. replace paxlovid_contraindicated = 1 if drugs_paxlovid_interaction<=start_dat
> e&drugs_paxlovid_interaction>=(start_date-180)
(184 real changes made)

. recode paxlovid_contraindicated . = 0
(paxlovid_contraindicated: 12879 changes made)

. by drug, sort: count if paxlovid_contraindicated==1

-------------------------------------------------------------------------------
-> drug = control
  13,627
-------------------------------------------------------------------------------
-> drug = sotrovimab
  165
-------------------------------------------------------------------------------
-> drug = paxlovid
  138
-------------------------------------------------------------------------------
-> drug = molnupiravir
  153

. 
. ****************************
. *       COX MODEL               *
. ****************************
. global ae               ae_spc_all                              ///
>                                 ae_drug_all                             ///  
>            
>                                 ae_imae_all                     ///          
>                    
>                                 ae_all                                  ///
>                                 allcause_emerg_aande    ///
>                                 covid_hosp_date                 ///
>                                 all_hosp_date                   ///
>                                 died_date_ons

. * Generate failure 
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         by drug, sort: count if `x'!=.
  4.         by drug, sort: count if `x'>=start_date & `x'!=.
  5.         by drug, sort: count if `x'>=start_date & `x'<start_date_28 &`x'!=
> .
  6.         gen fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, paxl
> ovid, molnupiravir)) if drug==1
  7.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, 
> sotrovimab, molnupiravir)) if drug==2
  8.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, 
> sotrovimab, paxlovid)) if drug==3
  9.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_28, 
> sotrovimab, paxlovid, molnupiravir)) if drug==0
 10.         tab drug fail_`x', m
 11. }
ae_spc_all

-------------------------------------------------------------------------------
-> drug = control
  24,921
-------------------------------------------------------------------------------
-> drug = sotrovimab
  263
-------------------------------------------------------------------------------
-> drug = paxlovid
  275
-------------------------------------------------------------------------------
-> drug = molnupiravir
  276

-------------------------------------------------------------------------------
-> drug = control
  8,135
-------------------------------------------------------------------------------
-> drug = sotrovimab
  91
-------------------------------------------------------------------------------
-> drug = paxlovid
  84
-------------------------------------------------------------------------------
-> drug = molnupiravir
  90

-------------------------------------------------------------------------------
-> drug = control
  1,130
-------------------------------------------------------------------------------
-> drug = sotrovimab
  22
-------------------------------------------------------------------------------
-> drug = paxlovid
  12
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     8,983     17,132 |    26,115 
  sotrovimab |        89        186 |       275 
    paxlovid |        88        194 |       282 
molnupiravir |        99        191 |       290 
-------------+----------------------+----------
       Total |     9,259     17,703 |    26,962 
ae_drug_all

-------------------------------------------------------------------------------
-> drug = control
  24,851
-------------------------------------------------------------------------------
-> drug = sotrovimab
  267
-------------------------------------------------------------------------------
-> drug = paxlovid
  265
-------------------------------------------------------------------------------
-> drug = molnupiravir
  275

-------------------------------------------------------------------------------
-> drug = control
  7,988
-------------------------------------------------------------------------------
-> drug = sotrovimab
  83
-------------------------------------------------------------------------------
-> drug = paxlovid
  74
-------------------------------------------------------------------------------
-> drug = molnupiravir
  99

-------------------------------------------------------------------------------
-> drug = control
  1,154
-------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-------------------------------------------------------------------------------
-> drug = paxlovid
  12
-------------------------------------------------------------------------------
-> drug = molnupiravir
  13
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |   fail_ae_drug_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     8,881     17,234 |    26,115 
  sotrovimab |        87        188 |       275 
    paxlovid |        81        201 |       282 
molnupiravir |       111        179 |       290 
-------------+----------------------+----------
       Total |     9,160     17,802 |    26,962 
ae_imae_all

-------------------------------------------------------------------------------
-> drug = control
  25,986
-------------------------------------------------------------------------------
-> drug = sotrovimab
  274
-------------------------------------------------------------------------------
-> drug = paxlovid
  281
-------------------------------------------------------------------------------
-> drug = molnupiravir
  288

-------------------------------------------------------------------------------
-> drug = control
  5,317
-------------------------------------------------------------------------------
-> drug = sotrovimab
  57
-------------------------------------------------------------------------------
-> drug = paxlovid
  46
-------------------------------------------------------------------------------
-> drug = molnupiravir
  62

-------------------------------------------------------------------------------
-> drug = control
  1,135
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  14
-------------------------------------------------------------------------------
-> drug = molnupiravir
  16
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     4,565     21,550 |    26,115 
  sotrovimab |        47        228 |       275 
    paxlovid |        33        249 |       282 
molnupiravir |        48        242 |       290 
-------------+----------------------+----------
       Total |     4,693     22,269 |    26,962 
ae_all

-------------------------------------------------------------------------------
-> drug = control
  26,113
-------------------------------------------------------------------------------
-> drug = sotrovimab
  275
-------------------------------------------------------------------------------
-> drug = paxlovid
  282
-------------------------------------------------------------------------------
-> drug = molnupiravir
  290

-------------------------------------------------------------------------------
-> drug = control
  2,899
-------------------------------------------------------------------------------
-> drug = sotrovimab
  24
-------------------------------------------------------------------------------
-> drug = paxlovid
  28
-------------------------------------------------------------------------------
-> drug = molnupiravir
  35

-------------------------------------------------------------------------------
-> drug = control
  1,046
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  14
-------------------------------------------------------------------------------
-> drug = molnupiravir
  15
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     1,887     24,228 |    26,115 
  sotrovimab |        14        261 |       275 
    paxlovid |        14        268 |       282 
molnupiravir |        18        272 |       290 
-------------+----------------------+----------
       Total |     1,933     25,029 |    26,962 
allcause_emerg_aande

-------------------------------------------------------------------------------
-> drug = control
  1,298
-------------------------------------------------------------------------------
-> drug = sotrovimab
  16
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  16

-------------------------------------------------------------------------------
-> drug = control
  721
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  1
-------------------------------------------------------------------------------
-> drug = molnupiravir
  9

-------------------------------------------------------------------------------
-> drug = control
  54
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_allcause_emerg_a
             |         ande
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,588        527 |    26,115 
  sotrovimab |       269          6 |       275 
    paxlovid |       279          3 |       282 
molnupiravir |       284          6 |       290 
-------------+----------------------+----------
       Total |    26,420        542 |    26,962 
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  2,612
-------------------------------------------------------------------------------
-> drug = sotrovimab
  27
-------------------------------------------------------------------------------
-> drug = paxlovid
  23
-------------------------------------------------------------------------------
-> drug = molnupiravir
  25

-------------------------------------------------------------------------------
-> drug = control
  1,432
-------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-------------------------------------------------------------------------------
-> drug = paxlovid
  13
-------------------------------------------------------------------------------
-> drug = molnupiravir
  17

-------------------------------------------------------------------------------
-> drug = control
  125
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_covid_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,018      1,097 |    26,115 
  sotrovimab |       261         14 |       275 
    paxlovid |       272         10 |       282 
molnupiravir |       281          9 |       290 
-------------+----------------------+----------
       Total |    25,832      1,130 |    26,962 
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  2,662
-------------------------------------------------------------------------------
-> drug = sotrovimab
  19
-------------------------------------------------------------------------------
-> drug = paxlovid
  28
-------------------------------------------------------------------------------
-> drug = molnupiravir
  35

-------------------------------------------------------------------------------
-> drug = control
  1,487
-------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-------------------------------------------------------------------------------
-> drug = paxlovid
  19
-------------------------------------------------------------------------------
-> drug = molnupiravir
  23

-------------------------------------------------------------------------------
-> drug = control
  121
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_all_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,011      1,104 |    26,115 
  sotrovimab |       265         10 |       275 
    paxlovid |       273          9 |       282 
molnupiravir |       275         15 |       290 
-------------+----------------------+----------
       Total |    25,824      1,138 |    26,962 
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  15,705
-------------------------------------------------------------------------------
-> drug = sotrovimab
  167
-------------------------------------------------------------------------------
-> drug = paxlovid
  175
-------------------------------------------------------------------------------
-> drug = molnupiravir
  182

-------------------------------------------------------------------------------
-> drug = control
  4,960
-------------------------------------------------------------------------------
-> drug = sotrovimab
  59
-------------------------------------------------------------------------------
-> drug = paxlovid
  51
-------------------------------------------------------------------------------
-> drug = molnupiravir
  62

-------------------------------------------------------------------------------
-> drug = control
  472
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_died_date_ons
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    15,677     10,438 |    26,115 
  sotrovimab |       167        108 |       275 
    paxlovid |       164        118 |       282 
molnupiravir |       173        117 |       290 
-------------+----------------------+----------
       Total |    16,181     10,781 |    26,962 
ae_diverticulitis_snomed

-------------------------------------------------------------------------------
-> drug = control
  10,360
-------------------------------------------------------------------------------
-> drug = sotrovimab
  121
-------------------------------------------------------------------------------
-> drug = paxlovid
  104
-------------------------------------------------------------------------------
-> drug = molnupiravir
  110

-------------------------------------------------------------------------------
-> drug = control
  5,253
-------------------------------------------------------------------------------
-> drug = sotrovimab
  64
-------------------------------------------------------------------------------
-> drug = paxlovid
  57
-------------------------------------------------------------------------------
-> drug = molnupiravir
  53

-------------------------------------------------------------------------------
-> drug = control
  491
-------------------------------------------------------------------------------
-> drug = sotrovimab
  14
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,339      4,776 |    26,115 
  sotrovimab |       217         58 |       275 
    paxlovid |       243         39 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    22,036      4,926 |    26,962 
ae_diarrhoea_snomed

-------------------------------------------------------------------------------
-> drug = control
  10,548
-------------------------------------------------------------------------------
-> drug = sotrovimab
  99
-------------------------------------------------------------------------------
-> drug = paxlovid
  116
-------------------------------------------------------------------------------
-> drug = molnupiravir
  108

-------------------------------------------------------------------------------
-> drug = control
  5,347
-------------------------------------------------------------------------------
-> drug = sotrovimab
  56
-------------------------------------------------------------------------------
-> drug = paxlovid
  54
-------------------------------------------------------------------------------
-> drug = molnupiravir
  54

-------------------------------------------------------------------------------
-> drug = control
  479
-------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  6
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,240      4,875 |    26,115 
  sotrovimab |       229         46 |       275 
    paxlovid |       222         60 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    21,928      5,034 |    26,962 
ae_taste_snomed

-------------------------------------------------------------------------------
-> drug = control
  10,480
-------------------------------------------------------------------------------
-> drug = sotrovimab
  112
-------------------------------------------------------------------------------
-> drug = paxlovid
  115
-------------------------------------------------------------------------------
-> drug = molnupiravir
  117

-------------------------------------------------------------------------------
-> drug = control
  5,288
-------------------------------------------------------------------------------
-> drug = sotrovimab
  56
-------------------------------------------------------------------------------
-> drug = paxlovid
  60
-------------------------------------------------------------------------------
-> drug = molnupiravir
  56

-------------------------------------------------------------------------------
-> drug = control
  447
-------------------------------------------------------------------------------
-> drug = sotrovimab
  5
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,263      4,852 |    26,115 
  sotrovimab |       219         56 |       275 
    paxlovid |       230         52 |       282 
molnupiravir |       232         58 |       290 
-------------+----------------------+----------
       Total |    21,944      5,018 |    26,962 
ae_diverticulitis_icd_prim

-------------------------------------------------------------------------------
-> drug = control
  10,490
-------------------------------------------------------------------------------
-> drug = sotrovimab
  108
-------------------------------------------------------------------------------
-> drug = paxlovid
  119
-------------------------------------------------------------------------------
-> drug = molnupiravir
  108

-------------------------------------------------------------------------------
-> drug = control
  5,411
-------------------------------------------------------------------------------
-> drug = sotrovimab
  66
-------------------------------------------------------------------------------
-> drug = paxlovid
  60
-------------------------------------------------------------------------------
-> drug = molnupiravir
  52

-------------------------------------------------------------------------------
-> drug = control
  489
-------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diverticuliti
             |      s_icd_prim
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,346      4,769 |    26,115 
  sotrovimab |       230         45 |       275 
    paxlovid |       227         55 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    22,043      4,919 |    26,962 
ae_taste_icd_prim

-------------------------------------------------------------------------------
-> drug = control
  10,347
-------------------------------------------------------------------------------
-> drug = sotrovimab
  106
-------------------------------------------------------------------------------
-> drug = paxlovid
  110
-------------------------------------------------------------------------------
-> drug = molnupiravir
  116

-------------------------------------------------------------------------------
-> drug = control
  5,192
-------------------------------------------------------------------------------
-> drug = sotrovimab
  54
-------------------------------------------------------------------------------
-> drug = paxlovid
  56
-------------------------------------------------------------------------------
-> drug = molnupiravir
  75

-------------------------------------------------------------------------------
-> drug = control
  469
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  12
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_taste_icd_pri
             |           m
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,299      4,816 |    26,115 
  sotrovimab |       232         43 |       275 
    paxlovid |       230         52 |       282 
molnupiravir |       249         41 |       290 
-------------+----------------------+----------
       Total |    22,010      4,952 |    26,962 
ae_diverticulitis_ae

-------------------------------------------------------------------------------
-> drug = control
  10,362
-------------------------------------------------------------------------------
-> drug = sotrovimab
  103
-------------------------------------------------------------------------------
-> drug = paxlovid
  117
-------------------------------------------------------------------------------
-> drug = molnupiravir
  113

-------------------------------------------------------------------------------
-> drug = control
  5,282
-------------------------------------------------------------------------------
-> drug = sotrovimab
  50
-------------------------------------------------------------------------------
-> drug = paxlovid
  55
-------------------------------------------------------------------------------
-> drug = molnupiravir
  51

-------------------------------------------------------------------------------
-> drug = control
  479
-------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_diverticuliti
             |         s_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,354      4,761 |    26,115 
  sotrovimab |       226         49 |       275 
    paxlovid |       221         61 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    22,041      4,921 |    26,962 
ae_anaphylaxis_snomed

-------------------------------------------------------------------------------
-> drug = control
  10,394
-------------------------------------------------------------------------------
-> drug = sotrovimab
  115
-------------------------------------------------------------------------------
-> drug = paxlovid
  118
-------------------------------------------------------------------------------
-> drug = molnupiravir
  98

-------------------------------------------------------------------------------
-> drug = control
  5,300
-------------------------------------------------------------------------------
-> drug = sotrovimab
  60
-------------------------------------------------------------------------------
-> drug = paxlovid
  62
-------------------------------------------------------------------------------
-> drug = molnupiravir
  52

-------------------------------------------------------------------------------
-> drug = control
  536
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-------------------------------------------------------------------------------
-> drug = paxlovid
  9
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,289      4,826 |    26,115 
  sotrovimab |       224         51 |       275 
    paxlovid |       223         59 |       282 
molnupiravir |       250         40 |       290 
-------------+----------------------+----------
       Total |    21,986      4,976 |    26,962 
ae_rash_snomed

-------------------------------------------------------------------------------
-> drug = control
  10,438
-------------------------------------------------------------------------------
-> drug = sotrovimab
  116
-------------------------------------------------------------------------------
-> drug = paxlovid
  105
-------------------------------------------------------------------------------
-> drug = molnupiravir
  110

-------------------------------------------------------------------------------
-> drug = control
  5,321
-------------------------------------------------------------------------------
-> drug = sotrovimab
  63
-------------------------------------------------------------------------------
-> drug = paxlovid
  48
-------------------------------------------------------------------------------
-> drug = molnupiravir
  61

-------------------------------------------------------------------------------
-> drug = control
  527
-------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_ae_rash_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,277      4,838 |    26,115 
  sotrovimab |       224         51 |       275 
    paxlovid |       228         54 |       282 
molnupiravir |       242         48 |       290 
-------------+----------------------+----------
       Total |    21,971      4,991 |    26,962 
ae_anaphylaxis_icd_prim

-------------------------------------------------------------------------------
-> drug = control
  10,482
-------------------------------------------------------------------------------
-> drug = sotrovimab
  111
-------------------------------------------------------------------------------
-> drug = paxlovid
  115
-------------------------------------------------------------------------------
-> drug = molnupiravir
  112

-------------------------------------------------------------------------------
-> drug = control
  5,331
-------------------------------------------------------------------------------
-> drug = sotrovimab
  50
-------------------------------------------------------------------------------
-> drug = paxlovid
  52
-------------------------------------------------------------------------------
-> drug = molnupiravir
  57

-------------------------------------------------------------------------------
-> drug = control
  480
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  6
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_anaphylaxis_i
             |        cd_prim
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,262      4,853 |    26,115 
  sotrovimab |       215         60 |       275 
    paxlovid |       219         63 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    21,933      5,029 |    26,962 
ae_anaphlaxis_ae

-------------------------------------------------------------------------------
-> drug = control
  10,492
-------------------------------------------------------------------------------
-> drug = sotrovimab
  113
-------------------------------------------------------------------------------
-> drug = paxlovid
  114
-------------------------------------------------------------------------------
-> drug = molnupiravir
  118

-------------------------------------------------------------------------------
-> drug = control
  5,386
-------------------------------------------------------------------------------
-> drug = sotrovimab
  48
-------------------------------------------------------------------------------
-> drug = paxlovid
  60
-------------------------------------------------------------------------------
-> drug = molnupiravir
  66

-------------------------------------------------------------------------------
-> drug = control
  509
-------------------------------------------------------------------------------
-> drug = sotrovimab
  5
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_anaphlaxis_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,274      4,841 |    26,115 
  sotrovimab |       213         62 |       275 
    paxlovid |       229         53 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    21,956      5,006 |    26,962 
ae_drugreact_ae

-------------------------------------------------------------------------------
-> drug = control
  10,450
-------------------------------------------------------------------------------
-> drug = sotrovimab
  111
-------------------------------------------------------------------------------
-> drug = paxlovid
  107
-------------------------------------------------------------------------------
-> drug = molnupiravir
  125

-------------------------------------------------------------------------------
-> drug = control
  5,309
-------------------------------------------------------------------------------
-> drug = sotrovimab
  59
-------------------------------------------------------------------------------
-> drug = paxlovid
  58
-------------------------------------------------------------------------------
-> drug = molnupiravir
  59

-------------------------------------------------------------------------------
-> drug = control
  498
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_ae_drugreact_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,312      4,803 |    26,115 
  sotrovimab |       225         50 |       275 
    paxlovid |       235         47 |       282 
molnupiravir |       225         65 |       290 
-------------+----------------------+----------
       Total |    21,997      4,965 |    26,962 
ae_allergic_ae

-------------------------------------------------------------------------------
-> drug = control
  10,428
-------------------------------------------------------------------------------
-> drug = sotrovimab
  112
-------------------------------------------------------------------------------
-> drug = paxlovid
  112
-------------------------------------------------------------------------------
-> drug = molnupiravir
  119

-------------------------------------------------------------------------------
-> drug = control
  5,268
-------------------------------------------------------------------------------
-> drug = sotrovimab
  59
-------------------------------------------------------------------------------
-> drug = paxlovid
  53
-------------------------------------------------------------------------------
-> drug = molnupiravir
  67

-------------------------------------------------------------------------------
-> drug = control
  464
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_ae_allergic_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,258      4,857 |    26,115 
  sotrovimab |       225         50 |       275 
    paxlovid |       228         54 |       282 
molnupiravir |       244         46 |       290 
-------------+----------------------+----------
       Total |    21,955      5,007 |    26,962 
new_ae_ra_snomed

-------------------------------------------------------------------------------
-> drug = control
  8,382
-------------------------------------------------------------------------------
-> drug = sotrovimab
  100
-------------------------------------------------------------------------------
-> drug = paxlovid
  85
-------------------------------------------------------------------------------
-> drug = molnupiravir
  90

-------------------------------------------------------------------------------
-> drug = control
  4,204
-------------------------------------------------------------------------------
-> drug = sotrovimab
  48
-------------------------------------------------------------------------------
-> drug = paxlovid
  42
-------------------------------------------------------------------------------
-> drug = molnupiravir
  44

-------------------------------------------------------------------------------
-> drug = control
  377
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,169      3,946 |    26,115 
  sotrovimab |       226         49 |       275 
    paxlovid |       242         40 |       282 
molnupiravir |       248         42 |       290 
-------------+----------------------+----------
       Total |    22,885      4,077 |    26,962 
new_ae_sle_ctv

-------------------------------------------------------------------------------
-> drug = control
  8,401
-------------------------------------------------------------------------------
-> drug = sotrovimab
  83
-------------------------------------------------------------------------------
-> drug = paxlovid
  85
-------------------------------------------------------------------------------
-> drug = molnupiravir
  104

-------------------------------------------------------------------------------
-> drug = control
  4,177
-------------------------------------------------------------------------------
-> drug = sotrovimab
  40
-------------------------------------------------------------------------------
-> drug = paxlovid
  45
-------------------------------------------------------------------------------
-> drug = molnupiravir
  55

-------------------------------------------------------------------------------
-> drug = control
  396
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  5
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,171      3,944 |    26,115 
  sotrovimab |       234         41 |       275 
    paxlovid |       240         42 |       282 
molnupiravir |       242         48 |       290 
-------------+----------------------+----------
       Total |    22,887      4,075 |    26,962 
new_ae_psoriasis_snomed

-------------------------------------------------------------------------------
-> drug = control
  9,458
-------------------------------------------------------------------------------
-> drug = sotrovimab
  95
-------------------------------------------------------------------------------
-> drug = paxlovid
  97
-------------------------------------------------------------------------------
-> drug = molnupiravir
  105

-------------------------------------------------------------------------------
-> drug = control
  4,792
-------------------------------------------------------------------------------
-> drug = sotrovimab
  49
-------------------------------------------------------------------------------
-> drug = paxlovid
  50
-------------------------------------------------------------------------------
-> drug = molnupiravir
  53

-------------------------------------------------------------------------------
-> drug = control
  490
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  9
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,632      4,483 |    26,115 
  sotrovimab |       231         44 |       275 
    paxlovid |       234         48 |       282 
molnupiravir |       243         47 |       290 
-------------+----------------------+----------
       Total |    22,340      4,622 |    26,962 
new_ae_psa_snomed

-------------------------------------------------------------------------------
-> drug = control
  9,385
-------------------------------------------------------------------------------
-> drug = sotrovimab
  103
-------------------------------------------------------------------------------
-> drug = paxlovid
  117
-------------------------------------------------------------------------------
-> drug = molnupiravir
  104

-------------------------------------------------------------------------------
-> drug = control
  4,806
-------------------------------------------------------------------------------
-> drug = sotrovimab
  41
-------------------------------------------------------------------------------
-> drug = paxlovid
  62
-------------------------------------------------------------------------------
-> drug = molnupiravir
  52

-------------------------------------------------------------------------------
-> drug = control
  437
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  5
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,764      4,351 |    26,115 
  sotrovimab |       212         63 |       275 
    paxlovid |       229         53 |       282 
molnupiravir |       240         50 |       290 
-------------+----------------------+----------
       Total |    22,445      4,517 |    26,962 
new_ae_ankspon_ctv

-------------------------------------------------------------------------------
-> drug = control
  9,394
-------------------------------------------------------------------------------
-> drug = sotrovimab
  101
-------------------------------------------------------------------------------
-> drug = paxlovid
  96
-------------------------------------------------------------------------------
-> drug = molnupiravir
  112

-------------------------------------------------------------------------------
-> drug = control
  4,813
-------------------------------------------------------------------------------
-> drug = sotrovimab
  49
-------------------------------------------------------------------------------
-> drug = paxlovid
  43
-------------------------------------------------------------------------------
-> drug = molnupiravir
  56

-------------------------------------------------------------------------------
-> drug = control
  448
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  10
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,779      4,336 |    26,115 
  sotrovimab |       226         49 |       275 
    paxlovid |       232         50 |       282 
molnupiravir |       234         56 |       290 
-------------+----------------------+----------
       Total |    22,471      4,491 |    26,962 
new_ae_ibd_snomed

-------------------------------------------------------------------------------
-> drug = control
  9,458
-------------------------------------------------------------------------------
-> drug = sotrovimab
  107
-------------------------------------------------------------------------------
-> drug = paxlovid
  114
-------------------------------------------------------------------------------
-> drug = molnupiravir
  105

-------------------------------------------------------------------------------
-> drug = control
  4,833
-------------------------------------------------------------------------------
-> drug = sotrovimab
  53
-------------------------------------------------------------------------------
-> drug = paxlovid
  58
-------------------------------------------------------------------------------
-> drug = molnupiravir
  47

-------------------------------------------------------------------------------
-> drug = control
  450
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,734      4,381 |    26,115 
  sotrovimab |       225         50 |       275 
    paxlovid |       226         56 |       282 
molnupiravir |       234         56 |       290 
-------------+----------------------+----------
       Total |    22,419      4,543 |    26,962 
new_ae_ra_icd_prim

-------------------------------------------------------------------------------
-> drug = control
  8,452
-------------------------------------------------------------------------------
-> drug = sotrovimab
  81
-------------------------------------------------------------------------------
-> drug = paxlovid
  100
-------------------------------------------------------------------------------
-> drug = molnupiravir
  80

-------------------------------------------------------------------------------
-> drug = control
  4,254
-------------------------------------------------------------------------------
-> drug = sotrovimab
  36
-------------------------------------------------------------------------------
-> drug = paxlovid
  52
-------------------------------------------------------------------------------
-> drug = molnupiravir
  41

-------------------------------------------------------------------------------
-> drug = control
  394
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ra_icd_pr
             |          im
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,176      3,939 |    26,115 
  sotrovimab |       233         42 |       275 
    paxlovid |       237         45 |       282 
molnupiravir |       248         42 |       290 
-------------+----------------------+----------
       Total |    22,894      4,068 |    26,962 
new_ae_sle_icd_prim

-------------------------------------------------------------------------------
-> drug = control
  8,522
-------------------------------------------------------------------------------
-> drug = sotrovimab
  94
-------------------------------------------------------------------------------
-> drug = paxlovid
  97
-------------------------------------------------------------------------------
-> drug = molnupiravir
  100

-------------------------------------------------------------------------------
-> drug = control
  4,410
-------------------------------------------------------------------------------
-> drug = sotrovimab
  48
-------------------------------------------------------------------------------
-> drug = paxlovid
  40
-------------------------------------------------------------------------------
-> drug = molnupiravir
  56

-------------------------------------------------------------------------------
-> drug = control
  422
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  8
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_sle_icd_p
             |          rim
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,205      3,910 |    26,115 
  sotrovimab |       234         41 |       275 
    paxlovid |       225         57 |       282 
molnupiravir |       247         43 |       290 
-------------+----------------------+----------
       Total |    22,911      4,051 |    26,962 
new_ae_ra_ae

-------------------------------------------------------------------------------
-> drug = control
  8,427
-------------------------------------------------------------------------------
-> drug = sotrovimab
  86
-------------------------------------------------------------------------------
-> drug = paxlovid
  84
-------------------------------------------------------------------------------
-> drug = molnupiravir
  86

-------------------------------------------------------------------------------
-> drug = control
  4,255
-------------------------------------------------------------------------------
-> drug = sotrovimab
  47
-------------------------------------------------------------------------------
-> drug = paxlovid
  41
-------------------------------------------------------------------------------
-> drug = molnupiravir
  39

-------------------------------------------------------------------------------
-> drug = control
  383
-------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |   fail_new_ae_ra_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,175      3,940 |    26,115 
  sotrovimab |       231         44 |       275 
    paxlovid |       239         43 |       282 
molnupiravir |       243         47 |       290 
-------------+----------------------+----------
       Total |    22,888      4,074 |    26,962 
new_ae_sle_ae

-------------------------------------------------------------------------------
-> drug = control
  8,442
-------------------------------------------------------------------------------
-> drug = sotrovimab
  86
-------------------------------------------------------------------------------
-> drug = paxlovid
  74
-------------------------------------------------------------------------------
-> drug = molnupiravir
  91

-------------------------------------------------------------------------------
-> drug = control
  4,262
-------------------------------------------------------------------------------
-> drug = sotrovimab
  40
-------------------------------------------------------------------------------
-> drug = paxlovid
  31
-------------------------------------------------------------------------------
-> drug = molnupiravir
  56

-------------------------------------------------------------------------------
-> drug = control
  389
-------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  8
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_sle_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,172      3,943 |    26,115 
  sotrovimab |       230         45 |       275 
    paxlovid |       244         38 |       282 
molnupiravir |       253         37 |       290 
-------------+----------------------+----------
       Total |    22,899      4,063 |    26,962 
new_ae_psoriasis_ae

-------------------------------------------------------------------------------
-> drug = control
  9,378
-------------------------------------------------------------------------------
-> drug = sotrovimab
  101
-------------------------------------------------------------------------------
-> drug = paxlovid
  87
-------------------------------------------------------------------------------
-> drug = molnupiravir
  113

-------------------------------------------------------------------------------
-> drug = control
  4,797
-------------------------------------------------------------------------------
-> drug = sotrovimab
  54
-------------------------------------------------------------------------------
-> drug = paxlovid
  38
-------------------------------------------------------------------------------
-> drug = molnupiravir
  59

-------------------------------------------------------------------------------
-> drug = control
  431
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  2
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_psoriasis
             |          _ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,800      4,315 |    26,115 
  sotrovimab |       228         47 |       275 
    paxlovid |       238         44 |       282 
molnupiravir |       239         51 |       290 
-------------+----------------------+----------
       Total |    22,505      4,457 |    26,962 
new_ae_psa_ae

-------------------------------------------------------------------------------
-> drug = control
  9,352
-------------------------------------------------------------------------------
-> drug = sotrovimab
  98
-------------------------------------------------------------------------------
-> drug = paxlovid
  93
-------------------------------------------------------------------------------
-> drug = molnupiravir
  93

-------------------------------------------------------------------------------
-> drug = control
  4,742
-------------------------------------------------------------------------------
-> drug = sotrovimab
  58
-------------------------------------------------------------------------------
-> drug = paxlovid
  47
-------------------------------------------------------------------------------
-> drug = molnupiravir
  48

-------------------------------------------------------------------------------
-> drug = control
  451
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  6
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_psa_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,757      4,358 |    26,115 
  sotrovimab |       233         42 |       275 
    paxlovid |       239         43 |       282 
molnupiravir |       248         42 |       290 
-------------+----------------------+----------
       Total |    22,477      4,485 |    26,962 
new_ae_ankspon_ae

-------------------------------------------------------------------------------
-> drug = control
  9,425
-------------------------------------------------------------------------------
-> drug = sotrovimab
  93
-------------------------------------------------------------------------------
-> drug = paxlovid
  100
-------------------------------------------------------------------------------
-> drug = molnupiravir
  106

-------------------------------------------------------------------------------
-> drug = control
  4,780
-------------------------------------------------------------------------------
-> drug = sotrovimab
  50
-------------------------------------------------------------------------------
-> drug = paxlovid
  44
-------------------------------------------------------------------------------
-> drug = molnupiravir
  54

-------------------------------------------------------------------------------
-> drug = control
  433
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             | fail_new_ae_ankspon_a
             |           e
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,745      4,370 |    26,115 
  sotrovimab |       236         39 |       275 
    paxlovid |       230         52 |       282 
molnupiravir |       237         53 |       290 
-------------+----------------------+----------
       Total |    22,448      4,514 |    26,962 
new_ae_ibd_ae

-------------------------------------------------------------------------------
-> drug = control
  9,338
-------------------------------------------------------------------------------
-> drug = sotrovimab
  101
-------------------------------------------------------------------------------
-> drug = paxlovid
  98
-------------------------------------------------------------------------------
-> drug = molnupiravir
  88

-------------------------------------------------------------------------------
-> drug = control
  4,757
-------------------------------------------------------------------------------
-> drug = sotrovimab
  44
-------------------------------------------------------------------------------
-> drug = paxlovid
  45
-------------------------------------------------------------------------------
-> drug = molnupiravir
  37

-------------------------------------------------------------------------------
-> drug = control
  439
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-------------------------------------------------------------------------------
-> drug = paxlovid
  6
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3
(26,687 missing values generated)
(282 real changes made)
(290 real changes made)
(26,115 real changes made)

             |  fail_new_ae_ibd_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,793      4,322 |    26,115 
  sotrovimab |       218         57 |       275 
    paxlovid |       232         50 |       282 
molnupiravir |       238         52 |       290 
-------------+----------------------+----------
       Total |    22,481      4,481 |    26,962 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         replace `x'=`x'+0.5 if `x'==start_date
  4. }
ae_spc_all
(52 real changes made)
ae_drug_all
(48 real changes made)
ae_imae_all
(51 real changes made)
ae_all
(54 real changes made)
allcause_emerg_aande
(4 real changes made)
covid_hosp_date
(8 real changes made)
all_hosp_date
(3 real changes made)
died_date_ons
(13 real changes made)
ae_diverticulitis_snomed
(15 real changes made)
ae_diarrhoea_snomed
(20 real changes made)
ae_taste_snomed
(19 real changes made)
ae_diverticulitis_icd_prim
(26 real changes made)
ae_taste_icd_prim
(23 real changes made)
ae_diverticulitis_ae
(12 real changes made)
ae_anaphylaxis_snomed
(17 real changes made)
ae_rash_snomed
(26 real changes made)
ae_anaphylaxis_icd_prim
(18 real changes made)
ae_anaphlaxis_ae
(28 real changes made)
ae_drugreact_ae
(23 real changes made)
ae_allergic_ae
(13 real changes made)
new_ae_ra_snomed
(19 real changes made)
new_ae_sle_ctv
(15 real changes made)
new_ae_psoriasis_snomed
(22 real changes made)
new_ae_psa_snomed
(17 real changes made)
new_ae_ankspon_ctv
(15 real changes made)
new_ae_ibd_snomed
(21 real changes made)
new_ae_ra_icd_prim
(14 real changes made)
new_ae_sle_icd_prim
(19 real changes made)
new_ae_ra_ae
(20 real changes made)
new_ae_sle_ae
(23 real changes made)
new_ae_psoriasis_ae
(11 real changes made)
new_ae_psa_ae
(15 real changes made)
new_ae_ankspon_ae
(9 real changes made)
new_ae_ibd_ae
(12 real changes made)

. 
. *Generate censor date
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         gen stop_`x'=`x' if fail_`x'==1
  3.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_28,paxlovid,molnupiravir) if fail_`x'==0&drug==1
  4.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_28,sotrovimab,molnupiravir) if fail_`x'==0&drug==2
  5.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_28,sotrovimab,paxlovid) if fail_`x'==0&drug==3
  6.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_28,sotrovimab,paxlovid,molnupiravir) if fail_`x'==0&drug==0
  7.         format %td stop_`x'
  8. }
(9,259 missing values generated)
(89 real changes made)
(88 real changes made)
(99 real changes made)
(8,983 real changes made)
(9,160 missing values generated)
(87 real changes made)
(81 real changes made)
(111 real changes made)
(8,881 real changes made)
(4,693 missing values generated)
(47 real changes made)
(33 real changes made)
(48 real changes made)
(4,565 real changes made)
(1,933 missing values generated)
(14 real changes made)
(14 real changes made)
(18 real changes made)
(1,887 real changes made)
(26,420 missing values generated)
(269 real changes made)
(279 real changes made)
(284 real changes made)
(25,588 real changes made)
(25,832 missing values generated)
(261 real changes made)
(272 real changes made)
(281 real changes made)
(25,018 real changes made)
(25,824 missing values generated)
(265 real changes made)
(273 real changes made)
(275 real changes made)
(25,011 real changes made)
(16,181 missing values generated)
(167 real changes made)
(164 real changes made)
(173 real changes made)
(15,677 real changes made)
(22,036 missing values generated)
(217 real changes made)
(243 real changes made)
(237 real changes made)
(21,339 real changes made)
(21,928 missing values generated)
(229 real changes made)
(222 real changes made)
(237 real changes made)
(21,240 real changes made)
(21,944 missing values generated)
(219 real changes made)
(230 real changes made)
(232 real changes made)
(21,263 real changes made)
(22,043 missing values generated)
(230 real changes made)
(227 real changes made)
(240 real changes made)
(21,346 real changes made)
(22,010 missing values generated)
(232 real changes made)
(230 real changes made)
(249 real changes made)
(21,299 real changes made)
(22,041 missing values generated)
(226 real changes made)
(221 real changes made)
(240 real changes made)
(21,354 real changes made)
(21,986 missing values generated)
(224 real changes made)
(223 real changes made)
(250 real changes made)
(21,289 real changes made)
(21,971 missing values generated)
(224 real changes made)
(228 real changes made)
(242 real changes made)
(21,277 real changes made)
(21,933 missing values generated)
(215 real changes made)
(219 real changes made)
(237 real changes made)
(21,262 real changes made)
(21,956 missing values generated)
(213 real changes made)
(229 real changes made)
(240 real changes made)
(21,274 real changes made)
(21,997 missing values generated)
(225 real changes made)
(235 real changes made)
(225 real changes made)
(21,312 real changes made)
(21,955 missing values generated)
(225 real changes made)
(228 real changes made)
(244 real changes made)
(21,258 real changes made)
(22,885 missing values generated)
(226 real changes made)
(242 real changes made)
(248 real changes made)
(22,169 real changes made)
(22,887 missing values generated)
(234 real changes made)
(240 real changes made)
(242 real changes made)
(22,171 real changes made)
(22,340 missing values generated)
(231 real changes made)
(234 real changes made)
(243 real changes made)
(21,632 real changes made)
(22,445 missing values generated)
(212 real changes made)
(229 real changes made)
(240 real changes made)
(21,764 real changes made)
(22,471 missing values generated)
(226 real changes made)
(232 real changes made)
(234 real changes made)
(21,779 real changes made)
(22,419 missing values generated)
(225 real changes made)
(226 real changes made)
(234 real changes made)
(21,734 real changes made)
(22,894 missing values generated)
(233 real changes made)
(237 real changes made)
(248 real changes made)
(22,176 real changes made)
(22,911 missing values generated)
(234 real changes made)
(225 real changes made)
(247 real changes made)
(22,205 real changes made)
(22,888 missing values generated)
(231 real changes made)
(239 real changes made)
(243 real changes made)
(22,175 real changes made)
(22,899 missing values generated)
(230 real changes made)
(244 real changes made)
(253 real changes made)
(22,172 real changes made)
(22,505 missing values generated)
(228 real changes made)
(238 real changes made)
(239 real changes made)
(21,800 real changes made)
(22,477 missing values generated)
(233 real changes made)
(239 real changes made)
(248 real changes made)
(21,757 real changes made)
(22,448 missing values generated)
(236 real changes made)
(230 real changes made)
(237 real changes made)
(21,745 real changes made)
(22,481 missing values generated)
(218 real changes made)
(232 real changes made)
(238 real changes made)
(21,793 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_da
> te) failure(fail_ae_all==1) 

                id:  patient_id
     failure event:  fail_ae_all == 1
obs. time interval:  (stop_ae_all[_n-1], stop_ae_all]
 enter on or after:  time start_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_date

------------------------------------------------------------------------------
     26,962  total observations
     23,988  observations end on or before enter()
------------------------------------------------------------------------------
      2,974  observations remaining, representing
      2,974  subjects
      1,128  failures in single-failure-per-subject data
   65,324.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        28

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==1&min(paxlovid,molnupiravir)==stop_ae_all
  0

. count if fail_ae_all==0&drug==2&min(sotrovimab,molnupiravir)==stop_ae_all
  0

. count if fail_ae_all==0&drug==3&min(sotrovimab,paxlovid)==stop_ae_all
  0

. count if fail_ae_all==0&drug==0&min(sotrovimab,paxlovid,molnupiravir)==stop_a
> e_all
  72

. tab _st  // keep if _st==1 -> removes observations that end on or before ente
> r 

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,988       88.97       88.97
          1 |      2,974       11.03      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. count if start_date>=stop_ae_all & _st==0
  23,988

. count if start_date==stop_ae_all & _st==0
  6

. tab _t,m

   analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
         .5 |         53        0.20        0.20
          1 |         50        0.19        0.38
          2 |         52        0.19        0.57
          3 |         46        0.17        0.75
          4 |         58        0.22        0.96
          5 |         61        0.23        1.19
          6 |         47        0.17        1.36
          7 |         46        0.17        1.53
          8 |         42        0.16        1.69
          9 |         32        0.12        1.81
         10 |         39        0.14        1.95
         11 |         48        0.18        2.13
         12 |         33        0.12        2.25
         13 |         43        0.16        2.41
         14 |         40        0.15        2.56
         15 |         39        0.14        2.70
         16 |         39        0.14        2.85
         17 |         45        0.17        3.02
         18 |         23        0.09        3.10
         19 |         31        0.11        3.22
         20 |         28        0.10        3.32
         21 |         28        0.10        3.42
         22 |         41        0.15        3.58
         23 |         40        0.15        3.72
         24 |         22        0.08        3.81
         25 |         40        0.15        3.95
         26 |         31        0.11        4.07
         27 |         29        0.11        4.18
         28 |      1,848        6.85       11.03
          . |     23,988       88.97      100.00
------------+-----------------------------------
      Total |     26,962      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        50          0          1          2 |        53 
           |      0.19       0.00       0.35       0.69 |      0.20 
-----------+--------------------------------------------+----------
         1 |        49          1          0          0 |        50 
           |      0.19       0.36       0.00       0.00 |      0.19 
-----------+--------------------------------------------+----------
         2 |        48          2          2          0 |        52 
           |      0.18       0.73       0.71       0.00 |      0.19 
-----------+--------------------------------------------+----------
         3 |        44          1          0          1 |        46 
           |      0.17       0.36       0.00       0.34 |      0.17 
-----------+--------------------------------------------+----------
         4 |        52          3          2          1 |        58 
           |      0.20       1.09       0.71       0.34 |      0.22 
-----------+--------------------------------------------+----------
         5 |        60          0          1          0 |        61 
           |      0.23       0.00       0.35       0.00 |      0.23 
-----------+--------------------------------------------+----------
         6 |        47          0          0          0 |        47 
           |      0.18       0.00       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
         7 |        45          1          0          0 |        46 
           |      0.17       0.36       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
         8 |        40          0          1          1 |        42 
           |      0.15       0.00       0.35       0.34 |      0.16 
-----------+--------------------------------------------+----------
         9 |        30          1          1          0 |        32 
           |      0.11       0.36       0.35       0.00 |      0.12 
-----------+--------------------------------------------+----------
        10 |        39          0          0          0 |        39 
           |      0.15       0.00       0.00       0.00 |      0.14 
-----------+--------------------------------------------+----------
        11 |        47          0          0          1 |        48 
           |      0.18       0.00       0.00       0.34 |      0.18 
-----------+--------------------------------------------+----------
        12 |        32          0          1          0 |        33 
           |      0.12       0.00       0.35       0.00 |      0.12 
-----------+--------------------------------------------+----------
        13 |        41          0          1          1 |        43 
           |      0.16       0.00       0.35       0.34 |      0.16 
-----------+--------------------------------------------+----------
        14 |        38          0          0          2 |        40 
           |      0.15       0.00       0.00       0.69 |      0.15 
-----------+--------------------------------------------+----------
        15 |        39          0          0          0 |        39 
           |      0.15       0.00       0.00       0.00 |      0.14 
-----------+--------------------------------------------+----------
        16 |        37          0          1          1 |        39 
           |      0.14       0.00       0.35       0.34 |      0.14 
-----------+--------------------------------------------+----------
        17 |        44          1          0          0 |        45 
           |      0.17       0.36       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
        18 |        21          1          1          0 |        23 
           |      0.08       0.36       0.35       0.00 |      0.09 
-----------+--------------------------------------------+----------
        19 |        31          0          0          0 |        31 
           |      0.12       0.00       0.00       0.00 |      0.11 
-----------+--------------------------------------------+----------
        20 |        27          0          0          1 |        28 
           |      0.10       0.00       0.00       0.34 |      0.10 
-----------+--------------------------------------------+----------
        21 |        28          0          0          0 |        28 
           |      0.11       0.00       0.00       0.00 |      0.10 
-----------+--------------------------------------------+----------
        22 |        39          0          0          2 |        41 
           |      0.15       0.00       0.00       0.69 |      0.15 
-----------+--------------------------------------------+----------
        23 |        39          0          1          0 |        40 
           |      0.15       0.00       0.35       0.00 |      0.15 
-----------+--------------------------------------------+----------
        24 |        22          0          0          0 |        22 
           |      0.08       0.00       0.00       0.00 |      0.08 
-----------+--------------------------------------------+----------
        25 |        38          0          1          1 |        40 
           |      0.15       0.00       0.35       0.34 |      0.15 
-----------+--------------------------------------------+----------
        26 |        30          0          0          1 |        31 
           |      0.11       0.00       0.00       0.34 |      0.11 
-----------+--------------------------------------------+----------
        27 |        28          0          1          0 |        29 
           |      0.11       0.00       0.35       0.00 |      0.11 
-----------+--------------------------------------------+----------
        28 |     1,802         13         13         20 |     1,848 
           |      6.90       4.73       4.61       6.90 |      6.85 
-----------+--------------------------------------------+----------
         . |    23,228        251        254        255 |    23,988 
           |     88.95      91.27      90.07      87.93 |     88.97 
-----------+--------------------------------------------+----------
     Total |    26,115        275        282        290 |    26,962 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        50          0          1          2 |        53 
           |      0.21       0.00       0.37       0.74 |      0.21 
-----------+--------------------------------------------+----------
         1 |        45          1          0          0 |        46 
           |      0.19       0.38       0.00       0.00 |      0.18 
-----------+--------------------------------------------+----------
         2 |        42          1          1          0 |        44 
           |      0.17       0.38       0.37       0.00 |      0.18 
-----------+--------------------------------------------+----------
         3 |        38          1          0          1 |        40 
           |      0.16       0.38       0.00       0.37 |      0.16 
-----------+--------------------------------------------+----------
         4 |        40          3          2          1 |        46 
           |      0.17       1.15       0.75       0.37 |      0.18 
-----------+--------------------------------------------+----------
         5 |        54          0          1          0 |        55 
           |      0.22       0.00       0.37       0.00 |      0.22 
-----------+--------------------------------------------+----------
         6 |        41          0          0          0 |        41 
           |      0.17       0.00       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
         7 |        45          1          0          0 |        46 
           |      0.19       0.38       0.00       0.00 |      0.18 
-----------+--------------------------------------------+----------
         8 |        40          0          1          1 |        42 
           |      0.17       0.00       0.37       0.37 |      0.17 
-----------+--------------------------------------------+----------
         9 |        30          1          1          0 |        32 
           |      0.12       0.38       0.37       0.00 |      0.13 
-----------+--------------------------------------------+----------
        10 |        39          0          0          0 |        39 
           |      0.16       0.00       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
        11 |        47          0          0          1 |        48 
           |      0.19       0.00       0.00       0.37 |      0.19 
-----------+--------------------------------------------+----------
        12 |        32          0          1          0 |        33 
           |      0.13       0.00       0.37       0.00 |      0.13 
-----------+--------------------------------------------+----------
        13 |        41          0          1          1 |        43 
           |      0.17       0.00       0.37       0.37 |      0.17 
-----------+--------------------------------------------+----------
        14 |        36          0          0          2 |        38 
           |      0.15       0.00       0.00       0.74 |      0.15 
-----------+--------------------------------------------+----------
        15 |        39          0          0          0 |        39 
           |      0.16       0.00       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
        16 |        37          0          1          1 |        39 
           |      0.15       0.00       0.37       0.37 |      0.16 
-----------+--------------------------------------------+----------
        17 |        44          1          0          0 |        45 
           |      0.18       0.38       0.00       0.00 |      0.18 
-----------+--------------------------------------------+----------
        18 |        20          1          1          0 |        22 
           |      0.08       0.38       0.37       0.00 |      0.09 
-----------+--------------------------------------------+----------
        19 |        31          0          0          0 |        31 
           |      0.13       0.00       0.00       0.00 |      0.12 
-----------+--------------------------------------------+----------
        20 |        27          0          0          1 |        28 
           |      0.11       0.00       0.00       0.37 |      0.11 
-----------+--------------------------------------------+----------
        21 |        28          0          0          0 |        28 
           |      0.12       0.00       0.00       0.00 |      0.11 
-----------+--------------------------------------------+----------
        22 |        39          0          0          2 |        41 
           |      0.16       0.00       0.00       0.74 |      0.16 
-----------+--------------------------------------------+----------
        23 |        39          0          1          0 |        40 
           |      0.16       0.00       0.37       0.00 |      0.16 
-----------+--------------------------------------------+----------
        24 |        22          0          0          0 |        22 
           |      0.09       0.00       0.00       0.00 |      0.09 
-----------+--------------------------------------------+----------
        25 |        38          0          1          1 |        40 
           |      0.16       0.00       0.37       0.37 |      0.16 
-----------+--------------------------------------------+----------
        26 |        30          0          0          1 |        31 
           |      0.12       0.00       0.00       0.37 |      0.12 
-----------+--------------------------------------------+----------
        27 |        28          0          1          0 |        29 
           |      0.12       0.00       0.37       0.00 |      0.12 
-----------+--------------------------------------------+----------
        28 |        45          0          0          2 |        47 
           |      0.19       0.00       0.00       0.74 |      0.19 
-----------+--------------------------------------------+----------
         . |    23,141        251        254        255 |    23,901 
           |     95.51      96.17      94.78      93.75 |     95.49 
-----------+--------------------------------------------+----------
     Total |    24,228        261        268        272 |    25,029 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        50          0          1          2 |        53 
         1 |        45          1          0          0 |        46 
         2 |        42          1          1          0 |        44 
         3 |        38          1          0          1 |        40 
         4 |        40          3          2          1 |        46 
         5 |        54          0          1          0 |        55 
         6 |        41          0          0          0 |        41 
         7 |        45          1          0          0 |        46 
         8 |        40          0          1          1 |        42 
         9 |        30          1          1          0 |        32 
        10 |        39          0          0          0 |        39 
        11 |        47          0          0          1 |        48 
        12 |        32          0          1          0 |        33 
        13 |        41          0          1          1 |        43 
        14 |        36          0          0          2 |        38 
        15 |        39          0          0          0 |        39 
        16 |        37          0          1          1 |        39 
        17 |        44          1          0          0 |        45 
        18 |        20          1          1          0 |        22 
        19 |        31          0          0          0 |        31 
        20 |        27          0          0          1 |        28 
        21 |        28          0          0          0 |        28 
        22 |        39          0          0          2 |        41 
        23 |        39          0          1          0 |        40 
        24 |        22          0          0          0 |        22 
        25 |        38          0          1          1 |        40 
        26 |        30          0          0          1 |        31 
        27 |        28          0          1          0 |        29 
        28 |        45          0          0          2 |        47 
-----------+--------------------------------------------+----------
     Total |     1,087         10         14         17 |     1,128 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |     1,887         14         14         18 |     1,933 
           |      7.23       5.09       4.96       6.21 |      7.17 
-----------+--------------------------------------------+----------
         1 |    24,228        261        268        272 |    25,029 
           |     92.77      94.91      95.04      93.79 |     92.83 
-----------+--------------------------------------------+----------
     Total |    26,115        275        282        290 |    26,962 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |               drug
      ends |   control  sotrovima   paxlovid |     Total
-----------+---------------------------------+----------
         1 |         1          0          0 |         1 
           |      5.56       0.00       0.00 |      5.00 
-----------+---------------------------------+----------
         2 |         3          1          1 |         5 
           |     16.67     100.00     100.00 |     25.00 
-----------+---------------------------------+----------
         3 |         3          0          0 |         3 
           |     16.67       0.00       0.00 |     15.00 
-----------+---------------------------------+----------
         4 |         8          0          0 |         8 
           |     44.44       0.00       0.00 |     40.00 
-----------+---------------------------------+----------
         5 |         1          0          0 |         1 
           |      5.56       0.00       0.00 |      5.00 
-----------+---------------------------------+----------
         6 |         2          0          0 |         2 
           |     11.11       0.00       0.00 |     10.00 
-----------+---------------------------------+----------
     Total |        18          1          1 |        20 
           |    100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         3 |         3 
           |     15.79 |     15.79 
-----------+-----------+----------
         2 |         2 |         2 
           |     10.53 |     10.53 
-----------+-----------+----------
         3 |         3 |         3 
           |     15.79 |     15.79 
-----------+-----------+----------
         4 |         4 |         4 
           |     21.05 |     21.05 
-----------+-----------+----------
         5 |         5 |         5 
           |     26.32 |     26.32 
-----------+-----------+----------
         6 |         2 |         2 
           |     10.53 |     10.53 
-----------+-----------+----------
     Total |        19 |        19 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid,molnupiravir)&d
> rug==1,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,molnupiravir)
> &drug==2,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid)&dru
> g==3,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid,moln
> upiravir)&drug==0,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         6 |         1 |         1 
           |     50.00 |     50.00 
-----------+-----------+----------
        14 |         1 |         1 
           |     50.00 |     50.00 
-----------+-----------+----------
     Total |         2 |         2 
           |    100.00 |    100.00 

. 
. 
. save "$projectdir/output/data/main.dta", replace
(note: file /workspace/output/data/main.dta not found)
file /workspace/output/data/main.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset_combine_2.log
  log type:  text
 closed on:  28 Jul 2023, 12:40:42
-------------------------------------------------------------------------------
