-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:  19 Jun 2023, 10:42:44

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/ado"

. 
. * import control dataset
. import delimited "$projectdir/output/input_control.csv", clear
(211 vars, 50,000 obs)

. gen control_dataset=1

. save "$projectdir/output/data/control.dta", replace 
file /workspace/output/data/control.dta saved

. 
. * import treatment dataset
. import delimited "$projectdir/output/input_treatment.csv", clear
(211 vars, 50,000 obs)

. gen treatment_dataset=1

. 
. *********************************
. *  Append control & treatment datasets     *
. ********************************* 
. append using "$projectdir/output/data/control.dta" 

. duplicates tag patient_id, gen(duplicate_patient_id)

Duplicates in terms of patient_id

. bys patient_id (treatment_dataset duplicate_patient_id): gen n=_n

. tab n

          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,941       94.94       94.94
          2 |      5,059        5.06      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. drop if n>1  // drops duplicate patient id and in control group
(5,059 observations deleted)

. tab control_dataset,m

control_dat |
       aset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     44,941       47.34       47.34
          . |     50,000       52.66      100.00
------------+-----------------------------------
      Total |     94,941      100.00

. tab treatment_dataset,m

treatment_d |
     ataset |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     50,000       52.66       52.66
          . |     44,941       47.34      100.00
------------+-----------------------------------
      Total |     94,941      100.00

. count if start_date!=date_treated & treatment_dataset==1
  0

. count if start_date!=covid_test_positive_date & control_dataset==1
  44,849

. 
. *********************************
. *       Convert strings to dates     *
. ********************************* 
. foreach var of varlist   covid_test_positive_date                            
>    ///
>                                                  covid_test_positive_date2   
>                            ///
>                                                  covid_test_positive_date3   
>                            ///
>                                                  covid_test_positive_treat   
>                            ///
>                                                  prior_covid_date            
>                            ///
>                                                  sotrovimab                  
>                                            ///
>                                                  molnupiravir                
>                                    /// 
>                                                  paxlovid                    
>                                            ///
>                                                  remdesivir                  
>                                            ///
>                                                  casirivimab                 
>                                    ///
>                                                  sotrovimab_not_start        
>                            ///
>                                                  molnupiravir_not_start      
>                            ///
>                                                  paxlovid_not_start          
>                                    ///
>                                                  date_treated                
>                                    ///
>                                                  start_date                  
>                                            ///
>                                                  drugs_paxlovid_interaction  
>                            ///
>                                                  drugs_nirmatrelvir_interacti
> on                 ///
>                                                  last_vaccination_date       
>                            ///
>                                                  death_date                  
>                                            ///
>                                                  dereg_date                  
>                                    ///
>                                                  bmi_date_measured           
>                                    ///
>                                                  creatinine_ctv3_date        
>                            ///
>                                                  creatinine_snomed_date      
>                            ///
>                                                  creatinine_short_snomed_date
>                    ///
>                                                  ae_diverticulitis_icd       
>                            ///
>                                                  ae_diverticulitis_snomed    
>                            ///
>                                                  ae_diarrhoea_snomed         
>                            ///
>                                                  ae_taste_snomed             
>                                    ///
>                                                  ae_taste_icd                
>                                    ///
>                                                  ae_rash_snomed              
>                                    ///
>                                                  ae_anaphylaxis_icd          
>                                    ///
>                                                  ae_anaphylaxis_snomed       
>                            ///
>                                                  ae_anaphlaxis_ae            
>                                    ///
>                                                  ae_drugreact_ae             
>                                    ///
>                                                  ae_allergic_ae              
>                                    ///
>                                                  ae_rheumatoid_arthritis_snom
> ed                 ///
>                                                  ae_rheumatoid_arthritis_icd 
>                    ///
>                                                  ae_sle_ctv                  
>                                            ///
>                                                  ae_sle_icd                  
>                                            ///
>                                                  ae_psoriasis_snomed         
>                            ///
>                                                  ae_psoriatic_arthritis_snome
> d                  ///
>                                                  ae_ankylosing_spondylitis_ct
> v                  ///
>                                                  ae_ibd_snomed               
>                                    ///
>                                                  ae_diverticulitis_ae        
>                            ///
>                                                  ae_rheumatoid_arthritis_ae  
>                            ///
>                                                  ae_sle_ae                   
>                                            ///
>                                                  ae_psoriasis_ae             
>                                    ///
>                                                  ae_psoriatic_arthritis_ae   
>                            ///
>                                                  ae_ankylosing_spondylitis_ae
>                    ///
>                                                  ae_ibd_ae                   
>                                            ///
>                                                  rheumatoid_arthritis_nhsd_sn
> omed               ///
>                                                  rheumatoid_arthritis_nhsd_ic
> d10                ///
>                                                  sle_nhsd_ctv                
>                                    ///
>                                                  sle_nhsd_icd10              
>                                    ///
>                                                  psoriasis_nhsd              
>                                    ///
>                                                  psoriatic_arthritis_nhsd    
>                            ///
>                                                  ankylosing_spondylitis_nhsd 
>                    ///
>                                                  ibd_ctv                     
>                                            ///
>                                                  allcause_emerg_aande        
>                            ///
>                                                  all_hosp_date               
>                                    ///
>                                                  all_hosp_date0              
>                                    ///
>                                                  all_hosp_date1              
>                                    ///
>                                                  all_hosp_date2              
>                                    ///
>                                                  hosp_discharge_date         
>                            ///
>                                                  hosp_discharge_date0        
>                            ///
>                                                  hosp_discharge_date1        
>                            ///
>                                                  hosp_discharge_date2        
>                            ///
>                                                  covid_hosp_date             
>                                    ///
>                                                  covid_hosp_date0            
>                                    ///
>                                                  covid_hosp_date1            
>                                    ///
>                                                  covid_hosp_date2            
>                                    ///                                       
>       
>                                                  covid_discharge_date        
>                            ///
>                                                  covid_discharge_date0       
>                            ///                                             
>                                                  covid_discharge_date1       
>                            /// 
>                                                  covid_discharge_date2       
>                            /// 
>                                                  any_covid_hosp_discharge    
>                            ///                     
>                                                  covid_hosp_date_mabs        
>                            /// 
>                                                  covid_hosp_date_mabs_not_pri
> mary               /// 
>                                                  died_date_ons               
>                                    ///
>                                                  died_ons_covid              
>                                    ///
>                                                  pre_diverticulitis_icd      
>                            ///
>                                                  pre_diverticulitis_snomed   
>                            ///
>                                                  pre_diverticulitis_ae       
>                            ///
>                                                  pre_diarrhoea_snomed        
>                            ///
>                                                  pre_taste_snomed            
>                                    ///
>                                                  pre_taste_icd               
>                                    ///
>                                                  pre_rash_snomed             
>                                    ///
>                                                  pre_anaphylaxis_icd         
>                            ///
>                                                  pre_anaphylaxis_snomed      
>                            ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_drugreact_ae            
>                                    ///
>                                                  pre_allergic_ae             
>                                    ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_rheumatoid_arthritis_ae 
>                    ///
>                                                  pre_rheumatoid_arthritis_sno
> med                ///
>                                                  pre_rheumatoid_arthritis_icd
>                    ///
>                                                  pre_ankylosing_spondylitis_c
> tv                 ///
>                                                  pre_ankylosing_spondylitis_a
> e                  ///
>                                                  pre_psoriasis_snomed        
>                            ///
>                                                  pre_psoriasis_ae            
>                                    ///
>                                                  pre_psoriatic_arthritis_ae  
>                            ///
>                                                  pre_psoriatic_arthritis_snom
> ed                 ///
>                                                  pre_sle_ctv                 
>                                    ///
>                                                  pre_sle_icd                 
>                                    ///
>                                                  pre_sle_ae                  
>                                            ///
>                                                  pre_ibd_ae                  
>                                            ///
>                                                  pre_ibd_snomed {            
>                             
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(9,499 missing values generated)
(85,447 missing values generated)
(85,440 missing values generated)
(56,927 missing values generated)
(9,489 missing values generated)
(84,897 missing values generated)
(84,896 missing values generated)
(84,897 missing values generated)
(84,894 missing values generated)
(84,898 missing values generated)
(93,998 missing values generated)
(93,988 missing values generated)
(93,997 missing values generated)
(70,233 missing values generated)
(25,515 missing values generated)
(90,174 missing values generated)
(90,187 missing values generated)
(4,793 missing values generated)
(85,464 missing values generated)
(85,459 missing values generated)
(4,752 missing values generated)
(47,441 missing values generated)
(47,515 missing values generated)
(56,904 missing values generated)
(57,014 missing values generated)
(56,933 missing values generated)
(56,936 missing values generated)
(56,946 missing values generated)
(56,972 missing values generated)
(56,928 missing values generated)
(56,971 missing values generated)
(57,002 missing values generated)
(56,960 missing values generated)
(56,983 missing values generated)
(56,941 missing values generated)
(56,964 missing values generated)
(56,940 missing values generated)
(57,006 missing values generated)
(56,994 missing values generated)
(56,994 missing values generated)
(56,982 missing values generated)
(56,963 missing values generated)
(56,949 missing values generated)
(56,951 missing values generated)
(56,956 missing values generated)
(57,002 missing values generated)
(56,943 missing values generated)
(56,978 missing values generated)
(56,968 missing values generated)
(90,198 missing values generated)
(85,419 missing values generated)
(93,993 missing values generated)
(94,003 missing values generated)
(93,993 missing values generated)
(85,456 missing values generated)
(94,007 missing values generated)
(93,993 missing values generated)
(93,997 missing values generated)
(85,424 missing values generated)
(93,991 missing values generated)
(93,990 missing values generated)
(93,993 missing values generated)
(93,989 missing values generated)
(93,998 missing values generated)
(93,995 missing values generated)
(94,000 missing values generated)
(90,207 missing values generated)
(85,429 missing values generated)
(85,466 missing values generated)
(38,018 missing values generated)
(37,911 missing values generated)
(85,474 missing values generated)
(85,467 missing values generated)
(85,459 missing values generated)
(85,475 missing values generated)
(85,436 missing values generated)
(85,452 missing values generated)
(85,419 missing values generated)
(85,438 missing values generated)
(85,473 missing values generated)
(85,451 missing values generated)
(85,476 missing values generated)
(85,458 missing values generated)
(85,423 missing values generated)
(85,442 missing values generated)
(85,472 missing values generated)
(85,456 missing values generated)
(85,443 missing values generated)
(85,469 missing values generated)
(85,455 missing values generated)
(85,428 missing values generated)
(85,450 missing values generated)
(85,489 missing values generated)
(85,430 missing values generated)
(85,454 missing values generated)
(85,419 missing values generated)
(85,388 missing values generated)

. 
. ****************************
. *       EXPOSURE                *
. ****************************
. ** removing individuals who did not start therapy
. foreach var of varlist sotrovimab molnupiravir paxlovid {
  2.     display "`var'"
  3.         count if `var'!=.
  4.         count if `var'==date_treated & `var'!=. & date_treated!=.
  5.         count if `var'==date_treated & `var'!=. & date_treated!=. & `var'_
> not_start!=.
  6.         gen `var'_start = 1 if `var'==date_treated & `var'!=. & date_treat
> ed!=. & `var'_not_start==.
  7.         replace `var'_start = 0 if `var'==date_treated & `var'!=. & date_t
> reated!=. & `var'_not_start!=.
  8.         tab `var'_start, m  //number on treatment, first drug given, and d
> rug was started
  9. }
sotrovimab
  10,044
  8,133
  88
(86,896 missing values generated)
(88 real changes made)

sotrovimab_ |
      start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         88        0.09        0.09
          1 |      8,045        8.47        8.57
          . |     86,808       91.43      100.00
------------+-----------------------------------
      Total |     94,941      100.00
molnupiravir
  10,045
  8,242
  84
(86,783 missing values generated)
(84 real changes made)

molnupiravi |
    r_start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         84        0.09        0.09
          1 |      8,158        8.59        8.68
          . |     86,699       91.32      100.00
------------+-----------------------------------
      Total |     94,941      100.00
paxlovid
  10,044
  8,252
  84
(86,773 missing values generated)
(84 real changes made)

paxlovid_st |
        art |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         84        0.09        0.09
          1 |      8,168        8.60        8.69
          . |     86,689       91.31      100.00
------------+-----------------------------------
      Total |     94,941      100.00

. gen drug=1 if sotrovimab==date_treated & sotrovimab_start==1 
(86,896 missing values generated)

. replace drug=2 if paxlovid==date_treated & paxlovid_start==1
(8,168 real changes made)

. replace drug=3 if molnupiravir==date_treated & molnupiravir_start==1
(8,158 real changes made)

. replace drug=4 if sotrovimab==date_treated & sotrovimab_start==0 
(88 real changes made)

. replace drug=5 if paxlovid==date_treated & paxlovid_start==0 
(84 real changes made)

. replace drug=6 if molnupiravir==date_treated & molnupiravir_start==0 
(84 real changes made)

. replace drug=7 if remdesivir==date_treated&remdesivir!=.&date_treated!=.
(55 real changes made)

. replace drug=8 if casirivimab==date_treated&casirivimab!=.&date_treated!=.
(56 real changes made)

. replace drug=0 if drug==.
(70,233 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir", re
> place

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     70,233       73.98       73.98
  sotrovimab |      8,034        8.46       82.44
    paxlovid |      8,156        8.59       91.03
molnupiravir |      8,151        8.59       99.61
           4 |         88        0.09       99.71
           5 |         84        0.09       99.79
           6 |         84        0.09       99.88
           7 |         55        0.06       99.94
           8 |         56        0.06      100.00
-------------+-----------------------------------
       Total |     94,941      100.00

. drop if drug>3
(367 observations deleted)

. tab drug control_dataset ,m

             |    control_dataset
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    44,718     25,515 |    70,233 
  sotrovimab |        44      7,990 |     8,034 
    paxlovid |        44      8,112 |     8,156 
molnupiravir |        45      8,106 |     8,151 
-------------+----------------------+----------
       Total |    44,851     49,723 |    94,574 

. tab drug treatment_dataset ,m 

             |   treatment_dataset
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    25,515     44,718 |    70,233 
  sotrovimab |     7,990         44 |     8,034 
    paxlovid |     8,112         44 |     8,156 
molnupiravir |     8,106         45 |     8,151 
-------------+----------------------+----------
       Total |    49,723     44,851 |    94,574 

. 
. ** start date is date treatment for treatment arms and date of covid test for
>  control arm 
. count if start_date==. //should be 0
  25,515

. count if start_date!=covid_test_positive_date & drug==0  //should be 0
  67,602

. count if start_date!=date_treated & drug>0 //should be 0
  132

. 
. ** check number of positive covid tests prior to drug in treatment arms
. bys drug:count if covid_test_positive_date==. // should be 0 in control arm

-------------------------------------------------------------------------------
-> drug = control
  7,019
-------------------------------------------------------------------------------
-> drug = sotrovimab
  783
-------------------------------------------------------------------------------
-> drug = paxlovid
  822
-------------------------------------------------------------------------------
-> drug = molnupiravir
  844

. bys drug:count if covid_test_positive_date!=. 

-------------------------------------------------------------------------------
-> drug = control
  63,214
-------------------------------------------------------------------------------
-> drug = sotrovimab
  7,251
-------------------------------------------------------------------------------
-> drug = paxlovid
  7,334
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7,307

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& date_treated>c
> ovid_test_positive_date //test prior to treatment

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3,415
-------------------------------------------------------------------------------
-> drug = paxlovid
  3,539
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3,378

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& (date_treated-
> covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5) //test
>  <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  64
-------------------------------------------------------------------------------
-> drug = paxlovid
  69
-------------------------------------------------------------------------------
-> drug = molnupiravir
  76

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& date_treated<
> covid_test_positive_date2 //2nd covid episode prior to treatment 

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  420
-------------------------------------------------------------------------------
-> drug = paxlovid
  436
-------------------------------------------------------------------------------
-> drug = molnupiravir
  418

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& (date_treated
> -covid_test_positive_date2>0)&(date_treated-covid_test_positive_date2<=5) //t
> est <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-------------------------------------------------------------------------------
-> drug = paxlovid
  3
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& date_treated<
> covid_test_positive_date3 //3rd covid episode prior to treatment 

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  432
-------------------------------------------------------------------------------
-> drug = paxlovid
  418
-------------------------------------------------------------------------------
-> drug = molnupiravir
  405

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& (date_treated
> -covid_test_positive_date3>0)&(date_treated-covid_test_positive_date3<=5) //t
> est <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  7

. ** check in control group that covid positive, and not repeat covid test afte
> r an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days if drug==0

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,689        369 |     7,058 
         1 |    60,013      3,162 |    63,175 
-----------+----------------------+----------
     Total |    66,702      3,531 |    70,233 

. drop if drug==0 & covid_test_positive==1 & covid_positive_previous_30_days==1
(3,162 observations deleted)

. ** gen study start and study end date
. gen campaign_start=mdy(12,16,2021)

. gen study_end_date=mdy(06,01,2023)

. gen start_date_29=date_treated+28
(67,071 missing values generated)

. format campaign_start study_end_date start_date_29 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ** inclusion criteria*
. keep if age>=18 & age<110
(19,294 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(3,596 observations deleted)

. ** exclusion criteria*
. count if start_date>dereg_date & start_date!=.
  4,960

. count if start_date>death_date & start_date!=.
  4,972

. drop if start_date>death_date | start_date>dereg_date
(12,940 observations deleted)

. 
. ** high risk cohort from blueteq therapeutics datafor drug arms
. tab high_risk_cohort_therapeutics drug,m //should be 0 in control group

high_risk_cohort_ther |                    drug
             apeutics |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
       Downs syndrome |     4,021        500        495        527 |     5,543 
          HIV or AIDS |     2,010        239        224        246 |     2,719 
                 IMID |     4,153        461        488        553 |     5,655 
    IMID,solid cancer |     4,073        478        533        508 |     5,592 
                   NA |     2,098        249        239        232 |     2,818 
haematological dise.. |     2,025        245        276        237 |     2,783 
haematological mali.. |     1,938        241        246        254 |     2,679 
        liver disease |     2,028        233        235        264 |     2,760 
primary immune defi.. |     4,079        503        504        460 |     5,546 
sickle cell disease.. |     4,010        482        470        491 |     5,453 
         solid cancer |     4,060        529        516        507 |     5,612 
solid organ transpl.. |     4,130        500        514        463 |     5,607 
stem cell transplan.. |     2,121        227        270        197 |     2,815 
----------------------+--------------------------------------------+----------
                Total |    40,746      4,887      5,010      4,939 |    55,582 

. gen downs_syndrome_therap= 1 if strpos(high_risk_cohort_therapeutics, "Downs 
> syndrome")
(50,039 missing values generated)

. gen solid_cancer_therap=1 if strpos(high_risk_cohort_therapeutics, "solid can
> cer")
(44,378 missing values generated)

. gen haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematolo
> gical malignancies")
(52,903 missing values generated)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "sickl
> e cell disease")
(5,453 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haema
> tological diseases")
(2,783 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "stem 
> cell transplant")
(2,815 real changes made)

. gen renal_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "renal d
> isease")
(49,975 missing values generated)

. gen liver_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "liver d
> isease")
(52,822 missing values generated)

. gen imid_on_drug_therap= 1 if strpos(high_risk_cohort_therapeutics, "IMID")
(44,335 missing values generated)

. gen immunosupression_therap= 1 if strpos(high_risk_cohort_therapeutics, "prim
> ary immune deficiencies")
(50,036 missing values generated)

. gen hiv_aids_therap= 1 if strpos(high_risk_cohort_therapeutics, "HIV or AIDS"
> )
(52,863 missing values generated)

. gen organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "soli
> d organ recipients")
(55,582 missing values generated)

. replace organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "
> solid organ transplant")
(5,607 real changes made)

. gen rare_neuro_therap= 1 if strpos(high_risk_cohort_therapeutics, "rare neuro
> logical conditions")
(50,129 missing values generated)

. bys drug: count if high_risk_cohort_therapeutics!=""&high_risk_cohort_therape
> utics!="other"& min(downs_syndrome_therap,solid_cancer_therap,haem_disease_th
> erap,renal_disease_therap,liver_disease_therap,imid_on_drug_therap,immunosupr
> ession_therap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==. /
> /check if all diseases have been captured

-------------------------------------------------------------------------------
-> drug = control
  2,098
-------------------------------------------------------------------------------
-> drug = sotrovimab
  249
-------------------------------------------------------------------------------
-> drug = paxlovid
  239
-------------------------------------------------------------------------------
-> drug = molnupiravir
  232

. tab drug high_risk_cohort_therapeutics if high_risk_cohort_therapeutics!=""&h
> igh_risk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer
> _therap,haem_disease_therap,renal_disease_therap,liver_disease_therap,imid_on
> _drug_therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,
> rare_neuro_therap)==.

             | high_risk_
             | cohort_the
             | rapeutics
        drug |        NA |     Total
-------------+-----------+----------
     control |     2,098 |     2,098 
  sotrovimab |       249 |       249 
    paxlovid |       239 |       239 
molnupiravir |       232 |       232 
-------------+-----------+----------
       Total |     2,818 |     2,818 

. foreach var of varlist downs_syndrome_therap solid_cancer_therap haem_disease
> _therap renal_disease_therap liver_disease_therap imid_on_drug_therap immunos
> upression_therap hiv_aids_therap organ_transplant_therap rare_neuro_therap{
  2.         replace `var'=0 if `var'==. 
  3. }
(50,039 real changes made)
(44,378 real changes made)
(41,852 real changes made)
(49,975 real changes made)
(52,822 real changes made)
(44,335 real changes made)
(50,036 real changes made)
(52,863 real changes made)
(49,975 real changes made)
(50,129 real changes made)

. 
. ** high risk cohort from open codelist from control group
. tab high_risk_cohort_nhsd drug,m //should be no 0s in control group

high_risk_ |
cohort_nhs |                    drug
         d |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |       891        113         99        103 |     1,206 
         1 |    39,855      4,774      4,911      4,836 |    54,376 
-----------+--------------------------------------------+----------
     Total |    40,746      4,887      5,010      4,939 |    55,582 

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be 0
  14,929

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & downs_syndrome==0 &s
> olid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosu
> pression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  645

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 //should be 0
  572

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 & downs_syndrome==0 &s
> olid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosu
> pression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  20

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  541

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 
  527

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_dr
> ug==1
  254

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_dr
> ug==1 &downs_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 
> &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0 &rar
> e_neuro==0
  13

. replace imid_on_drug=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_dru
> gs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenola
> te==0 &imid_on_drug==1 //ignore if steriods<4 scripts in 6m & not coded other
>  imid drug 
(254 real changes made)

. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_
> steroid_drugs_nhsd==1 //ignore if steriods<4 scripts in 6m
(541 real changes made)

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be same numbe
> r as those dropped above 
  14,929

. replace imid_on_drug=0 if imid_nhsd==1 & imid_drug==0 
(14,929 real changes made)

. replace imid_on_drug=0 if imid_nhsd==0 & imid_drug==1 
(463 real changes made)

. gen high_risk_cohort_codelist=((downs_syndrome + solid_cancer + haem_disease 
> + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids 
> + organ_transplant + rare_neuro )>0)

. tab high_risk_cohort_nhsd high_risk_cohort_codelist

high_risk_ | high_risk_cohort_code
cohort_nhs |         list
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,206          0 |     1,206 
         1 |       672     53,704 |    54,376 
-----------+----------------------+----------
     Total |     1,878     53,704 |    55,582 

. 
. ** combine two high risk cohorts into one 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease
>  liver_disease imid_on_drug immunosupression hiv_aids organ_transplant rare_n
> euro {
  2.         gen `var'_comb = `var'
  3.         replace `var'_comb = 1 if `var'_therap==1 
  4.         tab `var' `var'_therap 
  5.         tab `var'_comb
  6. }
(4,482 real changes made)

downs_synd | downs_syndrome_therap
      rome |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,651      4,482 |    45,133 
         1 |     9,388      1,061 |    10,449 
-----------+----------------------+----------
     Total |    50,039      5,543 |    55,582 

downs_syndr |
   ome_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,651       73.14       73.14
          1 |     14,931       26.86      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(10,127 real changes made)

solid_canc |  solid_cancer_therap
        er |         0          1 |     Total
-----------+----------------------+----------
         0 |    39,945     10,127 |    50,072 
         1 |     4,433      1,077 |     5,510 
-----------+----------------------+----------
     Total |    44,378     11,204 |    55,582 

solid_cance |
     r_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     39,945       71.87       71.87
          1 |     15,637       28.13      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(7,296 real changes made)

haem_disea |  haem_disease_therap
        se |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,997      7,296 |    29,293 
         1 |    19,855      6,434 |    26,289 
-----------+----------------------+----------
     Total |    41,852     13,730 |    55,582 

haem_diseas |
     e_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,997       39.58       39.58
          1 |     33,585       60.42      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(3,639 real changes made)

renal_dise | renal_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,835      3,639 |    36,474 
         1 |    17,140      1,968 |    19,108 
-----------+----------------------+----------
     Total |    49,975      5,607 |    55,582 

renal_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,835       59.07       59.07
          1 |     22,747       40.93      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(2,230 real changes made)

liver_dise | liver_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    42,794      2,230 |    45,024 
         1 |    10,028        530 |    10,558 
-----------+----------------------+----------
     Total |    52,822      2,760 |    55,582 

liver_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     42,794       76.99       76.99
          1 |     12,788       23.01      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(8,787 real changes made)

imid_on_dr |  imid_on_drug_therap
        ug |         0          1 |     Total
-----------+----------------------+----------
         0 |    34,650      8,787 |    43,437 
         1 |     9,685      2,460 |    12,145 
-----------+----------------------+----------
     Total |    44,335     11,247 |    55,582 

imid_on_dru |
     g_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,650       62.34       62.34
          1 |     20,932       37.66      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(4,985 real changes made)

           | immunosupression_ther
immunosupr |          ap
    ession |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,965      4,985 |    49,950 
         1 |     5,071        561 |     5,632 
-----------+----------------------+----------
     Total |    50,036      5,546 |    55,582 

immunosupre |
 ssion_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,965       80.90       80.90
          1 |     10,617       19.10      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(2,180 real changes made)

           |    hiv_aids_therap
  hiv_aids |         0          1 |     Total
-----------+----------------------+----------
         0 |    42,852      2,180 |    45,032 
         1 |    10,011        539 |    10,550 
-----------+----------------------+----------
     Total |    52,863      2,719 |    55,582 

hiv_aids_co |
         mb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     42,852       77.10       77.10
          1 |     12,730       22.90      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(3,830 real changes made)

           | organ_transplant_ther
organ_tran |          ap
    splant |         0          1 |     Total
-----------+----------------------+----------
         0 |    34,276      3,830 |    38,106 
         1 |    15,699      1,777 |    17,476 
-----------+----------------------+----------
     Total |    49,975      5,607 |    55,582 

organ_trans |
 plant_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,276       61.67       61.67
          1 |     21,306       38.33      100.00
------------+-----------------------------------
      Total |     55,582      100.00
(2,422 real changes made)

           |   rare_neuro_therap
rare_neuro |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,385      2,422 |    23,807 
         1 |    28,744      3,031 |    31,775 
-----------+----------------------+----------
     Total |    50,129      5,453 |    55,582 

rare_neuro_ |
       comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,385       38.47       38.47
          1 |     34,197       61.53      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. 
. ****************************
. *       OUTCOME         *
. ****************************
. *** AESI, IMAE and some Drug reaction (need to add further IMAE and DRESS, SJ
> S, TEN) 
. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_
> snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(37,786 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis
> _nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0
(37,487 missing values generated)

. gen new_ae_ra_ae = ae_rheumatoid_arthritis_ae if rheumatoid_arthritis_nhsd_sn
> omed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(37,709 missing values generated)

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(37,625 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(37,548 missing values generated)

. gen new_ae_sle_ae = ae_sle_ae if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(37,698 missing values generated)

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(35,764 missing values generated)

. gen new_ae_psoriasis_ae = ae_psoriasis_ae if psoriasis_nhsd==0
(35,646 missing values generated)

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_
> nhsd==0
(35,573 missing values generated)

. gen new_ae_psa_ae = ae_psoriatic_arthritis_ae if psoriatic_arthritis_nhsd==0
(35,486 missing values generated)

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondyli
> tis_nhsd==0
(35,703 missing values generated)

. gen new_ae_ankspon_ae = ae_ankylosing_spondylitis_ae if ankylosing_spondyliti
> s_nhsd==0
(35,526 missing values generated)

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(35,556 missing values generated)

. gen new_ae_ibd_ae = ae_ibd_ae if ibd_ctv==0
(35,467 missing values generated)

. 
. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed          
>                    ///
>                                                 ae_taste_snomed              
>                            

. global ae_spc_icd               ae_diverticulitis_icd                   ///
>                                                 ae_taste_icd                 
>                    

. global ae_spc_emerg             ae_diverticulitis_ae                         
>                                            

. global ae_drug                  ae_anaphylaxis_snomed                   ///  
>    
>                                                 ae_rash_snomed  

. global ae_drug_emerg    ae_anaphlaxis_ae                                ///
>                                                 ae_drugreact_ae              
>                    ///
>                                                 ae_allergic_ae               
>                                                                        

. global ae_drug_icd              ae_anaphylaxis_icd

. global ae_imae                  new_ae_ra_snomed                             
>    ///
>                                                 new_ae_sle_ctv               
>                    ///
>                                                 new_ae_psoriasis_snomed      
>            ///
>                                                 new_ae_psa_snomed            
>                    ///
>                                                 new_ae_ankspon_ctv           
>                    ///
>                                                 new_ae_ibd_snomed       

. global ae_imae_icd              new_ae_ra_icd                                
>    ///
>                                                 new_ae_sle_icd          

. global ae_imae_emerg    new_ae_ra_ae                                    ///
>                                                 new_ae_sle_ae                
>                    ///
>                                                 new_ae_psoriasis_ae          
>                    ///
>                                                 new_ae_psa_ae                
>                    ///
>                                                 new_ae_ankspon_ae            
>                    ///
>                                                 new_ae_ibd_ae                
>            

.                                                                         
. *remove event if occurred before start
. foreach x in $ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug
> _emerg $ae_imae $ae_imae_icd $ae_drug_emerg{
  2.                                 display "`x'"
  3.                                 count if (`x' > start_date | `x' < start_d
> ate + 28) & `x'!=. 
  4.                                 count if (`x' < start_date | `x' > start_d
> ate + 28) & `x'!=. & drug==0
  5.                                 count if (`x' < start_date | `x' > start_d
> ate + 28) & `x'!=. & drug>0
  6.                                 //replace `x'=. if (`x' < start_date | `x'
>  > start_date + 28) & `x'!=.
. }
ae_diverticulitis_snomed
  22,247
  15,663
  5,655
ae_diarrhoea_snomed
  22,431
  15,998
  5,571
ae_taste_snomed
  22,331
  15,889
  5,575
ae_diverticulitis_icd
  22,361
  15,827
  5,679
ae_taste_icd
  22,335
  15,877
  5,615
ae_diverticulitis_ae
  22,299
  15,791
  5,665
ae_anaphylaxis_snomed
  22,123
  15,620
  5,638
ae_rash_snomed
  22,154
  15,685
  5,616
ae_anaphylaxis_icd
  22,137
  15,695
  5,607
ae_anaphlaxis_ae
  21,996
  15,607
  5,538
ae_drugreact_ae
  22,153
  15,783
  5,524
ae_allergic_ae
  22,202
  15,753
  5,610
new_ae_ra_snomed
  18,095
  12,798
  4,632
new_ae_sle_ctv
  18,034
  12,770
  4,562
new_ae_psoriasis_snomed
  19,818
  14,074
  4,987
new_ae_psa_snomed
  20,009
  14,197
  5,083
new_ae_ankspon_ctv
  19,879
  14,090
  5,009
new_ae_ibd_snomed
  20,026
  14,205
  5,055
new_ae_ra_icd
  17,796
  12,600
  4,492
new_ae_sle_icd
  17,957
  12,654
  4,604
ae_anaphlaxis_ae
  21,996
  15,607
  5,538
ae_drugreact_ae
  22,153
  15,783
  5,524
ae_allergic_ae
  22,202
  15,753
  5,610

. egen ae_spc_gp = rmin($ae_spc)
(11863 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(19941 missing values generated)

. egen ae_spc_emerg = rmin($ae_spc_emerg)
(33283 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg)
(2581 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(20068 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(33445 missing values generated)

. egen ae_drug_emerg = rmin($ae_drug_emerg)
(12012 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd $ae_drug_emerg)
(2616 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)
(4278 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(25607 missing values generated)

. egen ae_imae_emerg = rmin($ae_imae_emerg)
(4327 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd $ae_imae_emerg)   
(275 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $a
> e_drug_emerg $ae_imae $ae_imae_icd $ae_imae_emerg)

. egen ae_all_serious = rmin($ae_spc_icd $ae_spc_emerg $ae_drug_icd $ae_drug_em
> erg $ae_imae_icd $ae_imae_emerg)
(53 missing values generated)

. by drug, sort: count if ae_spc_all!=.

-------------------------------------------------------------------------------
-> drug = control
  38,848
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,668
-------------------------------------------------------------------------------
-> drug = paxlovid
  4,778
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,707

. by drug, sort: count if ae_drug_all!=.

-------------------------------------------------------------------------------
-> drug = control
  38,853
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,666
-------------------------------------------------------------------------------
-> drug = paxlovid
  4,771
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,676

. by drug, sort: count if ae_imae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  40,555
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,859
-------------------------------------------------------------------------------
-> drug = paxlovid
  4,987
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,906

. by drug, sort: count if ae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  40,746
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,887
-------------------------------------------------------------------------------
-> drug = paxlovid
  5,010
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,939

. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. * a&e all admission
. bys drug: count if allcause_emerg_aande!=.

-------------------------------------------------------------------------------
-> drug = control
  2,026
-------------------------------------------------------------------------------
-> drug = sotrovimab
  227
-------------------------------------------------------------------------------
-> drug = paxlovid
  255
-------------------------------------------------------------------------------
-> drug = molnupiravir
  239

. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - t
> o ignore sotro initiators with mab procedure codes*
. bys drug: count if covid_hosp_date!=. // all covid hospitalisation

-------------------------------------------------------------------------------
-> drug = control
  4,022
-------------------------------------------------------------------------------
-> drug = sotrovimab
  476
-------------------------------------------------------------------------------
-> drug = paxlovid
  499
-------------------------------------------------------------------------------
-> drug = molnupiravir
  519

. bys drug: count if covid_hosp_date0!=. // hospitalisation after treatment dat
> e (control group will not have covid_hosp_date0)

-------------------------------------------------------------------------------
-> drug = control
  404
-------------------------------------------------------------------------------
-> drug = sotrovimab
  47
-------------------------------------------------------------------------------
-> drug = paxlovid
  59
-------------------------------------------------------------------------------
-> drug = molnupiravir
  37

. // covid admission is the same date as date treated 
. bys drug: count if covid_hosp_date0!=date_treated&covid_hosp_date0!=.&date_tr
> eated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  47
-------------------------------------------------------------------------------
-> drug = paxlovid
  59
-------------------------------------------------------------------------------
-> drug = molnupiravir
  37

. bys drug: count if covid_hosp_date1!=(date_treated+1) &covid_hosp_date1!=.&da
> te_treated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  55
-------------------------------------------------------------------------------
-> drug = paxlovid
  56
-------------------------------------------------------------------------------
-> drug = molnupiravir
  59

. // covid admission is the same date as date treated and is a daycase
. bys drug: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mab
> s!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mab
> s!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab and is a daycase or 24 hour admiss
> ion
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.
> &covid_hosp_date0==covid_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.
> &covid_hosp_date1==covid_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.
> &(covid_discharge_date0 - covid_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.
> &(covid_discharge_date1 - covid_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagr
> e, or dischagre preceed admission 
. count if covid_hosp_date!=.&covid_discharge_date==.
  5,454

. count if covid_hosp_date==.&covid_discharge_date!=.
  488

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date==covid_di
> scharge_date
  0

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date<covid_dis
> charge_date
  28

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date>covid_dis
> charge_date
  34

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_ho
> sp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_ho
> sp_date1!=.  
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date AND a mab procedures for sotro 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hos
> p_date_mabs!=.&drug==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hos
> p_date_mabs!=.&drug==1 
(0 real changes made)

. 
. *correcting ALL hosp events: admitted on day 0 or day 1 after treatment - to 
> ignore sotro initiators with mab procedure codes*
. bys drug: count if all_hosp_date!=. // all hospitalisation

-------------------------------------------------------------------------------
-> drug = control
  4,080
-------------------------------------------------------------------------------
-> drug = sotrovimab
  461
-------------------------------------------------------------------------------
-> drug = paxlovid
  520
-------------------------------------------------------------------------------
-> drug = molnupiravir
  517

. bys drug: count if all_hosp_date0!=. // hospitalisation after treatment date 
> (control group will not have all_hosp_date0)

-------------------------------------------------------------------------------
-> drug = control
  418
-------------------------------------------------------------------------------
-> drug = sotrovimab
  53
-------------------------------------------------------------------------------
-> drug = paxlovid
  40
-------------------------------------------------------------------------------
-> drug = molnupiravir
  52

. // admission is the same date as date treated 
. bys drug: count if all_hosp_date0!=date_treated&all_hosp_date0!=.&date_treate
> d!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  52
-------------------------------------------------------------------------------
-> drug = paxlovid
  40
-------------------------------------------------------------------------------
-> drug = molnupiravir
  52

. bys drug: count if all_hosp_date1!=(date_treated+1) &all_hosp_date1!=.&date_t
> reated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  51
-------------------------------------------------------------------------------
-> drug = paxlovid
  57
-------------------------------------------------------------------------------
-> drug = molnupiravir
  57

. // admission is the same date as date treated and is a daycase
. bys drug: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!
> =.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!
> =.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all
> _hosp_date0==hosp_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all
> _hosp_date1==hosp_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(ho
> sp_discharge_date0-all_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(ho
> sp_discharge_date1-all_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagr
> e, or dischagre preceed admission 
. count if all_hosp_date!=.&hosp_discharge_date==.
  5,010

. count if all_hosp_date==.&hosp_discharge_date!=.
  5,025

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharg
> e_date
  3

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge
> _date
  272

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge
> _date
  293

. // REPLACE - ignore covid admission if admission is for covid AND day 0 or da
> y 1 after treatment AND daycase
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =hosp_discharge_date0&all_hosp_date0!=.
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1=
> =hosp_discharge_date1&all_hosp_date1!=.
(0 real changes made)

. // REPLACE - ignore admission if admission is for covid AND day 0 or day 1 af
> ter treatment AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1=
> =covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. foreach var of varlist allcause_emerg_aande covid_hosp_date all_hosp_date die
> d_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' > start_date & `
> var' < start_date + 28) & `var'!=.                            
  4.                                 bys drug: count if (`var' < start_date | `
> var' > start_date + 28) & `var'!=.                            
  5.                                 //replace `var'=. if (`var' < start_date |
>  `var' > start_date + 28) & `var'!=.
. }
allcause_emerg_aande

-------------------------------------------------------------------------------
-> drug = control
  61
-------------------------------------------------------------------------------
-> drug = sotrovimab
  16
-------------------------------------------------------------------------------
-> drug = paxlovid
  13
-------------------------------------------------------------------------------
-> drug = molnupiravir
  16

-------------------------------------------------------------------------------
-> drug = control
  1,956
-------------------------------------------------------------------------------
-> drug = sotrovimab
  211
-------------------------------------------------------------------------------
-> drug = paxlovid
  241
-------------------------------------------------------------------------------
-> drug = molnupiravir
  223
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  153
-------------------------------------------------------------------------------
-> drug = sotrovimab
  26
-------------------------------------------------------------------------------
-> drug = paxlovid
  19
-------------------------------------------------------------------------------
-> drug = molnupiravir
  30

-------------------------------------------------------------------------------
-> drug = control
  3,864
-------------------------------------------------------------------------------
-> drug = sotrovimab
  449
-------------------------------------------------------------------------------
-> drug = paxlovid
  478
-------------------------------------------------------------------------------
-> drug = molnupiravir
  489
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  121
-------------------------------------------------------------------------------
-> drug = sotrovimab
  21
-------------------------------------------------------------------------------
-> drug = paxlovid
  24
-------------------------------------------------------------------------------
-> drug = molnupiravir
  20

-------------------------------------------------------------------------------
-> drug = control
  3,946
-------------------------------------------------------------------------------
-> drug = sotrovimab
  439
-------------------------------------------------------------------------------
-> drug = paxlovid
  495
-------------------------------------------------------------------------------
-> drug = molnupiravir
  497
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  451
-------------------------------------------------------------------------------
-> drug = sotrovimab
  86
-------------------------------------------------------------------------------
-> drug = paxlovid
  79
-------------------------------------------------------------------------------
-> drug = molnupiravir
  93

-------------------------------------------------------------------------------
-> drug = control
  23,906
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,892
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,927
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,890

. 
. ****************************
. *       COVARIATES              *
. ****************************
. *Time between positive test and treatment*
. gen pre_drug_test=3 if drug>0 & covid_test_positive_date!=. &(date_treated-co
> vid_test_positive_date>0)&(date_treated-covid_test_positive_date<21)
(55,096 missing values generated)

. replace pre_drug_test=2 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=7)
(163 real changes made)

. replace pre_drug_test=1 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5)
(117 real changes made)

. replace pre_drug_test=0 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>=0)&(date_treated-covid_test_positive_date<=3)
(96 real changes made)

. replace pre_drug_test=4 if drug>0 & (date_treated-covid_test_positive_date<0)
>  & (date_treated-covid_test_positive_date>-7)
(162 real changes made)

. replace pre_drug_test=5 if drug>0 & (covid_test_positive_date==. | (date_trea
> ted-covid_test_positive_date<=-7) | (date_treated-covid_test_positive_date>=2
> 1)) 
(14,171 real changes made)

. label define pre_drug_test 0 "<3 days" 1 "3-5 days"  2 "5-7 days" 3 ">7 days 
> & <21 days" 4 "treatment proceeds test <7 days" 5 "no test", replace 

. label values pre_drug_test pre_drug_test

. tab pre_drug_test drug,m

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
              <3 days |         0         26         38         32 |        96 
             3-5 days |         0         14         13         11 |        38 
             5-7 days |         0         19         13         14 |        46 
   >7 days & <21 days |         0         98         91        134 |       323 
treatment proceeds te |         0         49         56         57 |       162 
              no test |         0      4,681      4,799      4,691 |    14,171 
                    . |    40,746          0          0          0 |    40,746 
----------------------+--------------------------------------------+----------
                Total |    40,746      4,887      5,010      4,939 |    55,582 

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     55,582    49.01155    19.00661         18        109

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) 
> label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     20,039       36.05       36.05
      40-59 |     18,559       33.39       69.44
       >=60 |     16,984       30.56      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      5,920       10.65       10.65
        25- |      4,773        8.59       19.24
        30- |      4,758        8.56       27.80
        35- |      4,588        8.25       36.05
        40- |      4,217        7.59       43.64
        45- |      4,703        8.46       52.10
        50- |      5,098        9.17       61.27
        55- |      4,541        8.17       69.44
        60- |      3,913        7.04       76.48
        65- |      3,619        6.51       82.99
        70- |      3,404        6.12       89.12
        75- |      2,490        4.48       93.60
        80- |      1,836        3.30       96.90
        85- |      1,722        3.10      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. * Sex
. gen male = 1 if sex == "M"
(28,491 missing values generated)

. replace male = 0 if sex == "F"
(28,491 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(28,491 missing values generated)

. replace sex=1 if sex_str=="F"
(28,491 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     33,403       60.10       60.10
      Black |      2,082        3.75       63.84
      Mixed |      2,271        4.09       67.93
      Other |      2,236        4.02       71.95
South Asian |      2,221        4.00       75.95
      White |     13,369       24.05      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity                            
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. gen ethnicity_with_missing=ethnicity
(33,403 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(33,403 real changes made)

. gen White=1 if ethnicity==5
(42,213 missing values generated)

. replace White=0 if ethnicity!=5&ethnicity!=.
(8,810 real changes made)

. gen White_with_missing=White
(33,403 missing values generated)

. replace White_with_missing=9 if White==.
(33,403 real changes made)

. * IMD
. tab imdq5,m

             imdQ5 |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |     11,100       19.97       19.97
                 2 |     11,214       20.18       40.15
                 3 |     11,032       19.85       59.99
                 4 |     11,253       20.25       80.24
5 (least deprived) |     10,427       18.76       99.00
           Unknown |        556        1.00      100.00
-------------------+-----------------------------------
             Total |     55,582      100.00

. replace imdq5="." if imdq5=="Unknown" 
(556 real changes made)

. replace imdq5="1" if imdq5=="1 (most deprived)" 
(11,100 real changes made)

. replace imdq5="5" if imdq5=="5 (least deprived)" 
(10,427 real changes made)

. destring imdq5, replace
imdq5: all characters numeric; replaced as byte
(556 missing values generated)

. recode imdq5 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so 5 is more
>  deprived)
(imdq5: 43994 changes made)

. label define imdq5 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived"
> , replace

. label values imdq5 imdq5

. gen imd_with_missing=imdq5
(556 missing values generated)

. replace imd_with_missing=9 if imdq5==.
(556 real changes made)

. tab imdq5,m

           imdQ5 |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     10,427       18.76       18.76
               2 |     11,253       20.25       39.01
               3 |     11,032       19.85       58.85
               4 |     11,214       20.18       79.03
 5 most deprived |     11,100       19.97       99.00
               . |        556        1.00      100.00
-----------------+-----------------------------------
           Total |     55,582      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      5,687       10.23       10.23
           East Midlands |      5,493        9.88       20.11
                  London |     11,108       19.98       40.10
              North East |      5,441        9.79       49.89
              North West |      5,610       10.09       59.98
              South East |      5,585       10.05       70.03
              South West |      5,522        9.93       79.96
           West Midlands |      5,475        9.85       89.82
Yorkshire and The Humber |      5,661       10.18      100.00
-------------------------+-----------------------------------
                   Total |     55,582      100.00

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      5,510        9.91        9.91
           East Midlands |      5,485        9.87       19.78
                  London |     11,137       20.04       39.82
              North East |      5,547        9.98       49.80
              North West |      5,529        9.95       59.75
              South East |      5,550        9.99       69.73
              South West |      5,562       10.01       79.74
           West Midlands |      5,699       10.25       89.99
Yorkshire and The Humber |      5,563       10.01      100.00
-------------------------+-----------------------------------
                   Total |     55,582      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      5,573       10.03       10.03
      STP10 |      5,603       10.08       20.11
       STP2 |      5,480        9.86       29.97
       STP3 |      5,580       10.04       40.01
       STP4 |      5,517        9.93       49.93
       STP5 |      5,498        9.89       59.82
       STP6 |      5,555        9.99       69.82
       STP7 |      5,598       10.07       79.89
       STP8 |      5,612       10.10       89.99
       STP9 |      5,566       10.01      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Oth
> er"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      5,573       10.03       10.03
      STP10 |      5,603       10.08       20.11
       STP2 |      5,480        9.86       29.97
       STP3 |      5,580       10.04       40.01
       STP4 |      5,517        9.93       49.93
       STP5 |      5,498        9.89       59.82
       STP6 |      5,555        9.99       69.82
       STP7 |      5,598       10.07       79.89
       STP8 |      5,612       10.10       89.99
       STP9 |      5,566       10.01      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
         bmi |  26.72455  21.77021  27.59541  33.13091 -2.397207  59.99175
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(3,348 real changes made, 3,348 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*1
> 0 & (age+((bmi_date_measured-start_date)/365)>=18)
(55,582 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(55,582 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(55,582 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(3,348 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(3,348 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(3,348 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(3,348 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(3,348 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,064       90.07       90.07
          1 |      5,518        9.93      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,066       90.08       90.08
          1 |      5,516        9.92      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     49,928       89.83       89.83
          1 |      5,654       10.17      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,013       89.98       89.98
          1 |      5,569       10.02      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      5,510        9.91        9.91
          One vaccination |      5,493        9.88       19.80
       Three vaccinations |     27,938       50.26       70.06
         Two vaccinations |      5,602       10.08       80.14
            Un-vaccinated |      5,502        9.90       90.04
 Un-vaccinated (declined) |      5,537        9.96      100.00
--------------------------+-----------------------------------
                    Total |     55,582      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination
> _status_g=="Un-vaccinated (declined)"
(44,543 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(5,493 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(5,602 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(27,938 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinati
> ons"
(5,510 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two 
> vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(22,134 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(22,134 real changes made)

. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(8,086 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -442           -554
 5%         -307           -550
10%         -204           -544       Obs              47,496
25%           -1           -542       Sum of Wgt.      47,496

50%          275                      Mean           275.8562
                        Largest       Std. Dev.      357.2719
75%        551.5           1095
90%          758           1097       Variance       127643.2
95%          860           1099       Skewness        .000724
99%          994           1101       Kurtosis       2.186969

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(8,086 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -18 |          6        0.01        0.01
        -17 |         71        0.13        0.14
        -16 |        139        0.25        0.39
        -15 |        207        0.37        0.76
        -14 |        273        0.49        1.25
        -13 |        337        0.61        1.86
        -12 |        424        0.76        2.62
        -11 |        520        0.94        3.56
        -10 |        554        1.00        4.55
         -9 |        671        1.21        5.76
         -8 |        722        1.30        7.06
         -7 |        698        1.26        8.32
         -6 |        829        1.49        9.81
         -5 |        918        1.65       11.46
         -4 |        957        1.72       13.18
         -3 |      1,003        1.80       14.99
         -2 |      1,181        2.12       17.11
         -1 |      1,157        2.08       19.19
          0 |      1,250        2.25       21.44
          1 |      1,294        2.33       23.77
          2 |      1,214        2.18       25.95
          3 |      1,327        2.39       28.34
          4 |      1,252        2.25       30.59
          5 |      1,290        2.32       32.91
          6 |      1,323        2.38       35.29
          7 |      1,285        2.31       37.61
          8 |      1,309        2.36       39.96
          9 |      1,346        2.42       42.38
         10 |      1,291        2.32       44.71
         11 |      1,263        2.27       46.98
         12 |      1,325        2.38       49.36
         13 |      1,308        2.35       51.71
         14 |      1,233        2.22       53.93
         15 |      1,241        2.23       56.17
         16 |      1,310        2.36       58.52
         17 |      1,306        2.35       60.87
         18 |      1,301        2.34       63.21
         19 |      1,265        2.28       65.49
         20 |      1,220        2.19       67.68
         21 |      1,156        2.08       69.76
         22 |      1,011        1.82       71.58
         23 |      1,001        1.80       73.38
         24 |        981        1.76       75.15
         25 |        803        1.44       76.59
         26 |        760        1.37       77.96
         27 |        751        1.35       79.31
         28 |        626        1.13       80.44
         29 |        618        1.11       81.55
         30 |        523        0.94       82.49
         31 |        439        0.79       83.28
         32 |        415        0.75       84.03
         33 |        283        0.51       84.54
         34 |        220        0.40       84.93
         35 |        163        0.29       85.23
         36 |        103        0.19       85.41
         37 |         23        0.04       85.45
          . |      8,086       14.55      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)
(14,583 missing values generated)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3             -3
 5%           23             -3
10%           49             -3       Obs              40,999
25%          128             -3       Sum of Wgt.      40,999

50%          265                      Mean           267.7994
                        Largest       Std. Dev.      160.0663
75%          406            551
90%          492            551       Variance       25621.21
95%          522            551       Skewness       .0465688
99%          545            551       Kurtosis       1.799746

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)
(14,583 missing values generated)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        236        0.42        0.42
          1 |      2,411        4.34        4.76
          2 |      2,347        4.22        8.98
          3 |      2,417        4.35       13.33
          4 |      2,302        4.14       17.48
          5 |      2,213        3.98       21.46
          6 |      2,229        4.01       25.47
          7 |      2,334        4.20       29.67
          8 |      2,178        3.92       33.58
          9 |      2,247        4.04       37.63
         10 |      2,266        4.08       41.70
         11 |      2,187        3.93       45.64
         12 |      2,121        3.82       49.45
         13 |      2,116        3.81       53.26
         14 |      2,192        3.94       57.21
         15 |      2,169        3.90       61.11
         16 |      2,111        3.80       64.91
         17 |      2,082        3.75       68.65
         18 |      2,094        3.77       72.42
         19 |        747        1.34       73.76
          . |     14,583       26.24      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. * Variant
. tab sgtf,m

       sgtf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     38,962       70.10       70.10
          1 |      5,479        9.86       79.96
          9 |      5,525        9.94       89.90
          . |      5,616       10.10      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab sgtf_new, m

   sgtf_new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     39,001       70.17       70.17
          1 |      5,519        9.93       80.10
          9 |      5,494        9.88       89.98
          . |      5,568       10.02      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. tab variant_recorded,m

variant_reco |
        rded |      Freq.     Percent        Cum.
-------------+-----------------------------------
             |      5,511        9.92        9.92
   B.1.617.2 |     38,878       69.95       79.86
VOC-21JAN-02 |     11,193       20.14      100.00
-------------+-----------------------------------
       Total |     55,582      100.00

. tab sgtf_new variant_recorded ,m

                |         variant_recorded
       sgtf_new |            B.1.617.2  VOC-21J.. |     Total
----------------+---------------------------------+----------
S gene detected |     3,840     27,318      7,843 |    39,001 
 confirmed SGTF |       552      3,851      1,116 |     5,519 
             NA |       540      3,859      1,095 |     5,494 
              . |       579      3,850      1,139 |     5,568 
----------------+---------------------------------+----------
          Total |     5,511     38,878     11,193 |    55,582 

. * Prior infection
. tab prior_covid, m

prior_covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     38,836       69.87       69.87
          1 |     16,746       30.13      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. gen prior_covid_index=1 if prior_covid==1 & prior_covid_date<campaign_start
(55,486 missing values generated)

. tab prior_covid_index,m

prior_covid |
     _index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         96        0.17        0.17
          . |     55,486       99.83      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. replace prior_covid_index=0 if prior_covid_index==.
(55,486 real changes made)

. *Contraindications for Pax*
. tab drug if organ_transplant==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     12,818       73.35       73.35
  sotrovimab |      1,570        8.98       82.33
    paxlovid |      1,534        8.78       91.11
molnupiravir |      1,554        8.89      100.00
-------------+-----------------------------------
       Total |     17,476      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      4,119       73.53       73.53
  sotrovimab |        463        8.26       81.79
    paxlovid |        534        9.53       91.32
molnupiravir |        486        8.68      100.00
-------------+-----------------------------------
       Total |      5,602      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     13,965       73.08       73.08
  sotrovimab |      1,648        8.62       81.71
    paxlovid |      1,763        9.23       90.94
molnupiravir |      1,732        9.06      100.00
-------------+-----------------------------------
       Total |     19,108      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vacci
> ne-breakthrough/blob/updates-feb/analysis/data_process.R*
. tab creatinine_operator_ctv3,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      5,413        9.74        9.74
          < |      2,812        5.06       14.80
         <= |      2,793        5.03       19.82
          = |     36,320       65.34       85.17
          > |      2,755        4.96       90.12
         >= |      2,782        5.01       95.13
          ~ |      2,707        4.87      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
creat~e_ctv3 |  57.06575  48.02471  59.08957  69.70391 -9.620796  124.2143
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_c
> tv3_date>start_date
(21,489 real changes made, 21,489 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.28037  50.12043  60.18288  70.34095  20.01102  124.2143
--------------------------------------------------------------------------

. tab creatinine_operator_ctv3 if creatinine_ctv3!=.,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      3,242        9.51        9.51
          < |      1,739        5.10       14.61
         <= |      1,734        5.09       19.70
          = |     22,236       65.22       84.92
          > |      1,748        5.13       90.04
         >= |      1,729        5.07       95.12
          ~ |      1,665        4.88      100.00
------------+-----------------------------------
      Total |     34,093      100.00

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(34,093 real changes made)

. gen min_creatinine_ctv3=.
(55,582 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(17,505 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(16,588 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(9,520 real changes made)

. gen max_creatinine_ctv3=.
(55,582 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(17,505 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(16,588 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(46,062 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993
> ^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(21,887 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(17,294 real changes made)

. tab creatinine_operator_snomed,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      5,462        9.83        9.83
          < |      2,842        5.11       14.94
         <= |      2,713        4.88       19.82
          = |     36,189       65.11       84.93
          > |      2,754        4.95       89.89
         >= |      2,743        4.94       94.82
          ~ |      2,879        5.18      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab creatinine_operator_snomed if creatinine_snomed!=.,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      5,462        9.83        9.83
          < |      2,842        5.11       14.94
         <= |      2,713        4.88       19.82
          = |     36,189       65.11       84.93
          > |      2,754        4.95       89.89
         >= |      2,743        4.94       94.82
          ~ |      2,879        5.18      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    variable |      mean       p25       p50       p75       min       max
-------------+------------------------------------------------------------
cre~e_snomed |  22.42492         0         0  44.71106 -36.90638   127.439
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(39,565 real changes made, 39,565 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(crea
> tinine_snomed)
(25,481 real changes made, 5,910 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if miss
> ing(creatinine_snomed)
(21,881 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creati
> nine_snomed)
(39,112 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_sno
> med)
(39,565 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(29,283 real changes made, 29,283 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(26,299 real changes made)

. gen min_creatinine_snomed=.
(55,582 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(13,478 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(12,821 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(3,589 real changes made)

. gen max_creatinine_snomed=.
(55,582 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(13,478 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(12,821 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(51,993 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*
> (0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snome
> d<=120
(29,579 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(13,320 real changes made)

. tab egfr_operator if egfr_record!=.,m

eGFR_operat |
         or |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      5,623       10.12       10.12
          < |      2,720        4.89       15.01
         <= |      2,750        4.95       19.96
          = |     36,214       65.15       85.11
          > |      2,749        4.95       90.06
         >= |      2,745        4.94       95.00
          ~ |      2,781        5.00      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab egfr_short_operator if egfr_short_record!=.,m

eGFR_short_ |
   operator |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      5,705       10.26       10.26
          < |      2,794        5.03       15.29
         <= |      2,822        5.08       20.37
          = |     35,846       64.49       84.86
          > |      2,816        5.07       89.93
         >= |      2,793        5.03       94.95
          ~ |      2,806        5.05      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<60&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(48,267 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<30&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(53,978 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      5,359       73.26       73.26
  sotrovimab |        648        8.86       82.12
    paxlovid |        675        9.23       91.35
molnupiravir |        633        8.65      100.00
-------------+-----------------------------------
       Total |      7,315      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,151       71.76       71.76
  sotrovimab |        152        9.48       81.23
    paxlovid |        161       10.04       91.27
molnupiravir |        140        8.73      100.00
-------------+-----------------------------------
       Total |      1,604      100.00

. *drug interactions*
. tab drug if drugs_paxlovid_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     15,318       97.49       97.49
  sotrovimab |        130        0.83       98.31
    paxlovid |        141        0.90       99.21
molnupiravir |        124        0.79      100.00
-------------+-----------------------------------
       Total |     15,713      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     14,615       97.37       97.37
  sotrovimab |        130        0.87       98.23
    paxlovid |        141        0.94       99.17
molnupiravir |        124        0.83      100.00
-------------+-----------------------------------
       Total |     15,010      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     14,512       97.72       97.72
  sotrovimab |        116        0.78       98.50
    paxlovid |        116        0.78       99.28
molnupiravir |        107        0.72      100.00
-------------+-----------------------------------
       Total |     14,851      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     14,267       98.58       98.58
  sotrovimab |         67        0.46       99.04
    paxlovid |         78        0.54       99.58
molnupiravir |         61        0.42      100.00
-------------+-----------------------------------
       Total |     14,473      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     15,253       97.68       97.68
  sotrovimab |        121        0.77       98.46
    paxlovid |        116        0.74       99.20
molnupiravir |        125        0.80      100.00
-------------+-----------------------------------
       Total |     15,615      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     14,506       97.57       97.57
  sotrovimab |        121        0.81       98.38
    paxlovid |        116        0.78       99.16
molnupiravir |        125        0.84      100.00
-------------+-----------------------------------
       Total |     14,868      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     14,417       97.88       97.88
  sotrovimab |        104        0.71       98.59
    paxlovid |         99        0.67       99.26
molnupiravir |        109        0.74      100.00
-------------+-----------------------------------
       Total |     14,729      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     14,170       98.69       98.69
  sotrovimab |         63        0.44       99.13
    paxlovid |         60        0.42       99.55
molnupiravir |         65        0.45      100.00
-------------+-----------------------------------
       Total |     14,358      100.00

. gen paxlovid_interaction=(drugs_paxlovid_interaction<=start_date&drugs_paxlov
> id_interaction>=(start_date-180))  

. gen nirmatrelvir_interaction=(drugs_nirmatrelvir_interaction<=start_date&drug
> s_nirmatrelvir_interaction>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contraindicated = 1 if egfr_30==1 | dialysis==1
(48,598 missing values generated)

. replace paxlovid_contraindicated = 1 if liver_disease==1 
(9,270 real changes made)

. replace paxlovid_contraindicated = 1 if organ_transplant==1 
(12,330 real changes made)

. replace paxlovid_contraindicated = 1 if drugs_paxlovid_interaction<=start_dat
> e&drugs_paxlovid_interaction>=(start_date-180)
(7,018 real changes made)

. recode paxlovid_contraindicated . = 0
(paxlovid_contraindicated: 19980 changes made)

. by drug, sort: count if paxlovid_contraindicated==1

-------------------------------------------------------------------------------
-> drug = control
  27,852
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,557
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,610
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,583

. 
. ****************************
. *       COX MODEL               *
. ****************************
. global ae               ae_spc_all                              ///
>                                 ae_drug_all                             ///  
>            
>                                 ae_imae_all                     ///          
>                    
>                                 ae_all                                  ///
>                                 allcause_emerg_aande    ///
>                                 covid_hosp_date                 ///
>                                 all_hosp_date                   ///
>                                 died_date_ons

. * Generate failure 
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         by drug, sort: count if `x'!=.
  4.         by drug, sort: count if `x'>start_date & `x'!=.
  5.         by drug, sort: count if `x'>=start_date & `x'<start_date_29 &`x'!=
> .
  6.         gen fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, paxl
> ovid, molnupiravir)) if drug==1
  7.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, 
> sotrovimab, molnupiravir)) if drug==2
  8.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, 
> sotrovimab, paxlovid)) if drug==3
  9.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, 
> sotrovimab, paxlovid, molnupiravir)) if drug==0
 10.         tab drug fail_`x', m
 11.         tab drug fail_`x' if `x'>start_date
 12. }
ae_spc_all

-------------------------------------------------------------------------------
-> drug = control
  38,848
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,668
-------------------------------------------------------------------------------
-> drug = paxlovid
  4,778
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,707

-------------------------------------------------------------------------------
-> drug = control
  8,062
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,617
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,663
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,622

-------------------------------------------------------------------------------
-> drug = control
  8,094
-------------------------------------------------------------------------------
-> drug = sotrovimab
  240
-------------------------------------------------------------------------------
-> drug = paxlovid
  259
-------------------------------------------------------------------------------
-> drug = molnupiravir
  232
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     2,168     38,578 |    40,746 
  sotrovimab |     1,611      3,276 |     4,887 
    paxlovid |     1,645      3,365 |     5,010 
molnupiravir |     1,637      3,302 |     4,939 
-------------+----------------------+----------
       Total |     7,061     48,521 |    55,582 

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     1,376      7,895 |     9,271 
  sotrovimab |     1,604        232 |     1,836 
    paxlovid |     1,642        253 |     1,895 
molnupiravir |     1,633        221 |     1,854 
-------------+----------------------+----------
       Total |     6,255      8,601 |    14,856 
ae_drug_all

-------------------------------------------------------------------------------
-> drug = control
  38,853
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,666
-------------------------------------------------------------------------------
-> drug = paxlovid
  4,771
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,676

-------------------------------------------------------------------------------
-> drug = control
  8,040
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,580
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,686
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,616

-------------------------------------------------------------------------------
-> drug = control
  8,077
-------------------------------------------------------------------------------
-> drug = sotrovimab
  239
-------------------------------------------------------------------------------
-> drug = paxlovid
  241
-------------------------------------------------------------------------------
-> drug = molnupiravir
  257
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |   fail_ae_drug_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     2,168     38,578 |    40,746 
  sotrovimab |     1,579      3,308 |     4,887 
    paxlovid |     1,691      3,319 |     5,010 
molnupiravir |     1,628      3,311 |     4,939 
-------------+----------------------+----------
       Total |     7,066     48,516 |    55,582 

             |   fail_ae_drug_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     1,414      7,868 |     9,282 
  sotrovimab |     1,573        228 |     1,801 
    paxlovid |     1,690        235 |     1,925 
molnupiravir |     1,625        254 |     1,879 
-------------+----------------------+----------
       Total |     6,302      8,585 |    14,887 
ae_imae_all

-------------------------------------------------------------------------------
-> drug = control
  40,555
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,859
-------------------------------------------------------------------------------
-> drug = paxlovid
  4,987
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,906

-------------------------------------------------------------------------------
-> drug = control
  5,277
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,076
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,097
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,060

-------------------------------------------------------------------------------
-> drug = control
  5,323
-------------------------------------------------------------------------------
-> drug = sotrovimab
  242
-------------------------------------------------------------------------------
-> drug = paxlovid
  263
-------------------------------------------------------------------------------
-> drug = molnupiravir
  249
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |       226     40,520 |    40,746 
  sotrovimab |       870      4,017 |     4,887 
    paxlovid |       867      4,143 |     5,010 
molnupiravir |       851      4,088 |     4,939 
-------------+----------------------+----------
       Total |     2,814     52,768 |    55,582 

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |       151      5,256 |     5,407 
  sotrovimab |       867        237 |     1,104 
    paxlovid |       864        256 |     1,120 
molnupiravir |       848        245 |     1,093 
-------------+----------------------+----------
       Total |     2,730      5,994 |     8,724 
ae_all

-------------------------------------------------------------------------------
-> drug = control
  40,746
-------------------------------------------------------------------------------
-> drug = sotrovimab
  4,887
-------------------------------------------------------------------------------
-> drug = paxlovid
  5,010
-------------------------------------------------------------------------------
-> drug = molnupiravir
  4,939

-------------------------------------------------------------------------------
-> drug = control
  2,925
-------------------------------------------------------------------------------
-> drug = sotrovimab
  565
-------------------------------------------------------------------------------
-> drug = paxlovid
  610
-------------------------------------------------------------------------------
-> drug = molnupiravir
  563

-------------------------------------------------------------------------------
-> drug = control
  2,963
-------------------------------------------------------------------------------
-> drug = sotrovimab
  219
-------------------------------------------------------------------------------
-> drug = paxlovid
  240
-------------------------------------------------------------------------------
-> drug = molnupiravir
  216
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |         0     40,746 |    40,746 
  sotrovimab |       350      4,537 |     4,887 
    paxlovid |       376      4,634 |     5,010 
molnupiravir |       358      4,581 |     4,939 
-------------+----------------------+----------
       Total |     1,084     54,498 |    55,582 

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |         0      2,925 |     2,925 
  sotrovimab |       348        217 |       565 
    paxlovid |       375        235 |       610 
molnupiravir |       356        207 |       563 
-------------+----------------------+----------
       Total |     1,079      3,584 |     4,663 
allcause_emerg_aande

-------------------------------------------------------------------------------
-> drug = control
  2,026
-------------------------------------------------------------------------------
-> drug = sotrovimab
  227
-------------------------------------------------------------------------------
-> drug = paxlovid
  255
-------------------------------------------------------------------------------
-> drug = molnupiravir
  239

-------------------------------------------------------------------------------
-> drug = control
  722
-------------------------------------------------------------------------------
-> drug = sotrovimab
  134
-------------------------------------------------------------------------------
-> drug = paxlovid
  158
-------------------------------------------------------------------------------
-> drug = molnupiravir
  146

-------------------------------------------------------------------------------
-> drug = control
  727
-------------------------------------------------------------------------------
-> drug = sotrovimab
  16
-------------------------------------------------------------------------------
-> drug = paxlovid
  14
-------------------------------------------------------------------------------
-> drug = molnupiravir
  16
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_allcause_emerg_a
             |         ande
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    38,802      1,944 |    40,746 
  sotrovimab |     4,779        108 |     4,887 
    paxlovid |     4,898        112 |     5,010 
molnupiravir |     4,831        108 |     4,939 
-------------+----------------------+----------
       Total |    53,310      2,272 |    55,582 

             | fail_allcause_emerg_a
             |         ande
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,920        666 |    25,586 
  sotrovimab |     4,779         15 |     4,794 
    paxlovid |     4,898         15 |     4,913 
molnupiravir |     4,830         16 |     4,846 
-------------+----------------------+----------
       Total |    39,427        712 |    40,139 
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  4,022
-------------------------------------------------------------------------------
-> drug = sotrovimab
  476
-------------------------------------------------------------------------------
-> drug = paxlovid
  499
-------------------------------------------------------------------------------
-> drug = molnupiravir
  519

-------------------------------------------------------------------------------
-> drug = control
  1,474
-------------------------------------------------------------------------------
-> drug = sotrovimab
  290
-------------------------------------------------------------------------------
-> drug = paxlovid
  303
-------------------------------------------------------------------------------
-> drug = molnupiravir
  311

-------------------------------------------------------------------------------
-> drug = control
  1,476
-------------------------------------------------------------------------------
-> drug = sotrovimab
  27
-------------------------------------------------------------------------------
-> drug = paxlovid
  18
-------------------------------------------------------------------------------
-> drug = molnupiravir
  31
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_covid_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    36,878      3,868 |    40,746 
  sotrovimab |     4,675        212 |     4,887 
    paxlovid |     4,795        215 |     5,010 
molnupiravir |     4,701        238 |     4,939 
-------------+----------------------+----------
       Total |    51,049      4,533 |    55,582 

             | fail_covid_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    23,714      1,367 |    25,081 
  sotrovimab |     4,675         26 |     4,701 
    paxlovid |     4,794         20 |     4,814 
molnupiravir |     4,701         30 |     4,731 
-------------+----------------------+----------
       Total |    37,884      1,443 |    39,327 
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  4,080
-------------------------------------------------------------------------------
-> drug = sotrovimab
  461
-------------------------------------------------------------------------------
-> drug = paxlovid
  520
-------------------------------------------------------------------------------
-> drug = molnupiravir
  517

-------------------------------------------------------------------------------
-> drug = control
  1,485
-------------------------------------------------------------------------------
-> drug = sotrovimab
  272
-------------------------------------------------------------------------------
-> drug = paxlovid
  320
-------------------------------------------------------------------------------
-> drug = molnupiravir
  303

-------------------------------------------------------------------------------
-> drug = control
  1,491
-------------------------------------------------------------------------------
-> drug = sotrovimab
  22
-------------------------------------------------------------------------------
-> drug = paxlovid
  25
-------------------------------------------------------------------------------
-> drug = molnupiravir
  21
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_all_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    36,819      3,927 |    40,746 
  sotrovimab |     4,678        209 |     4,887 
    paxlovid |     4,790        220 |     5,010 
molnupiravir |     4,704        235 |     4,939 
-------------+----------------------+----------
       Total |    50,991      4,591 |    55,582 

             |  fail_all_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    23,601      1,389 |    24,990 
  sotrovimab |     4,677         21 |     4,698 
    paxlovid |     4,789         21 |     4,810 
molnupiravir |     4,704         21 |     4,725 
-------------+----------------------+----------
       Total |    37,771      1,452 |    39,223 
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  24,385
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,986
-------------------------------------------------------------------------------
-> drug = paxlovid
  3,015
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,992

-------------------------------------------------------------------------------
-> drug = control
  4,836
-------------------------------------------------------------------------------
-> drug = sotrovimab
  949
-------------------------------------------------------------------------------
-> drug = paxlovid
  958
-------------------------------------------------------------------------------
-> drug = molnupiravir
  950

-------------------------------------------------------------------------------
-> drug = control
  4,845
-------------------------------------------------------------------------------
-> drug = sotrovimab
  92
-------------------------------------------------------------------------------
-> drug = paxlovid
  87
-------------------------------------------------------------------------------
-> drug = molnupiravir
  99
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_died_date_ons
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,822     23,924 |    40,746 
  sotrovimab |     2,762      2,125 |     4,887 
    paxlovid |     2,873      2,137 |     5,010 
molnupiravir |     2,805      2,134 |     4,939 
-------------+----------------------+----------
       Total |    25,262     30,320 |    55,582 

             |  fail_died_date_ons
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    10,765      4,538 |    15,303 
  sotrovimab |     2,761         89 |     2,850 
    paxlovid |     2,873         80 |     2,953 
molnupiravir |     2,802         95 |     2,897 
-------------+----------------------+----------
       Total |    19,201      4,802 |    24,003 
ae_diverticulitis_snomed

-------------------------------------------------------------------------------
-> drug = control
  16,285
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,984
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,025
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,953

-------------------------------------------------------------------------------
-> drug = control
  5,348
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,074
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,033
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,020

-------------------------------------------------------------------------------
-> drug = control
  5,360
-------------------------------------------------------------------------------
-> drug = sotrovimab
  95
-------------------------------------------------------------------------------
-> drug = paxlovid
  105
-------------------------------------------------------------------------------
-> drug = molnupiravir
  98
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,992     15,754 |    40,746 
  sotrovimab |     3,895        992 |     4,887 
    paxlovid |     3,920      1,090 |     5,010 
molnupiravir |     3,913      1,026 |     4,939 
-------------+----------------------+----------
       Total |    36,720     18,862 |    55,582 

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,033      4,998 |    21,031 
  sotrovimab |     3,890         87 |     3,977 
    paxlovid |     3,916        102 |     4,018 
molnupiravir |     3,913         93 |     4,006 
-------------+----------------------+----------
       Total |    27,752      5,280 |    33,032 
ae_diarrhoea_snomed

-------------------------------------------------------------------------------
-> drug = control
  16,561
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,924
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,966
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,980

-------------------------------------------------------------------------------
-> drug = control
  5,360
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,039
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,050
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,001

-------------------------------------------------------------------------------
-> drug = control
  5,375
-------------------------------------------------------------------------------
-> drug = sotrovimab
  80
-------------------------------------------------------------------------------
-> drug = paxlovid
  110
-------------------------------------------------------------------------------
-> drug = molnupiravir
  99
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,715     16,031 |    40,746 
  sotrovimab |     3,929        958 |     4,887 
    paxlovid |     3,993      1,017 |     5,010 
molnupiravir |     3,869      1,070 |     4,939 
-------------+----------------------+----------
       Total |    36,506     19,076 |    55,582 

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    15,898      5,022 |    20,920 
  sotrovimab |     3,926         76 |     4,002 
    paxlovid |     3,992        102 |     4,094 
molnupiravir |     3,864         96 |     3,960 
-------------+----------------------+----------
       Total |    27,680      5,296 |    32,976 
ae_taste_snomed

-------------------------------------------------------------------------------
-> drug = control
  16,447
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,928
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,031
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,925

-------------------------------------------------------------------------------
-> drug = control
  5,273
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,009
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,065
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,049

-------------------------------------------------------------------------------
-> drug = control
  5,290
-------------------------------------------------------------------------------
-> drug = sotrovimab
  102
-------------------------------------------------------------------------------
-> drug = paxlovid
  109
-------------------------------------------------------------------------------
-> drug = molnupiravir
  86
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,821     15,925 |    40,746 
  sotrovimab |     3,870      1,017 |     4,887 
    paxlovid |     3,943      1,067 |     5,010 
molnupiravir |     3,979        960 |     4,939 
-------------+----------------------+----------
       Total |    36,613     18,969 |    55,582 

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    15,956      4,957 |    20,913 
  sotrovimab |     3,868        100 |     3,968 
    paxlovid |     3,939        105 |     4,044 
molnupiravir |     3,977         86 |     4,063 
-------------+----------------------+----------
       Total |    27,740      5,248 |    32,988 
ae_diverticulitis_icd

-------------------------------------------------------------------------------
-> drug = control
  16,384
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,940
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,008
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,029

-------------------------------------------------------------------------------
-> drug = control
  5,409
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,024
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,073
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,085

-------------------------------------------------------------------------------
-> drug = control
  5,429
-------------------------------------------------------------------------------
-> drug = sotrovimab
  87
-------------------------------------------------------------------------------
-> drug = paxlovid
  118
-------------------------------------------------------------------------------
-> drug = molnupiravir
  91
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_diverticuliti
             |         s_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,931     15,815 |    40,746 
  sotrovimab |     3,892        995 |     4,887 
    paxlovid |     3,975      1,035 |     5,010 
molnupiravir |     3,915      1,024 |     4,939 
-------------+----------------------+----------
       Total |    36,713     18,869 |    55,582 

             | fail_ae_diverticuliti
             |         s_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    15,995      5,049 |    21,044 
  sotrovimab |     3,888         83 |     3,971 
    paxlovid |     3,972        103 |     4,075 
molnupiravir |     3,909         86 |     3,995 
-------------+----------------------+----------
       Total |    27,764      5,321 |    33,085 
ae_taste_icd

-------------------------------------------------------------------------------
-> drug = control
  16,414
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,968
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,972
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,981

-------------------------------------------------------------------------------
-> drug = control
  5,376
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,098
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,054
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,048

-------------------------------------------------------------------------------
-> drug = control
  5,396
-------------------------------------------------------------------------------
-> drug = sotrovimab
  101
-------------------------------------------------------------------------------
-> drug = paxlovid
  106
-------------------------------------------------------------------------------
-> drug = molnupiravir
  91
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |   fail_ae_taste_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,897     15,849 |    40,746 
  sotrovimab |     3,921        966 |     4,887 
    paxlovid |     3,996      1,014 |     5,010 
molnupiravir |     3,914      1,025 |     4,939 
-------------+----------------------+----------
       Total |    36,728     18,854 |    55,582 

             |   fail_ae_taste_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,024      5,008 |    21,032 
  sotrovimab |     3,918         99 |     4,017 
    paxlovid |     3,993         99 |     4,092 
molnupiravir |     3,914         92 |     4,006 
-------------+----------------------+----------
       Total |    27,849      5,298 |    33,147 
ae_diverticulitis_ae

-------------------------------------------------------------------------------
-> drug = control
  16,351
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,925
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,031
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,992

-------------------------------------------------------------------------------
-> drug = control
  5,365
-------------------------------------------------------------------------------
-> drug = sotrovimab
  991
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,062
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,049

-------------------------------------------------------------------------------
-> drug = control
  5,384
-------------------------------------------------------------------------------
-> drug = sotrovimab
  90
-------------------------------------------------------------------------------
-> drug = paxlovid
  97
-------------------------------------------------------------------------------
-> drug = molnupiravir
  93
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_diverticuliti
             |         s_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,917     15,829 |    40,746 
  sotrovimab |     3,866      1,021 |     4,887 
    paxlovid |     3,950      1,060 |     5,010 
molnupiravir |     3,911      1,028 |     4,939 
-------------+----------------------+----------
       Total |    36,644     18,938 |    55,582 

             | fail_ae_diverticuliti
             |         s_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,009      5,031 |    21,040 
  sotrovimab |     3,861         92 |     3,953 
    paxlovid |     3,949         92 |     4,041 
molnupiravir |     3,910         86 |     3,996 
-------------+----------------------+----------
       Total |    27,729      5,301 |    33,030 
ae_anaphylaxis_snomed

-------------------------------------------------------------------------------
-> drug = control
  16,156
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,990
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,014
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,963

-------------------------------------------------------------------------------
-> drug = control
  5,243
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,060
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,119
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,024

-------------------------------------------------------------------------------
-> drug = control
  5,260
-------------------------------------------------------------------------------
-> drug = sotrovimab
  110
-------------------------------------------------------------------------------
-> drug = paxlovid
  123
-------------------------------------------------------------------------------
-> drug = molnupiravir
  97
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,139     15,607 |    40,746 
  sotrovimab |     3,857      1,030 |     4,887 
    paxlovid |     4,000      1,010 |     5,010 
molnupiravir |     3,910      1,029 |     4,939 
-------------+----------------------+----------
       Total |    36,906     18,676 |    55,582 

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,168      4,899 |    21,067 
  sotrovimab |     3,855        102 |     3,957 
    paxlovid |     3,997        118 |     4,115 
molnupiravir |     3,907         93 |     4,000 
-------------+----------------------+----------
       Total |    27,927      5,212 |    33,139 
ae_rash_snomed

-------------------------------------------------------------------------------
-> drug = control
  16,256
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,964
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,994
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,940

-------------------------------------------------------------------------------
-> drug = control
  5,250
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,030
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,005
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,017

-------------------------------------------------------------------------------
-> drug = control
  5,269
-------------------------------------------------------------------------------
-> drug = sotrovimab
  93
-------------------------------------------------------------------------------
-> drug = paxlovid
  93
-------------------------------------------------------------------------------
-> drug = molnupiravir
  93
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_ae_rash_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,022     15,724 |    40,746 
  sotrovimab |     3,866      1,021 |     4,887 
    paxlovid |     3,937      1,073 |     5,010 
molnupiravir |     3,932      1,007 |     4,939 
-------------+----------------------+----------
       Total |    36,757     18,825 |    55,582 

             |  fail_ae_rash_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,049      4,909 |    20,958 
  sotrovimab |     3,865         88 |     3,953 
    paxlovid |     3,936         85 |     4,021 
molnupiravir |     3,929         87 |     4,016 
-------------+----------------------+----------
       Total |    27,779      5,169 |    32,948 
ae_anaphylaxis_icd

-------------------------------------------------------------------------------
-> drug = control
  16,230
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,927
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,007
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,973

-------------------------------------------------------------------------------
-> drug = control
  5,201
-------------------------------------------------------------------------------
-> drug = sotrovimab
  990
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,070
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,073

-------------------------------------------------------------------------------
-> drug = control
  5,222
-------------------------------------------------------------------------------
-> drug = sotrovimab
  88
-------------------------------------------------------------------------------
-> drug = paxlovid
  90
-------------------------------------------------------------------------------
-> drug = molnupiravir
  120
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_anaphylaxis_i
             |          cd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,068     15,678 |    40,746 
  sotrovimab |     3,872      1,015 |     4,887 
    paxlovid |     3,985      1,025 |     5,010 
molnupiravir |     3,929      1,010 |     4,939 
-------------+----------------------+----------
       Total |    36,854     18,728 |    55,582 

             | fail_ae_anaphylaxis_i
             |          cd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,138      4,858 |    20,996 
  sotrovimab |     3,867         83 |     3,950 
    paxlovid |     3,984         89 |     4,073 
molnupiravir |     3,926        113 |     4,039 
-------------+----------------------+----------
       Total |    27,915      5,143 |    33,058 
ae_anaphlaxis_ae

-------------------------------------------------------------------------------
-> drug = control
  16,152
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,948
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,986
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,910

-------------------------------------------------------------------------------
-> drug = control
  5,159
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,012
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,097
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,032

-------------------------------------------------------------------------------
-> drug = control
  5,180
-------------------------------------------------------------------------------
-> drug = sotrovimab
  105
-------------------------------------------------------------------------------
-> drug = paxlovid
  97
-------------------------------------------------------------------------------
-> drug = molnupiravir
  97
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_anaphlaxis_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,124     15,622 |    40,746 
  sotrovimab |     3,853      1,034 |     4,887 
    paxlovid |     4,026        984 |     5,010 
molnupiravir |     3,967        972 |     4,939 
-------------+----------------------+----------
       Total |    36,970     18,612 |    55,582 

             | fail_ae_anaphlaxis_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,106      4,824 |    20,930 
  sotrovimab |     3,845        106 |     3,951 
    paxlovid |     4,025         96 |     4,121 
molnupiravir |     3,965         96 |     4,061 
-------------+----------------------+----------
       Total |    27,941      5,122 |    33,063 
ae_drugreact_ae

-------------------------------------------------------------------------------
-> drug = control
  16,304
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,932
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,990
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,927

-------------------------------------------------------------------------------
-> drug = control
  5,157
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,014
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,103
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,057

-------------------------------------------------------------------------------
-> drug = control
  5,174
-------------------------------------------------------------------------------
-> drug = sotrovimab
  99
-------------------------------------------------------------------------------
-> drug = paxlovid
  101
-------------------------------------------------------------------------------
-> drug = molnupiravir
  121
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_ae_drugreact_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    24,953     15,793 |    40,746 
  sotrovimab |     3,881      1,006 |     4,887 
    paxlovid |     4,034        976 |     5,010 
molnupiravir |     3,962        977 |     4,939 
-------------+----------------------+----------
       Total |    36,830     18,752 |    55,582 

             | fail_ae_drugreact_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,117      4,847 |    20,964 
  sotrovimab |     3,875         94 |     3,969 
    paxlovid |     4,033         90 |     4,123 
molnupiravir |     3,957        112 |     4,069 
-------------+----------------------+----------
       Total |    27,982      5,143 |    33,125 
ae_allergic_ae

-------------------------------------------------------------------------------
-> drug = control
  16,291
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,957
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,019
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,935

-------------------------------------------------------------------------------
-> drug = control
  5,266
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,026
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,075
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,057

-------------------------------------------------------------------------------
-> drug = control
  5,286
-------------------------------------------------------------------------------
-> drug = sotrovimab
  104
-------------------------------------------------------------------------------
-> drug = paxlovid
  102
-------------------------------------------------------------------------------
-> drug = molnupiravir
  92
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_ae_allergic_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    25,021     15,725 |    40,746 
  sotrovimab |     3,860      1,027 |     4,887 
    paxlovid |     3,971      1,039 |     5,010 
molnupiravir |     3,969        970 |     4,939 
-------------+----------------------+----------
       Total |    36,821     18,761 |    55,582 

             |  fail_ae_allergic_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,080      4,914 |    20,994 
  sotrovimab |     3,855        101 |     3,956 
    paxlovid |     3,970         96 |     4,066 
molnupiravir |     3,967         94 |     4,061 
-------------+----------------------+----------
       Total |    27,872      5,205 |    33,077 
new_ae_ra_snomed

-------------------------------------------------------------------------------
-> drug = control
  13,207
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,605
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,637
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,646

-------------------------------------------------------------------------------
-> drug = control
  4,264
-------------------------------------------------------------------------------
-> drug = sotrovimab
  858
-------------------------------------------------------------------------------
-> drug = paxlovid
  866
-------------------------------------------------------------------------------
-> drug = molnupiravir
  874

-------------------------------------------------------------------------------
-> drug = control
  4,281
-------------------------------------------------------------------------------
-> drug = sotrovimab
  82
-------------------------------------------------------------------------------
-> drug = paxlovid
  100
-------------------------------------------------------------------------------
-> drug = molnupiravir
  74
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    27,985     12,761 |    40,746 
  sotrovimab |     4,062        825 |     4,887 
    paxlovid |     4,154        856 |     5,010 
molnupiravir |     4,100        839 |     4,939 
-------------+----------------------+----------
       Total |    40,301     15,281 |    55,582 

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    17,927      3,982 |    21,909 
  sotrovimab |     4,061         79 |     4,140 
    paxlovid |     4,151         88 |     4,239 
molnupiravir |     4,097         70 |     4,167 
-------------+----------------------+----------
       Total |    30,236      4,219 |    34,455 
new_ae_sle_ctv

-------------------------------------------------------------------------------
-> drug = control
  13,221
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,552
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,614
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,647

-------------------------------------------------------------------------------
-> drug = control
  4,235
-------------------------------------------------------------------------------
-> drug = sotrovimab
  835
-------------------------------------------------------------------------------
-> drug = paxlovid
  873
-------------------------------------------------------------------------------
-> drug = molnupiravir
  887

-------------------------------------------------------------------------------
-> drug = control
  4,252
-------------------------------------------------------------------------------
-> drug = sotrovimab
  86
-------------------------------------------------------------------------------
-> drug = paxlovid
  74
-------------------------------------------------------------------------------
-> drug = molnupiravir
  89
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    27,972     12,774 |    40,746 
  sotrovimab |     4,090        797 |     4,887 
    paxlovid |     4,200        810 |     5,010 
molnupiravir |     4,094        845 |     4,939 
-------------+----------------------+----------
       Total |    40,356     15,226 |    55,582 

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    17,962      3,952 |    21,914 
  sotrovimab |     4,086         84 |     4,170 
    paxlovid |     4,199         70 |     4,269 
molnupiravir |     4,093         86 |     4,179 
-------------+----------------------+----------
       Total |    30,340      4,192 |    34,532 
new_ae_psoriasis_snomed

-------------------------------------------------------------------------------
-> drug = control
  14,567
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,713
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,793
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,745

-------------------------------------------------------------------------------
-> drug = control
  4,710
-------------------------------------------------------------------------------
-> drug = sotrovimab
  911
-------------------------------------------------------------------------------
-> drug = paxlovid
  941
-------------------------------------------------------------------------------
-> drug = molnupiravir
  922

-------------------------------------------------------------------------------
-> drug = control
  4,733
-------------------------------------------------------------------------------
-> drug = sotrovimab
  88
-------------------------------------------------------------------------------
-> drug = paxlovid
  96
-------------------------------------------------------------------------------
-> drug = molnupiravir
  76
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,633     14,113 |    40,746 
  sotrovimab |     4,004        883 |     4,887 
    paxlovid |     4,077        933 |     5,010 
molnupiravir |     4,040        899 |     4,939 
-------------+----------------------+----------
       Total |    38,754     16,828 |    55,582 

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    17,088      4,423 |    21,511 
  sotrovimab |     4,001         84 |     4,085 
    paxlovid |     4,070         88 |     4,158 
molnupiravir |     4,040         76 |     4,116 
-------------+----------------------+----------
       Total |    29,199      4,671 |    33,870 
new_ae_psa_snomed

-------------------------------------------------------------------------------
-> drug = control
  14,669
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,752
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,802
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,786

-------------------------------------------------------------------------------
-> drug = control
  4,857
-------------------------------------------------------------------------------
-> drug = sotrovimab
  933
-------------------------------------------------------------------------------
-> drug = paxlovid
  933
-------------------------------------------------------------------------------
-> drug = molnupiravir
  956

-------------------------------------------------------------------------------
-> drug = control
  4,869
-------------------------------------------------------------------------------
-> drug = sotrovimab
  76
-------------------------------------------------------------------------------
-> drug = paxlovid
  94
-------------------------------------------------------------------------------
-> drug = molnupiravir
  80
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,545     14,201 |    40,746 
  sotrovimab |     3,997        890 |     4,887 
    paxlovid |     4,050        960 |     5,010 
molnupiravir |     4,036        903 |     4,939 
-------------+----------------------+----------
       Total |    38,628     16,954 |    55,582 

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,988      4,567 |    21,555 
  sotrovimab |     3,996         72 |     4,068 
    paxlovid |     4,050         91 |     4,141 
molnupiravir |     4,034         75 |     4,109 
-------------+----------------------+----------
       Total |    29,068      4,805 |    33,873 
new_ae_ankspon_ctv

-------------------------------------------------------------------------------
-> drug = control
  14,566
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,730
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,804
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,779

-------------------------------------------------------------------------------
-> drug = control
  4,736
-------------------------------------------------------------------------------
-> drug = sotrovimab
  922
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,029
-------------------------------------------------------------------------------
-> drug = molnupiravir
  933

-------------------------------------------------------------------------------
-> drug = control
  4,749
-------------------------------------------------------------------------------
-> drug = sotrovimab
  107
-------------------------------------------------------------------------------
-> drug = paxlovid
  98
-------------------------------------------------------------------------------
-> drug = molnupiravir
  95
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,673     14,073 |    40,746 
  sotrovimab |     3,985        902 |     4,887 
    paxlovid |     4,142        868 |     5,010 
molnupiravir |     4,010        929 |     4,939 
-------------+----------------------+----------
       Total |    38,810     16,772 |    55,582 

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    17,090      4,421 |    21,511 
  sotrovimab |     3,982         97 |     4,079 
    paxlovid |     4,141         94 |     4,235 
molnupiravir |     4,009         84 |     4,093 
-------------+----------------------+----------
       Total |    29,222      4,696 |    33,918 
new_ae_ibd_snomed

-------------------------------------------------------------------------------
-> drug = control
  14,684
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,791
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,770
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,781

-------------------------------------------------------------------------------
-> drug = control
  4,704
-------------------------------------------------------------------------------
-> drug = sotrovimab
  976
-------------------------------------------------------------------------------
-> drug = paxlovid
  951
-------------------------------------------------------------------------------
-> drug = molnupiravir
  941

-------------------------------------------------------------------------------
-> drug = control
  4,726
-------------------------------------------------------------------------------
-> drug = sotrovimab
  96
-------------------------------------------------------------------------------
-> drug = paxlovid
  88
-------------------------------------------------------------------------------
-> drug = molnupiravir
  89
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,532     14,214 |    40,746 
  sotrovimab |     3,980        907 |     4,887 
    paxlovid |     4,109        901 |     5,010 
molnupiravir |     4,014        925 |     4,939 
-------------+----------------------+----------
       Total |    38,635     16,947 |    55,582 

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,990      4,405 |    21,395 
  sotrovimab |     3,978         94 |     4,072 
    paxlovid |     4,108         83 |     4,191 
molnupiravir |     4,011         88 |     4,099 
-------------+----------------------+----------
       Total |    29,087      4,670 |    33,757 
new_ae_ra_icd

-------------------------------------------------------------------------------
-> drug = control
  13,055
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,574
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,577
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,590

-------------------------------------------------------------------------------
-> drug = control
  4,173
-------------------------------------------------------------------------------
-> drug = sotrovimab
  862
-------------------------------------------------------------------------------
-> drug = paxlovid
  847
-------------------------------------------------------------------------------
-> drug = molnupiravir
  814

-------------------------------------------------------------------------------
-> drug = control
  4,188
-------------------------------------------------------------------------------
-> drug = sotrovimab
  78
-------------------------------------------------------------------------------
-> drug = paxlovid
  80
-------------------------------------------------------------------------------
-> drug = molnupiravir
  90
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_new_ae_ra_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    28,113     12,633 |    40,746 
  sotrovimab |     4,107        780 |     4,887 
    paxlovid |     4,201        809 |     5,010 
molnupiravir |     4,078        861 |     4,939 
-------------+----------------------+----------
       Total |    40,499     15,083 |    55,582 

             |  fail_new_ae_ra_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    18,022      3,909 |    21,931 
  sotrovimab |     4,106         69 |     4,175 
    paxlovid |     4,201         79 |     4,280 
molnupiravir |     4,076         87 |     4,163 
-------------+----------------------+----------
       Total |    30,405      4,144 |    34,549 
new_ae_sle_icd

-------------------------------------------------------------------------------
-> drug = control
  13,076
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,564
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,694
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,623

-------------------------------------------------------------------------------
-> drug = control
  4,250
-------------------------------------------------------------------------------
-> drug = sotrovimab
  842
-------------------------------------------------------------------------------
-> drug = paxlovid
  899
-------------------------------------------------------------------------------
-> drug = molnupiravir
  860

-------------------------------------------------------------------------------
-> drug = control
  4,270
-------------------------------------------------------------------------------
-> drug = sotrovimab
  75
-------------------------------------------------------------------------------
-> drug = paxlovid
  103
-------------------------------------------------------------------------------
-> drug = molnupiravir
  96
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_new_ae_sle_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    28,090     12,656 |    40,746 
  sotrovimab |     4,101        786 |     4,887 
    paxlovid |     4,113        897 |     5,010 
molnupiravir |     4,088        851 |     4,939 
-------------+----------------------+----------
       Total |    40,392     15,190 |    55,582 

             |  fail_new_ae_sle_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    18,047      3,986 |    22,033 
  sotrovimab |     4,094         71 |     4,165 
    paxlovid |     4,112        103 |     4,215 
molnupiravir |     4,086         90 |     4,176 
-------------+----------------------+----------
       Total |    30,339      4,250 |    34,589 
new_ae_ra_ae

-------------------------------------------------------------------------------
-> drug = control
  13,157
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,519
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,594
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,603

-------------------------------------------------------------------------------
-> drug = control
  4,205
-------------------------------------------------------------------------------
-> drug = sotrovimab
  787
-------------------------------------------------------------------------------
-> drug = paxlovid
  848
-------------------------------------------------------------------------------
-> drug = molnupiravir
  858

-------------------------------------------------------------------------------
-> drug = control
  4,220
-------------------------------------------------------------------------------
-> drug = sotrovimab
  79
-------------------------------------------------------------------------------
-> drug = paxlovid
  92
-------------------------------------------------------------------------------
-> drug = molnupiravir
  72
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |   fail_new_ae_ra_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    28,000     12,746 |    40,746 
  sotrovimab |     4,081        806 |     4,887 
    paxlovid |     4,184        826 |     5,010 
molnupiravir |     4,127        812 |     4,939 
-------------+----------------------+----------
       Total |    40,392     15,190 |    55,582 

             |   fail_new_ae_ra_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    18,040      3,942 |    21,982 
  sotrovimab |     4,075         80 |     4,155 
    paxlovid |     4,182         82 |     4,264 
molnupiravir |     4,124         70 |     4,194 
-------------+----------------------+----------
       Total |    30,421      4,174 |    34,595 
new_ae_sle_ae

-------------------------------------------------------------------------------
-> drug = control
  13,091
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,583
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,593
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,617

-------------------------------------------------------------------------------
-> drug = control
  4,310
-------------------------------------------------------------------------------
-> drug = sotrovimab
  836
-------------------------------------------------------------------------------
-> drug = paxlovid
  875
-------------------------------------------------------------------------------
-> drug = molnupiravir
  868

-------------------------------------------------------------------------------
-> drug = control
  4,319
-------------------------------------------------------------------------------
-> drug = sotrovimab
  72
-------------------------------------------------------------------------------
-> drug = paxlovid
  88
-------------------------------------------------------------------------------
-> drug = molnupiravir
  90
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_new_ae_sle_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    28,132     12,614 |    40,746 
  sotrovimab |     4,079        808 |     4,887 
    paxlovid |     4,205        805 |     5,010 
molnupiravir |     4,105        834 |     4,939 
-------------+----------------------+----------
       Total |    40,521     15,061 |    55,582 

             |  fail_new_ae_sle_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    18,047      4,003 |    22,050 
  sotrovimab |     4,075         65 |     4,140 
    paxlovid |     4,204         88 |     4,292 
molnupiravir |     4,103         87 |     4,190 
-------------+----------------------+----------
       Total |    30,429      4,243 |    34,672 
new_ae_psoriasis_ae

-------------------------------------------------------------------------------
-> drug = control
  14,572
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,801
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,801
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,762

-------------------------------------------------------------------------------
-> drug = control
  4,652
-------------------------------------------------------------------------------
-> drug = sotrovimab
  978
-------------------------------------------------------------------------------
-> drug = paxlovid
  968
-------------------------------------------------------------------------------
-> drug = molnupiravir
  948

-------------------------------------------------------------------------------
-> drug = control
  4,668
-------------------------------------------------------------------------------
-> drug = sotrovimab
  93
-------------------------------------------------------------------------------
-> drug = paxlovid
  83
-------------------------------------------------------------------------------
-> drug = molnupiravir
  69
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_psoriasis
             |          _ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,632     14,114 |    40,746 
  sotrovimab |     3,976        911 |     4,887 
    paxlovid |     4,103        907 |     5,010 
molnupiravir |     4,058        881 |     4,939 
-------------+----------------------+----------
       Total |    38,769     16,813 |    55,582 

             | fail_new_ae_psoriasis
             |          _ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    17,156      4,377 |    21,533 
  sotrovimab |     3,975         89 |     4,064 
    paxlovid |     4,100         77 |     4,177 
molnupiravir |     4,055         70 |     4,125 
-------------+----------------------+----------
       Total |    29,286      4,613 |    33,899 
new_ae_psa_ae

-------------------------------------------------------------------------------
-> drug = control
  14,735
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,733
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,837
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,791

-------------------------------------------------------------------------------
-> drug = control
  4,772
-------------------------------------------------------------------------------
-> drug = sotrovimab
  921
-------------------------------------------------------------------------------
-> drug = paxlovid
  985
-------------------------------------------------------------------------------
-> drug = molnupiravir
  957

-------------------------------------------------------------------------------
-> drug = control
  4,795
-------------------------------------------------------------------------------
-> drug = sotrovimab
  77
-------------------------------------------------------------------------------
-> drug = paxlovid
  101
-------------------------------------------------------------------------------
-> drug = molnupiravir
  100
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_new_ae_psa_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,474     14,272 |    40,746 
  sotrovimab |     4,003        884 |     4,887 
    paxlovid |     4,063        947 |     5,010 
molnupiravir |     4,010        929 |     4,939 
-------------+----------------------+----------
       Total |    38,550     17,032 |    55,582 

             |  fail_new_ae_psa_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,960      4,481 |    21,441 
  sotrovimab |     4,001         74 |     4,075 
    paxlovid |     4,059         99 |     4,158 
molnupiravir |     4,009         96 |     4,105 
-------------+----------------------+----------
       Total |    29,029      4,750 |    33,779 
new_ae_ankspon_ae

-------------------------------------------------------------------------------
-> drug = control
  14,716
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,719
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,839
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,782

-------------------------------------------------------------------------------
-> drug = control
  4,731
-------------------------------------------------------------------------------
-> drug = sotrovimab
  917
-------------------------------------------------------------------------------
-> drug = paxlovid
  974
-------------------------------------------------------------------------------
-> drug = molnupiravir
  937

-------------------------------------------------------------------------------
-> drug = control
  4,747
-------------------------------------------------------------------------------
-> drug = sotrovimab
  79
-------------------------------------------------------------------------------
-> drug = paxlovid
  92
-------------------------------------------------------------------------------
-> drug = molnupiravir
  101
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             | fail_new_ae_ankspon_a
             |           e
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,508     14,238 |    40,746 
  sotrovimab |     4,015        872 |     4,887 
    paxlovid |     4,057        953 |     5,010 
molnupiravir |     3,999        940 |     4,939 
-------------+----------------------+----------
       Total |    38,579     17,003 |    55,582 

             | fail_new_ae_ankspon_a
             |           e
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    16,989      4,446 |    21,435 
  sotrovimab |     4,012         73 |     4,085 
    paxlovid |     4,055         90 |     4,145 
molnupiravir |     3,997         97 |     4,094 
-------------+----------------------+----------
       Total |    29,053      4,706 |    33,759 
new_ae_ibd_ae

-------------------------------------------------------------------------------
-> drug = control
  14,727
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,790
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,825
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,773

-------------------------------------------------------------------------------
-> drug = control
  4,772
-------------------------------------------------------------------------------
-> drug = sotrovimab
  960
-------------------------------------------------------------------------------
-> drug = paxlovid
  996
-------------------------------------------------------------------------------
-> drug = molnupiravir
  943

-------------------------------------------------------------------------------
-> drug = control
  4,792
-------------------------------------------------------------------------------
-> drug = sotrovimab
  100
-------------------------------------------------------------------------------
-> drug = paxlovid
  89
-------------------------------------------------------------------------------
-> drug = molnupiravir
  96
(50,695 missing values generated)
(5,010 real changes made)
(4,939 real changes made)
(40,746 real changes made)

             |  fail_new_ae_ibd_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    26,480     14,266 |    40,746 
  sotrovimab |     3,971        916 |     4,887 
    paxlovid |     4,091        919 |     5,010 
molnupiravir |     4,025        914 |     4,939 
-------------+----------------------+----------
       Total |    38,567     17,015 |    55,582 

             |  fail_new_ae_ibd_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    17,016      4,498 |    21,514 
  sotrovimab |     3,964         93 |     4,057 
    paxlovid |     4,090         91 |     4,181 
molnupiravir |     4,022         87 |     4,109 
-------------+----------------------+----------
       Total |    29,092      4,769 |    33,861 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         replace `x'=`x'+0.5 if `x'==start_date
  4. }
ae_spc_all
(65 real changes made)
ae_drug_all
(60 real changes made)
ae_imae_all
(86 real changes made)
ae_all
(67 real changes made)
allcause_emerg_aande
(5 real changes made)
covid_hosp_date
(3 real changes made)
all_hosp_date
(8 real changes made)
died_date_ons
(24 real changes made)
ae_diverticulitis_snomed
(20 real changes made)
ae_diarrhoea_snomed
(32 real changes made)
ae_taste_snomed
(28 real changes made)
ae_diverticulitis_icd
(34 real changes made)
ae_taste_icd
(33 real changes made)
ae_diverticulitis_ae
(29 real changes made)
ae_anaphylaxis_snomed
(27 real changes made)
ae_rash_snomed
(33 real changes made)
ae_anaphylaxis_icd
(28 real changes made)
ae_anaphlaxis_ae
(25 real changes made)
ae_drugreact_ae
(29 real changes made)
ae_allergic_ae
(25 real changes made)
new_ae_ra_snomed
(31 real changes made)
new_ae_sle_ctv
(23 real changes made)
new_ae_psoriasis_snomed
(35 real changes made)
new_ae_psa_snomed
(23 real changes made)
new_ae_ankspon_ctv
(29 real changes made)
new_ae_ibd_snomed
(33 real changes made)
new_ae_ra_icd
(24 real changes made)
new_ae_sle_icd
(27 real changes made)
new_ae_ra_ae
(24 real changes made)
new_ae_sle_ae
(17 real changes made)
new_ae_psoriasis_ae
(29 real changes made)
new_ae_psa_ae
(33 real changes made)
new_ae_ankspon_ae
(26 real changes made)
new_ae_ibd_ae
(29 real changes made)

. 
. *Generate censor date
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         gen stop_`x'=`x' if fail_`x'==1
  3.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,paxlovid,molnupiravir) if fail_`x'==0&drug==1
  4.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,sotrovimab,molnupiravir) if fail_`x'==0&drug==2
  5.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,sotrovimab,paxlovid) if fail_`x'==0&drug==3
  6.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,sotrovimab,paxlovid,molnupiravir) if fail_`x'==0&drug==0
  7.         format %td stop_`x'
  8. }
(7,061 missing values generated)
(1,611 real changes made)
(1,645 real changes made)
(1,637 real changes made)
(2,168 real changes made)
(7,066 missing values generated)
(1,579 real changes made)
(1,691 real changes made)
(1,628 real changes made)
(2,168 real changes made)
(2,814 missing values generated)
(870 real changes made)
(867 real changes made)
(851 real changes made)
(226 real changes made)
(1,084 missing values generated)
(350 real changes made)
(376 real changes made)
(358 real changes made)
(0 real changes made)
(53,310 missing values generated)
(4,779 real changes made)
(4,898 real changes made)
(4,831 real changes made)
(38,802 real changes made)
(51,049 missing values generated)
(4,675 real changes made)
(4,795 real changes made)
(4,701 real changes made)
(36,878 real changes made)
(50,991 missing values generated)
(4,678 real changes made)
(4,790 real changes made)
(4,704 real changes made)
(36,819 real changes made)
(25,262 missing values generated)
(2,762 real changes made)
(2,873 real changes made)
(2,805 real changes made)
(16,822 real changes made)
(36,720 missing values generated)
(3,895 real changes made)
(3,920 real changes made)
(3,913 real changes made)
(24,992 real changes made)
(36,506 missing values generated)
(3,929 real changes made)
(3,993 real changes made)
(3,869 real changes made)
(24,715 real changes made)
(36,613 missing values generated)
(3,870 real changes made)
(3,943 real changes made)
(3,979 real changes made)
(24,821 real changes made)
(36,713 missing values generated)
(3,892 real changes made)
(3,975 real changes made)
(3,915 real changes made)
(24,931 real changes made)
(36,728 missing values generated)
(3,921 real changes made)
(3,996 real changes made)
(3,914 real changes made)
(24,897 real changes made)
(36,644 missing values generated)
(3,866 real changes made)
(3,950 real changes made)
(3,911 real changes made)
(24,917 real changes made)
(36,906 missing values generated)
(3,857 real changes made)
(4,000 real changes made)
(3,910 real changes made)
(25,139 real changes made)
(36,757 missing values generated)
(3,866 real changes made)
(3,937 real changes made)
(3,932 real changes made)
(25,022 real changes made)
(36,854 missing values generated)
(3,872 real changes made)
(3,985 real changes made)
(3,929 real changes made)
(25,068 real changes made)
(36,970 missing values generated)
(3,853 real changes made)
(4,026 real changes made)
(3,967 real changes made)
(25,124 real changes made)
(36,830 missing values generated)
(3,881 real changes made)
(4,034 real changes made)
(3,962 real changes made)
(24,953 real changes made)
(36,821 missing values generated)
(3,860 real changes made)
(3,971 real changes made)
(3,969 real changes made)
(25,021 real changes made)
(40,301 missing values generated)
(4,062 real changes made)
(4,154 real changes made)
(4,100 real changes made)
(27,985 real changes made)
(40,356 missing values generated)
(4,090 real changes made)
(4,200 real changes made)
(4,094 real changes made)
(27,972 real changes made)
(38,754 missing values generated)
(4,004 real changes made)
(4,077 real changes made)
(4,040 real changes made)
(26,633 real changes made)
(38,628 missing values generated)
(3,997 real changes made)
(4,050 real changes made)
(4,036 real changes made)
(26,545 real changes made)
(38,810 missing values generated)
(3,985 real changes made)
(4,142 real changes made)
(4,010 real changes made)
(26,673 real changes made)
(38,635 missing values generated)
(3,980 real changes made)
(4,109 real changes made)
(4,014 real changes made)
(26,532 real changes made)
(40,499 missing values generated)
(4,107 real changes made)
(4,201 real changes made)
(4,078 real changes made)
(28,113 real changes made)
(40,392 missing values generated)
(4,101 real changes made)
(4,113 real changes made)
(4,088 real changes made)
(28,090 real changes made)
(40,392 missing values generated)
(4,081 real changes made)
(4,184 real changes made)
(4,127 real changes made)
(28,000 real changes made)
(40,521 missing values generated)
(4,079 real changes made)
(4,205 real changes made)
(4,105 real changes made)
(28,132 real changes made)
(38,769 missing values generated)
(3,976 real changes made)
(4,103 real changes made)
(4,058 real changes made)
(26,632 real changes made)
(38,550 missing values generated)
(4,003 real changes made)
(4,063 real changes made)
(4,010 real changes made)
(26,474 real changes made)
(38,579 missing values generated)
(4,015 real changes made)
(4,057 real changes made)
(3,999 real changes made)
(26,508 real changes made)
(38,567 missing values generated)
(3,971 real changes made)
(4,091 real changes made)
(4,025 real changes made)
(26,480 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_da
> te) failure(fail_ae_all==1) 

                id:  patient_id
     failure event:  fail_ae_all == 1
obs. time interval:  (stop_ae_all[_n-1], stop_ae_all]
 enter on or after:  time start_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_date

------------------------------------------------------------------------------
     55,582  total observations
     14,583  ignored because never entered
     36,272  observations end on or before enter()
------------------------------------------------------------------------------
      4,727  observations remaining, representing
      4,727  subjects
      3,651  failures in single-failure-per-subject data
  195,835.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       355

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==1&min(paxlovid,molnupiravir)==stop_ae_all
  11

. count if fail_ae_all==0&drug==2&min(sotrovimab,molnupiravir)==stop_ae_all
  6

. count if fail_ae_all==0&drug==3&min(sotrovimab,paxlovid,remdesivir,casirivima
> b)==stop_ae_all
  9

. count if fail_ae_all==0&drug==0&min(sotrovimab,paxlovid,molnupiravir)==stop_a
> e_all
  0

. tab _st  // keep if _st==1 -> removes observations that end on or before ente
> r -> should be 0 in actual dataset

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,855       91.50       91.50
          1 |      4,727        8.50      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab _t,m

   analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
         .5 |         67        0.12        0.12
          1 |         88        0.16        0.28
          2 |         83        0.15        0.43
          3 |         81        0.15        0.57
          4 |         90        0.16        0.74
          5 |         71        0.13        0.86
          6 |         52        0.09        0.96
          7 |         61        0.11        1.07
          8 |         73        0.13        1.20
          9 |         80        0.14        1.34
         10 |         86        0.15        1.50
         11 |         76        0.14        1.63
         12 |         57        0.10        1.74
         13 |         88        0.16        1.89
         14 |         58        0.10        2.00
         15 |         75        0.13        2.13
         16 |         58        0.10        2.24
         17 |         58        0.10        2.34
         18 |         60        0.11        2.45
         19 |         48        0.09        2.54
         20 |         60        0.11        2.64
         21 |         49        0.09        2.73
         22 |         46        0.08        2.82
         23 |         59        0.11        2.92
         24 |         71        0.13        3.05
         25 |         65        0.12        3.17
         26 |         51        0.09        3.26
         27 |         61        0.11        3.37
         28 |      1,109        2.00        5.36
         29 |         28        0.05        5.41
         30 |         38        0.07        5.48
         31 |         29        0.05        5.53
         32 |         35        0.06        5.60
         33 |         25        0.04        5.64
         34 |         23        0.04        5.68
         35 |         29        0.05        5.74
         36 |         33        0.06        5.80
         37 |         34        0.06        5.86
         38 |         37        0.07        5.92
         39 |         30        0.05        5.98
         40 |         25        0.04        6.02
         41 |         24        0.04        6.06
         42 |         25        0.04        6.11
         43 |         18        0.03        6.14
         44 |         28        0.05        6.19
         45 |         21        0.04        6.23
         46 |         21        0.04        6.27
         47 |         16        0.03        6.30
         48 |         29        0.05        6.35
         49 |         29        0.05        6.40
         50 |         23        0.04        6.44
         51 |         22        0.04        6.48
         52 |         21        0.04        6.52
         53 |         17        0.03        6.55
         54 |         27        0.05        6.60
         55 |         22        0.04        6.64
         56 |         21        0.04        6.68
         57 |         18        0.03        6.71
         58 |         20        0.04        6.74
         59 |         10        0.02        6.76
         60 |         18        0.03        6.80
         61 |         14        0.03        6.82
         62 |         14        0.03        6.85
         63 |         22        0.04        6.89
         64 |         20        0.04        6.92
         65 |         12        0.02        6.94
         66 |         15        0.03        6.97
         67 |         15        0.03        7.00
         68 |         16        0.03        7.03
         69 |         19        0.03        7.06
         70 |         17        0.03        7.09
         71 |         10        0.02        7.11
         72 |         10        0.02        7.13
         73 |         11        0.02        7.15
         74 |         13        0.02        7.17
         75 |         12        0.02        7.19
         76 |         17        0.03        7.22
         77 |         13        0.02        7.25
         78 |         10        0.02        7.26
         79 |         12        0.02        7.28
         80 |         16        0.03        7.31
         81 |         16        0.03        7.34
         82 |          9        0.02        7.36
         83 |         11        0.02        7.38
         84 |         15        0.03        7.41
         85 |          7        0.01        7.42
         86 |         15        0.03        7.44
         87 |         14        0.03        7.47
         88 |          8        0.01        7.48
         89 |         12        0.02        7.51
         90 |         11        0.02        7.53
         91 |          7        0.01        7.54
         92 |         10        0.02        7.56
         93 |          9        0.02        7.57
         94 |         11        0.02        7.59
         95 |         10        0.02        7.61
         96 |          6        0.01        7.62
         97 |         11        0.02        7.64
         98 |         13        0.02        7.66
         99 |          7        0.01        7.68
        100 |         12        0.02        7.70
        101 |          9        0.02        7.71
        102 |         15        0.03        7.74
        103 |          2        0.00        7.75
        104 |          5        0.01        7.75
        105 |          5        0.01        7.76
        106 |          9        0.02        7.78
        107 |          8        0.01        7.79
        108 |          1        0.00        7.80
        109 |         11        0.02        7.82
        110 |          6        0.01        7.83
        111 |         10        0.02        7.84
        112 |          7        0.01        7.86
        113 |          7        0.01        7.87
        114 |         11        0.02        7.89
        115 |         10        0.02        7.91
        116 |          8        0.01        7.92
        117 |          8        0.01        7.94
        118 |          4        0.01        7.94
        119 |          6        0.01        7.95
        120 |          4        0.01        7.96
        121 |          9        0.02        7.98
        122 |          5        0.01        7.99
        123 |         10        0.02        8.00
        124 |          6        0.01        8.02
        125 |          3        0.01        8.02
        126 |          3        0.01        8.03
        127 |          8        0.01        8.04
        128 |          6        0.01        8.05
        129 |          1        0.00        8.05
        130 |         10        0.02        8.07
        131 |          2        0.00        8.07
        132 |          2        0.00        8.08
        133 |          3        0.01        8.08
        134 |          5        0.01        8.09
        135 |          2        0.00        8.10
        136 |          6        0.01        8.11
        137 |          4        0.01        8.11
        138 |          5        0.01        8.12
        139 |          1        0.00        8.12
        140 |          4        0.01        8.13
        141 |          2        0.00        8.14
        142 |          5        0.01        8.14
        143 |          2        0.00        8.15
        144 |          5        0.01        8.16
        145 |          2        0.00        8.16
        146 |          3        0.01        8.17
        147 |          3        0.01        8.17
        148 |          3        0.01        8.18
        149 |          2        0.00        8.18
        150 |          3        0.01        8.19
        151 |          3        0.01        8.19
        152 |          6        0.01        8.20
        153 |          4        0.01        8.21
        154 |          6        0.01        8.22
        155 |          2        0.00        8.22
        156 |          1        0.00        8.23
        157 |          3        0.01        8.23
        158 |          3        0.01        8.24
        159 |          5        0.01        8.25
        160 |          4        0.01        8.25
        161 |          3        0.01        8.26
        162 |          2        0.00        8.26
        163 |          3        0.01        8.27
        164 |          1        0.00        8.27
        165 |          8        0.01        8.28
        167 |          3        0.01        8.29
        169 |          1        0.00        8.29
        170 |          4        0.01        8.30
        171 |          2        0.00        8.30
        172 |          2        0.00        8.30
        173 |          4        0.01        8.31
        174 |          1        0.00        8.31
        175 |          2        0.00        8.32
        176 |          2        0.00        8.32
        177 |          2        0.00        8.32
        178 |          1        0.00        8.33
        179 |          2        0.00        8.33
        180 |          2        0.00        8.33
        181 |          3        0.01        8.34
        183 |          1        0.00        8.34
        184 |          1        0.00        8.34
        185 |          2        0.00        8.35
        186 |          1        0.00        8.35
        187 |          1        0.00        8.35
        188 |          1        0.00        8.35
        189 |          2        0.00        8.36
        191 |          2        0.00        8.36
        192 |          3        0.01        8.36
        193 |          1        0.00        8.37
        194 |          1        0.00        8.37
        196 |          4        0.01        8.38
        197 |          1        0.00        8.38
        198 |          1        0.00        8.38
        199 |          1        0.00        8.38
        200 |          2        0.00        8.38
        201 |          1        0.00        8.39
        202 |          4        0.01        8.39
        203 |          1        0.00        8.39
        206 |          1        0.00        8.40
        207 |          1        0.00        8.40
        208 |          1        0.00        8.40
        210 |          1        0.00        8.40
        211 |          1        0.00        8.40
        213 |          1        0.00        8.41
        214 |          3        0.01        8.41
        215 |          1        0.00        8.41
        216 |          1        0.00        8.41
        218 |          1        0.00        8.42
        220 |          2        0.00        8.42
        222 |          1        0.00        8.42
        224 |          2        0.00        8.43
        227 |          1        0.00        8.43
        228 |          1        0.00        8.43
        229 |          1        0.00        8.43
        230 |          2        0.00        8.43
        233 |          3        0.01        8.44
        234 |          1        0.00        8.44
        235 |          1        0.00        8.44
        236 |          2        0.00        8.45
        237 |          1        0.00        8.45
        239 |          2        0.00        8.45
        243 |          2        0.00        8.46
        244 |          1        0.00        8.46
        246 |          1        0.00        8.46
        247 |          1        0.00        8.46
        249 |          1        0.00        8.46
        253 |          1        0.00        8.46
        256 |          1        0.00        8.47
        261 |          1        0.00        8.47
        263 |          2        0.00        8.47
        265 |          2        0.00        8.48
        266 |          1        0.00        8.48
        267 |          1        0.00        8.48
        274 |          1        0.00        8.48
        277 |          1        0.00        8.48
        279 |          1        0.00        8.48
        280 |          1        0.00        8.49
        282 |          1        0.00        8.49
        283 |          1        0.00        8.49
        284 |          1        0.00        8.49
        286 |          1        0.00        8.49
        287 |          1        0.00        8.50
        289 |          1        0.00        8.50
        293 |          1        0.00        8.50
        315 |          1        0.00        8.50
        317 |          1        0.00        8.50
        355 |          1        0.00        8.50
          . |     50,855       91.50      100.00
------------+-----------------------------------
      Total |     55,582      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        38          9         10         10 |        67 
           |      0.09       0.18       0.20       0.20 |      0.12 
-----------+--------------------------------------------+----------
         1 |        57         10         10         11 |        88 
           |      0.14       0.20       0.20       0.22 |      0.16 
-----------+--------------------------------------------+----------
         2 |        50         14          7         12 |        83 
           |      0.12       0.29       0.14       0.24 |      0.15 
-----------+--------------------------------------------+----------
         3 |        55          6         12          8 |        81 
           |      0.13       0.12       0.24       0.16 |      0.15 
-----------+--------------------------------------------+----------
         4 |        50         17         10         13 |        90 
           |      0.12       0.35       0.20       0.26 |      0.16 
-----------+--------------------------------------------+----------
         5 |        49         11          3          8 |        71 
           |      0.12       0.23       0.06       0.16 |      0.13 
-----------+--------------------------------------------+----------
         6 |        34          6          6          6 |        52 
           |      0.08       0.12       0.12       0.12 |      0.09 
-----------+--------------------------------------------+----------
         7 |        34          8         11          8 |        61 
           |      0.08       0.16       0.22       0.16 |      0.11 
-----------+--------------------------------------------+----------
         8 |        45         11         10          7 |        73 
           |      0.11       0.23       0.20       0.14 |      0.13 
-----------+--------------------------------------------+----------
         9 |        50          3         17         10 |        80 
           |      0.12       0.06       0.34       0.20 |      0.14 
-----------+--------------------------------------------+----------
        10 |        52         10         17          7 |        86 
           |      0.13       0.20       0.34       0.14 |      0.15 
-----------+--------------------------------------------+----------
        11 |        51          7         10          8 |        76 
           |      0.13       0.14       0.20       0.16 |      0.14 
-----------+--------------------------------------------+----------
        12 |        43          3          5          6 |        57 
           |      0.11       0.06       0.10       0.12 |      0.10 
-----------+--------------------------------------------+----------
        13 |        56         11         11         10 |        88 
           |      0.14       0.23       0.22       0.20 |      0.16 
-----------+--------------------------------------------+----------
        14 |        36          6          9          7 |        58 
           |      0.09       0.12       0.18       0.14 |      0.10 
-----------+--------------------------------------------+----------
        15 |        42         12         12          9 |        75 
           |      0.10       0.25       0.24       0.18 |      0.13 
-----------+--------------------------------------------+----------
        16 |        37          6          9          6 |        58 
           |      0.09       0.12       0.18       0.12 |      0.10 
-----------+--------------------------------------------+----------
        17 |        35          9          7          7 |        58 
           |      0.09       0.18       0.14       0.14 |      0.10 
-----------+--------------------------------------------+----------
        18 |        40          4          6         10 |        60 
           |      0.10       0.08       0.12       0.20 |      0.11 
-----------+--------------------------------------------+----------
        19 |        26         13          4          5 |        48 
           |      0.06       0.27       0.08       0.10 |      0.09 
-----------+--------------------------------------------+----------
        20 |        34          7         10          9 |        60 
           |      0.08       0.14       0.20       0.18 |      0.11 
-----------+--------------------------------------------+----------
        21 |        31          7          8          3 |        49 
           |      0.08       0.14       0.16       0.06 |      0.09 
-----------+--------------------------------------------+----------
        22 |        34          4          4          4 |        46 
           |      0.08       0.08       0.08       0.08 |      0.08 
-----------+--------------------------------------------+----------
        23 |        39          5          7          8 |        59 
           |      0.10       0.10       0.14       0.16 |      0.11 
-----------+--------------------------------------------+----------
        24 |        46          6          8         11 |        71 
           |      0.11       0.12       0.16       0.22 |      0.13 
-----------+--------------------------------------------+----------
        25 |        38         10          7         10 |        65 
           |      0.09       0.20       0.14       0.20 |      0.12 
-----------+--------------------------------------------+----------
        26 |        36          8          4          3 |        51 
           |      0.09       0.16       0.08       0.06 |      0.09 
-----------+--------------------------------------------+----------
        27 |        44          4          9          4 |        61 
           |      0.11       0.08       0.18       0.08 |      0.11 
-----------+--------------------------------------------+----------
        28 |        38        344        377        350 |     1,109 
           |      0.09       7.04       7.52       7.09 |      2.00 
-----------+--------------------------------------------+----------
        29 |        28          0          0          0 |        28 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        30 |        38          0          0          0 |        38 
           |      0.09       0.00       0.00       0.00 |      0.07 
-----------+--------------------------------------------+----------
        31 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        32 |        35          0          0          0 |        35 
           |      0.09       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        33 |        25          0          0          0 |        25 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        34 |        23          0          0          0 |        23 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        35 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        36 |        33          0          0          0 |        33 
           |      0.08       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        37 |        34          0          0          0 |        34 
           |      0.08       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        38 |        37          0          0          0 |        37 
           |      0.09       0.00       0.00       0.00 |      0.07 
-----------+--------------------------------------------+----------
        39 |        30          0          0          0 |        30 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        40 |        25          0          0          0 |        25 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        41 |        24          0          0          0 |        24 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        42 |        25          0          0          0 |        25 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        43 |        18          0          0          0 |        18 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        44 |        28          0          0          0 |        28 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        45 |        21          0          0          0 |        21 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        46 |        21          0          0          0 |        21 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        47 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        48 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        49 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        50 |        23          0          0          0 |        23 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        51 |        21          0          0          1 |        22 
           |      0.05       0.00       0.00       0.02 |      0.04 
-----------+--------------------------------------------+----------
        52 |        21          0          0          0 |        21 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        53 |        17          0          0          0 |        17 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        54 |        27          0          0          0 |        27 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        55 |        22          0          0          0 |        22 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        56 |        20          1          0          0 |        21 
           |      0.05       0.02       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        57 |        18          0          0          0 |        18 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        58 |        20          0          0          0 |        20 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        59 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        60 |        18          0          0          0 |        18 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        61 |        14          0          0          0 |        14 
           |      0.03       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        62 |        14          0          0          0 |        14 
           |      0.03       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        63 |        22          0          0          0 |        22 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        64 |        19          0          0          1 |        20 
           |      0.05       0.00       0.00       0.02 |      0.04 
-----------+--------------------------------------------+----------
        65 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        66 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        67 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        68 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        69 |        19          0          0          0 |        19 
           |      0.05       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        70 |        17          0          0          0 |        17 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        71 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        72 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        73 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        74 |        13          0          0          0 |        13 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        75 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        76 |        17          0          0          0 |        17 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        77 |        13          0          0          0 |        13 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        78 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        79 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        80 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        81 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        82 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        83 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        84 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        85 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        86 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        87 |        14          0          0          0 |        14 
           |      0.03       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        88 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        89 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        90 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        91 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        92 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        93 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        94 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        95 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        96 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        97 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        98 |        13          0          0          0 |        13 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        99 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       100 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       101 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       102 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
       103 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       104 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       105 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       106 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       107 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       108 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       109 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       110 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       111 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       112 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       113 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       114 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       115 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       116 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       117 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       118 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       119 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       120 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       121 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       122 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       123 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       124 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       125 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       126 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       127 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       128 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       129 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       130 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       131 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       132 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       133 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       134 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       135 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       136 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       137 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       138 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       139 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       140 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       141 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       142 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       143 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       144 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       145 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       146 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       147 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       148 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       149 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       150 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       151 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       152 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       153 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       154 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       155 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       156 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       157 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       158 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       159 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       160 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       161 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       162 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       163 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       164 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       165 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       167 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       169 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       170 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       171 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       172 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       173 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       174 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       175 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       176 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       177 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       178 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       179 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       180 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       181 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       183 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       184 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       185 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       186 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       187 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       188 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       189 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       191 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       192 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       193 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       194 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       196 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       197 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       198 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       199 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       200 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       201 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       202 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       203 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       206 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       207 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       208 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       210 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       211 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       213 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       214 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       215 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       216 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       218 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       220 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       222 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       224 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       227 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       228 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       229 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       230 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       233 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       234 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       235 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       236 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       237 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       239 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       243 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       244 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       246 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       247 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       249 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       253 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       256 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       261 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       263 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       265 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       266 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       267 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       274 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       277 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       279 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       280 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       282 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       283 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       284 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       286 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       287 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       289 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       293 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       315 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       317 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       355 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
         . |    37,783      4,315      4,390      4,367 |    50,855 
           |     92.73      88.30      87.62      88.42 |     91.50 
-----------+--------------------------------------------+----------
     Total |    40,746      4,887      5,010      4,939 |    55,582 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        38          9         10         10 |        67 
           |      0.09       0.20       0.22       0.22 |      0.12 
-----------+--------------------------------------------+----------
         1 |        57         10          9         10 |        86 
           |      0.14       0.22       0.19       0.22 |      0.16 
-----------+--------------------------------------------+----------
         2 |        50         13          7         12 |        82 
           |      0.12       0.29       0.15       0.26 |      0.15 
-----------+--------------------------------------------+----------
         3 |        55          6         12          8 |        81 
           |      0.13       0.13       0.26       0.17 |      0.15 
-----------+--------------------------------------------+----------
         4 |        50         17         10         13 |        90 
           |      0.12       0.37       0.22       0.28 |      0.17 
-----------+--------------------------------------------+----------
         5 |        49          9          3          8 |        69 
           |      0.12       0.20       0.06       0.17 |      0.13 
-----------+--------------------------------------------+----------
         6 |        34          6          6          6 |        52 
           |      0.08       0.13       0.13       0.13 |      0.10 
-----------+--------------------------------------------+----------
         7 |        34          8         11          8 |        61 
           |      0.08       0.18       0.24       0.17 |      0.11 
-----------+--------------------------------------------+----------
         8 |        45         10         10          5 |        70 
           |      0.11       0.22       0.22       0.11 |      0.13 
-----------+--------------------------------------------+----------
         9 |        50          3         16         10 |        79 
           |      0.12       0.07       0.35       0.22 |      0.14 
-----------+--------------------------------------------+----------
        10 |        52          8         17          6 |        83 
           |      0.13       0.18       0.37       0.13 |      0.15 
-----------+--------------------------------------------+----------
        11 |        51          7          9          8 |        75 
           |      0.13       0.15       0.19       0.17 |      0.14 
-----------+--------------------------------------------+----------
        12 |        43          3          5          5 |        56 
           |      0.11       0.07       0.11       0.11 |      0.10 
-----------+--------------------------------------------+----------
        13 |        56         11         10         10 |        87 
           |      0.14       0.24       0.22       0.22 |      0.16 
-----------+--------------------------------------------+----------
        14 |        36          6          9          7 |        58 
           |      0.09       0.13       0.19       0.15 |      0.11 
-----------+--------------------------------------------+----------
        15 |        42         11         11          7 |        71 
           |      0.10       0.24       0.24       0.15 |      0.13 
-----------+--------------------------------------------+----------
        16 |        37          5          9          6 |        57 
           |      0.09       0.11       0.19       0.13 |      0.10 
-----------+--------------------------------------------+----------
        17 |        35          8          7          6 |        56 
           |      0.09       0.18       0.15       0.13 |      0.10 
-----------+--------------------------------------------+----------
        18 |        40          4          6         10 |        60 
           |      0.10       0.09       0.13       0.22 |      0.11 
-----------+--------------------------------------------+----------
        19 |        26         13          4          4 |        47 
           |      0.06       0.29       0.09       0.09 |      0.09 
-----------+--------------------------------------------+----------
        20 |        34          7         10          9 |        60 
           |      0.08       0.15       0.22       0.20 |      0.11 
-----------+--------------------------------------------+----------
        21 |        31          5          8          3 |        47 
           |      0.08       0.11       0.17       0.07 |      0.09 
-----------+--------------------------------------------+----------
        22 |        34          3          3          4 |        44 
           |      0.08       0.07       0.06       0.09 |      0.08 
-----------+--------------------------------------------+----------
        23 |        39          5          7          8 |        59 
           |      0.10       0.11       0.15       0.17 |      0.11 
-----------+--------------------------------------------+----------
        24 |        46          6          8         11 |        71 
           |      0.11       0.13       0.17       0.24 |      0.13 
-----------+--------------------------------------------+----------
        25 |        38         10          7         10 |        65 
           |      0.09       0.22       0.15       0.22 |      0.12 
-----------+--------------------------------------------+----------
        26 |        36          8          4          3 |        51 
           |      0.09       0.18       0.09       0.07 |      0.09 
-----------+--------------------------------------------+----------
        27 |        44          4          9          4 |        61 
           |      0.11       0.09       0.19       0.09 |      0.11 
-----------+--------------------------------------------+----------
        28 |        38         10          8          4 |        60 
           |      0.09       0.22       0.17       0.09 |      0.11 
-----------+--------------------------------------------+----------
        29 |        28          0          0          0 |        28 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        30 |        38          0          0          0 |        38 
           |      0.09       0.00       0.00       0.00 |      0.07 
-----------+--------------------------------------------+----------
        31 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        32 |        35          0          0          0 |        35 
           |      0.09       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        33 |        25          0          0          0 |        25 
           |      0.06       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        34 |        23          0          0          0 |        23 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        35 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        36 |        33          0          0          0 |        33 
           |      0.08       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        37 |        34          0          0          0 |        34 
           |      0.08       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        38 |        37          0          0          0 |        37 
           |      0.09       0.00       0.00       0.00 |      0.07 
-----------+--------------------------------------------+----------
        39 |        30          0          0          0 |        30 
           |      0.07       0.00       0.00       0.00 |      0.06 
-----------+--------------------------------------------+----------
        40 |        25          0          0          0 |        25 
           |      0.06       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        41 |        24          0          0          0 |        24 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        42 |        25          0          0          0 |        25 
           |      0.06       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        43 |        18          0          0          0 |        18 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        44 |        28          0          0          0 |        28 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        45 |        21          0          0          0 |        21 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        46 |        21          0          0          0 |        21 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        47 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        48 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        49 |        29          0          0          0 |        29 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        50 |        23          0          0          0 |        23 
           |      0.06       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        51 |        21          0          0          1 |        22 
           |      0.05       0.00       0.00       0.02 |      0.04 
-----------+--------------------------------------------+----------
        52 |        21          0          0          0 |        21 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        53 |        17          0          0          0 |        17 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        54 |        27          0          0          0 |        27 
           |      0.07       0.00       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        55 |        22          0          0          0 |        22 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        56 |        20          1          0          0 |        21 
           |      0.05       0.02       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        57 |        18          0          0          0 |        18 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        58 |        20          0          0          0 |        20 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        59 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        60 |        18          0          0          0 |        18 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        61 |        14          0          0          0 |        14 
           |      0.03       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        62 |        14          0          0          0 |        14 
           |      0.03       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        63 |        22          0          0          0 |        22 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
        64 |        19          0          0          1 |        20 
           |      0.05       0.00       0.00       0.02 |      0.04 
-----------+--------------------------------------------+----------
        65 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        66 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        67 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        68 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        69 |        19          0          0          0 |        19 
           |      0.05       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        70 |        17          0          0          0 |        17 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        71 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        72 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        73 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        74 |        13          0          0          0 |        13 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        75 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        76 |        17          0          0          0 |        17 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        77 |        13          0          0          0 |        13 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        78 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        79 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        80 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        81 |        16          0          0          0 |        16 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        82 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        83 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        84 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        85 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        86 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        87 |        14          0          0          0 |        14 
           |      0.03       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
        88 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        89 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        90 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        91 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        92 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        93 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        94 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        95 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        96 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
        97 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        98 |        13          0          0          0 |        13 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
        99 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       100 |        12          0          0          0 |        12 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       101 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       102 |        15          0          0          0 |        15 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
       103 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       104 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       105 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       106 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       107 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       108 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       109 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       110 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       111 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       112 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       113 |         7          0          0          0 |         7 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       114 |        11          0          0          0 |        11 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       115 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       116 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       117 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       118 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       119 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       120 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       121 |         9          0          0          0 |         9 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       122 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       123 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       124 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       125 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       126 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       127 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       128 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       129 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       130 |        10          0          0          0 |        10 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
       131 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       132 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       133 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       134 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       135 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       136 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       137 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       138 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       139 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       140 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       141 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       142 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       143 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       144 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       145 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       146 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       147 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       148 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       149 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       150 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       151 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       152 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       153 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       154 |         6          0          0          0 |         6 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       155 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       156 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       157 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       158 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       159 |         5          0          0          0 |         5 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       160 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       161 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       162 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       163 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       164 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       165 |         8          0          0          0 |         8 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       167 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       169 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       170 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       171 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       172 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       173 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       174 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       175 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       176 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       177 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       178 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       179 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       180 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       181 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       183 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       184 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       185 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       186 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       187 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       188 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       189 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       191 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       192 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       193 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       194 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       196 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       197 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       198 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       199 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       200 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       201 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       202 |         4          0          0          0 |         4 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       203 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       206 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       207 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       208 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       210 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       211 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       213 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       214 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       215 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       216 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       218 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       220 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       222 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       224 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       227 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       228 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       229 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       230 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       233 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
       234 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       235 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       236 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       237 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       239 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       243 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       244 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       246 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       247 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       249 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       253 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       256 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       261 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       263 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       265 |         2          0          0          0 |         2 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       266 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       267 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       274 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       277 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       279 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       280 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       282 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       283 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       284 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       286 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       287 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       289 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       293 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       315 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       317 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
       355 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
         . |    37,783      4,311      4,389      4,364 |    50,847 
           |     92.73      95.02      94.71      95.26 |     93.30 
-----------+--------------------------------------------+----------
     Total |    40,746      4,537      4,634      4,581 |    54,498 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |        38          9         10         10 |        67 
         1 |        57         10          9         10 |        86 
         2 |        50         13          7         12 |        82 
         3 |        55          6         12          8 |        81 
         4 |        50         17         10         13 |        90 
         5 |        49          9          3          8 |        69 
         6 |        34          6          6          6 |        52 
         7 |        34          8         11          8 |        61 
         8 |        45         10         10          5 |        70 
         9 |        50          3         16         10 |        79 
        10 |        52          8         17          6 |        83 
        11 |        51          7          9          8 |        75 
        12 |        43          3          5          5 |        56 
        13 |        56         11         10         10 |        87 
        14 |        36          6          9          7 |        58 
        15 |        42         11         11          7 |        71 
        16 |        37          5          9          6 |        57 
        17 |        35          8          7          6 |        56 
        18 |        40          4          6         10 |        60 
        19 |        26         13          4          4 |        47 
        20 |        34          7         10          9 |        60 
        21 |        31          5          8          3 |        47 
        22 |        34          3          3          4 |        44 
        23 |        39          5          7          8 |        59 
        24 |        46          6          8         11 |        71 
        25 |        38         10          7         10 |        65 
        26 |        36          8          4          3 |        51 
        27 |        44          4          9          4 |        61 
        28 |        38         10          8          4 |        60 
        29 |        28          0          0          0 |        28 
        30 |        38          0          0          0 |        38 
        31 |        29          0          0          0 |        29 
        32 |        35          0          0          0 |        35 
        33 |        25          0          0          0 |        25 
        34 |        23          0          0          0 |        23 
        35 |        29          0          0          0 |        29 
        36 |        33          0          0          0 |        33 
        37 |        34          0          0          0 |        34 
        38 |        37          0          0          0 |        37 
        39 |        30          0          0          0 |        30 
        40 |        25          0          0          0 |        25 
        41 |        24          0          0          0 |        24 
        42 |        25          0          0          0 |        25 
        43 |        18          0          0          0 |        18 
        44 |        28          0          0          0 |        28 
        45 |        21          0          0          0 |        21 
        46 |        21          0          0          0 |        21 
        47 |        16          0          0          0 |        16 
        48 |        29          0          0          0 |        29 
        49 |        29          0          0          0 |        29 
        50 |        23          0          0          0 |        23 
        51 |        21          0          0          1 |        22 
        52 |        21          0          0          0 |        21 
        53 |        17          0          0          0 |        17 
        54 |        27          0          0          0 |        27 
        55 |        22          0          0          0 |        22 
        56 |        20          1          0          0 |        21 
        57 |        18          0          0          0 |        18 
        58 |        20          0          0          0 |        20 
        59 |        10          0          0          0 |        10 
        60 |        18          0          0          0 |        18 
        61 |        14          0          0          0 |        14 
        62 |        14          0          0          0 |        14 
        63 |        22          0          0          0 |        22 
        64 |        19          0          0          1 |        20 
        65 |        12          0          0          0 |        12 
        66 |        15          0          0          0 |        15 
        67 |        15          0          0          0 |        15 
        68 |        16          0          0          0 |        16 
        69 |        19          0          0          0 |        19 
        70 |        17          0          0          0 |        17 
        71 |        10          0          0          0 |        10 
        72 |        10          0          0          0 |        10 
        73 |        11          0          0          0 |        11 
        74 |        13          0          0          0 |        13 
        75 |        12          0          0          0 |        12 
        76 |        17          0          0          0 |        17 
        77 |        13          0          0          0 |        13 
        78 |        10          0          0          0 |        10 
        79 |        12          0          0          0 |        12 
        80 |        16          0          0          0 |        16 
        81 |        16          0          0          0 |        16 
        82 |         9          0          0          0 |         9 
        83 |        11          0          0          0 |        11 
        84 |        15          0          0          0 |        15 
        85 |         7          0          0          0 |         7 
        86 |        15          0          0          0 |        15 
        87 |        14          0          0          0 |        14 
        88 |         8          0          0          0 |         8 
        89 |        12          0          0          0 |        12 
        90 |        11          0          0          0 |        11 
        91 |         7          0          0          0 |         7 
        92 |        10          0          0          0 |        10 
        93 |         9          0          0          0 |         9 
        94 |        11          0          0          0 |        11 
        95 |        10          0          0          0 |        10 
        96 |         6          0          0          0 |         6 
        97 |        11          0          0          0 |        11 
        98 |        13          0          0          0 |        13 
        99 |         7          0          0          0 |         7 
       100 |        12          0          0          0 |        12 
       101 |         9          0          0          0 |         9 
       102 |        15          0          0          0 |        15 
       103 |         2          0          0          0 |         2 
       104 |         5          0          0          0 |         5 
       105 |         5          0          0          0 |         5 
       106 |         9          0          0          0 |         9 
       107 |         8          0          0          0 |         8 
       108 |         1          0          0          0 |         1 
       109 |        11          0          0          0 |        11 
       110 |         6          0          0          0 |         6 
       111 |        10          0          0          0 |        10 
       112 |         7          0          0          0 |         7 
       113 |         7          0          0          0 |         7 
       114 |        11          0          0          0 |        11 
       115 |        10          0          0          0 |        10 
       116 |         8          0          0          0 |         8 
       117 |         8          0          0          0 |         8 
       118 |         4          0          0          0 |         4 
       119 |         6          0          0          0 |         6 
       120 |         4          0          0          0 |         4 
       121 |         9          0          0          0 |         9 
       122 |         5          0          0          0 |         5 
       123 |        10          0          0          0 |        10 
       124 |         6          0          0          0 |         6 
       125 |         3          0          0          0 |         3 
       126 |         3          0          0          0 |         3 
       127 |         8          0          0          0 |         8 
       128 |         6          0          0          0 |         6 
       129 |         1          0          0          0 |         1 
       130 |        10          0          0          0 |        10 
       131 |         2          0          0          0 |         2 
       132 |         2          0          0          0 |         2 
       133 |         3          0          0          0 |         3 
       134 |         5          0          0          0 |         5 
       135 |         2          0          0          0 |         2 
       136 |         6          0          0          0 |         6 
       137 |         4          0          0          0 |         4 
       138 |         5          0          0          0 |         5 
       139 |         1          0          0          0 |         1 
       140 |         4          0          0          0 |         4 
       141 |         2          0          0          0 |         2 
       142 |         5          0          0          0 |         5 
       143 |         2          0          0          0 |         2 
       144 |         5          0          0          0 |         5 
       145 |         2          0          0          0 |         2 
       146 |         3          0          0          0 |         3 
       147 |         3          0          0          0 |         3 
       148 |         3          0          0          0 |         3 
       149 |         2          0          0          0 |         2 
       150 |         3          0          0          0 |         3 
       151 |         3          0          0          0 |         3 
       152 |         6          0          0          0 |         6 
       153 |         4          0          0          0 |         4 
       154 |         6          0          0          0 |         6 
       155 |         2          0          0          0 |         2 
       156 |         1          0          0          0 |         1 
       157 |         3          0          0          0 |         3 
       158 |         3          0          0          0 |         3 
       159 |         5          0          0          0 |         5 
       160 |         4          0          0          0 |         4 
       161 |         3          0          0          0 |         3 
       162 |         2          0          0          0 |         2 
       163 |         3          0          0          0 |         3 
       164 |         1          0          0          0 |         1 
       165 |         8          0          0          0 |         8 
       167 |         3          0          0          0 |         3 
       169 |         1          0          0          0 |         1 
       170 |         4          0          0          0 |         4 
       171 |         2          0          0          0 |         2 
       172 |         2          0          0          0 |         2 
       173 |         4          0          0          0 |         4 
       174 |         1          0          0          0 |         1 
       175 |         2          0          0          0 |         2 
       176 |         2          0          0          0 |         2 
       177 |         2          0          0          0 |         2 
       178 |         1          0          0          0 |         1 
       179 |         2          0          0          0 |         2 
       180 |         2          0          0          0 |         2 
       181 |         3          0          0          0 |         3 
       183 |         1          0          0          0 |         1 
       184 |         1          0          0          0 |         1 
       185 |         2          0          0          0 |         2 
       186 |         1          0          0          0 |         1 
       187 |         1          0          0          0 |         1 
       188 |         1          0          0          0 |         1 
       189 |         2          0          0          0 |         2 
       191 |         2          0          0          0 |         2 
       192 |         3          0          0          0 |         3 
       193 |         1          0          0          0 |         1 
       194 |         1          0          0          0 |         1 
       196 |         4          0          0          0 |         4 
       197 |         1          0          0          0 |         1 
       198 |         1          0          0          0 |         1 
       199 |         1          0          0          0 |         1 
       200 |         2          0          0          0 |         2 
       201 |         1          0          0          0 |         1 
       202 |         4          0          0          0 |         4 
       203 |         1          0          0          0 |         1 
       206 |         1          0          0          0 |         1 
       207 |         1          0          0          0 |         1 
       208 |         1          0          0          0 |         1 
       210 |         1          0          0          0 |         1 
       211 |         1          0          0          0 |         1 
       213 |         1          0          0          0 |         1 
       214 |         3          0          0          0 |         3 
       215 |         1          0          0          0 |         1 
       216 |         1          0          0          0 |         1 
       218 |         1          0          0          0 |         1 
       220 |         2          0          0          0 |         2 
       222 |         1          0          0          0 |         1 
       224 |         2          0          0          0 |         2 
       227 |         1          0          0          0 |         1 
       228 |         1          0          0          0 |         1 
       229 |         1          0          0          0 |         1 
       230 |         2          0          0          0 |         2 
       233 |         3          0          0          0 |         3 
       234 |         1          0          0          0 |         1 
       235 |         1          0          0          0 |         1 
       236 |         2          0          0          0 |         2 
       237 |         1          0          0          0 |         1 
       239 |         2          0          0          0 |         2 
       243 |         2          0          0          0 |         2 
       244 |         1          0          0          0 |         1 
       246 |         1          0          0          0 |         1 
       247 |         1          0          0          0 |         1 
       249 |         1          0          0          0 |         1 
       253 |         1          0          0          0 |         1 
       256 |         1          0          0          0 |         1 
       261 |         1          0          0          0 |         1 
       263 |         2          0          0          0 |         2 
       265 |         2          0          0          0 |         2 
       266 |         1          0          0          0 |         1 
       267 |         1          0          0          0 |         1 
       274 |         1          0          0          0 |         1 
       277 |         1          0          0          0 |         1 
       279 |         1          0          0          0 |         1 
       280 |         1          0          0          0 |         1 
       282 |         1          0          0          0 |         1 
       283 |         1          0          0          0 |         1 
       284 |         1          0          0          0 |         1 
       286 |         1          0          0          0 |         1 
       287 |         1          0          0          0 |         1 
       289 |         1          0          0          0 |         1 
       293 |         1          0          0          0 |         1 
       315 |         1          0          0          0 |         1 
       317 |         1          0          0          0 |         1 
       355 |         1          0          0          0 |         1 
-----------+--------------------------------------------+----------
     Total |     2,963        226        245        217 |     3,651 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |         0        350        376        358 |     1,084 
           |      0.00       7.16       7.50       7.25 |      1.95 
-----------+--------------------------------------------+----------
         1 |    40,746      4,537      4,634      4,581 |    54,498 
           |    100.00      92.84      92.50      92.75 |     98.05 
-----------+--------------------------------------------+----------
     Total |    40,746      4,887      5,010      4,939 |    55,582 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |         drug
      ends | sotrovima  molnupira |     Total
-----------+----------------------+----------
         1 |         0          1 |         1 
           |      0.00     100.00 |     50.00 
-----------+----------------------+----------
         2 |         1          0 |         1 
           |    100.00       0.00 |     50.00 
-----------+----------------------+----------
     Total |         1          1 |         2 
           |    100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid,molnupiravir)&d
> rug==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends | sotrovima |     Total
-----------+-----------+----------
         5 |         2 |         2 
           |     18.18 |     18.18 
-----------+-----------+----------
         8 |         1 |         1 
           |      9.09 |      9.09 
-----------+-----------+----------
        10 |         2 |         2 
           |     18.18 |     18.18 
-----------+-----------+----------
        15 |         1 |         1 
           |      9.09 |      9.09 
-----------+-----------+----------
        16 |         1 |         1 
           |      9.09 |      9.09 
-----------+-----------+----------
        17 |         1 |         1 
           |      9.09 |      9.09 
-----------+-----------+----------
        21 |         2 |         2 
           |     18.18 |     18.18 
-----------+-----------+----------
        22 |         1 |         1 
           |      9.09 |      9.09 
-----------+-----------+----------
     Total |        11 |        11 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,molnupiravir)
> &drug==2,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends |  paxlovid |     Total
-----------+-----------+----------
         1 |         1 |         1 
           |     16.67 |     16.67 
-----------+-----------+----------
         9 |         1 |         1 
           |     16.67 |     16.67 
-----------+-----------+----------
        11 |         1 |         1 
           |     16.67 |     16.67 
-----------+-----------+----------
        13 |         1 |         1 
           |     16.67 |     16.67 
-----------+-----------+----------
        15 |         1 |         1 
           |     16.67 |     16.67 
-----------+-----------+----------
        22 |         1 |         1 
           |     16.67 |     16.67 
-----------+-----------+----------
     Total |         6 |         6 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid)&dru
> g==3,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  analysis |
 time when |
    record |    drug
      ends | molnupira |     Total
-----------+-----------+----------
         8 |         2 |         2 
           |     25.00 |     25.00 
-----------+-----------+----------
        10 |         1 |         1 
           |     12.50 |     12.50 
-----------+-----------+----------
        12 |         1 |         1 
           |     12.50 |     12.50 
-----------+-----------+----------
        15 |         2 |         2 
           |     25.00 |     25.00 
-----------+-----------+----------
        17 |         1 |         1 
           |     12.50 |     12.50 
-----------+-----------+----------
        19 |         1 |         1 
           |     12.50 |     12.50 
-----------+-----------+----------
     Total |         8 |         8 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid,moln
> upiravir)&drug==0,m col
no observations

. 
. 
. save "$projectdir/output/data/main.dta", replace
(note: file /workspace/output/data/main.dta not found)
file /workspace/output/data/main.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:  19 Jun 2023, 10:43:06
-------------------------------------------------------------------------------
