-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafel
> y\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/clea
> ning_dataset.log
  log type:  text
 opened on:   6 Jun 2023, 22:21:20

. 
. * import dataset
. import delimited "$projectdir/output/input.csv", clear
(encoding automatically selected: ISO-8859-1)
(204 vars, 50,000 obs)

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\Op
> enSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/an
> alysis/ado"

. 
. //describe
. //codebook
. 
. *********************************
. *       Convert strings to dates     *
. ********************************* 
. foreach var of varlist   covid_test_positive_date                            
>    ///
>                                                  covid_test_positive_date2   
>                            ///
>                                                  covid_test_positive_date3   
>                            ///
>                                                  covid_test_positive_treat   
>                            ///
>                                                  prior_covid_date            
>                            ///
>                                                  sotrovimab                  
>                                            ///
>                                                  molnupiravir                
>                                    /// 
>                                                  paxlovid                    
>                                            ///
>                                                  remdesivir                  
>                                            ///
>                                                  casirivimab                 
>                                    ///
>                                                  sotrovimab_not_start        
>                            ///
>                                                  molnupiravir_not_start      
>                            ///
>                                                  paxlovid_not_start          
>                                    ///
>                                                  date_treated                
>                                    ///
>                                                  start_date                  
>                                            ///
>                                                  start_date_test             
>                                    ///
>                                                  drugs_paxlovid_interaction  
>                            ///
>                                                  drugs_nirmatrelvir_interacti
> on                 ///
>                                                  last_vaccination_date       
>                            ///
>                                                  death_date                  
>                                            ///
>                                                  dereg_date                  
>                                    ///
>                                                  bmi_date_measured           
>                                    ///
>                                                  creatinine_ctv3_date        
>                            ///
>                                                  creatinine_snomed_date      
>                            ///
>                                                  creatinine_short_snomed_date
>                    ///
>                                                  ae_diverticulitis_icd       
>                            ///
>                                                  ae_diverticulitis_snomed    
>                            ///
>                                                  ae_diarrhoea_snomed         
>                            ///
>                                                  ae_taste_snomed             
>                                    ///
>                                                  ae_taste_icd                
>                                    ///
>                                                  ae_rash_snomed              
>                                    ///
>                                                  ae_anaphylaxis_icd          
>                                    ///
>                                                  ae_anaphylaxis_snomed       
>                            ///
>                                                  ae_anaphlaxis_ae            
>                                    ///
>                                                  ae_drugreact_ae             
>                                    ///
>                                                  ae_allergic_ae              
>                                    ///
>                                                  ae_rheumatoid_arthritis_snom
> ed                 ///
>                                                  ae_rheumatoid_arthritis_icd 
>                    ///
>                                                  ae_sle_ctv                  
>                                            ///
>                                                  ae_sle_icd                  
>                                            ///
>                                                  ae_psoriasis_snomed         
>                            ///
>                                                  ae_psoriatic_arthritis_snome
> d                  ///
>                                                  ae_ankylosing_spondylitis_ct
> v                  ///
>                                                  ae_ibd_snomed               
>                                    ///
>                                                  ae_diverticulitis_ae        
>                            ///
>                                                  ae_rheumatoid_arthritis_ae  
>                            ///
>                                                  ae_sle_ae                   
>                                            ///
>                                                  ae_psoriasis_ae             
>                                    ///
>                                                  ae_psoriatic_arthritis_ae   
>                            ///
>                                                  ae_ankylosing_spondylitis_ae
>                    ///
>                                                  ae_ibd_ae                   
>                                            ///
>                                                  rheumatoid_arthritis_nhsd_sn
> omed               ///
>                                                  rheumatoid_arthritis_nhsd_ic
> d10                ///
>                                                  sle_nhsd_ctv                
>                                    ///
>                                                  sle_nhsd_icd10              
>                                    ///
>                                                  psoriasis_nhsd              
>                                    ///
>                                                  psoriatic_arthritis_nhsd    
>                            ///
>                                                  ankylosing_spondylitis_nhsd 
>                    ///
>                                                  ibd_ctv                     
>                                            ///
>                                                  allcause_emerg_aande        
>                            ///
>                                                  all_hosp_date               
>                                    ///
>                                                  all_hosp_date0              
>                                    ///
>                                                  all_hosp_date1              
>                                    ///
>                                                  all_hosp_date2              
>                                    ///
>                                                  hosp_discharge_date         
>                            ///
>                                                  hosp_discharge_date0        
>                            ///
>                                                  hosp_discharge_date1        
>                            ///
>                                                  hosp_discharge_date2        
>                            ///
>                                                  covid_hosp_date             
>                                    ///
>                                                  covid_hosp_date0            
>                                    ///
>                                                  covid_hosp_date1            
>                                    ///
>                                                  covid_hosp_date2            
>                                    ///                                       
>       
>                                                  covid_discharge_date        
>                            ///
>                                                  covid_discharge_date0       
>                            ///                                             
>                                                  covid_discharge_date1       
>                            /// 
>                                                  covid_discharge_date2       
>                            /// 
>                                                  any_covid_hosp_discharge    
>                            ///                     
>                                                  covid_hosp_date_mabs        
>                            /// 
>                                                  covid_hosp_date_mabs_not_pri
> mary               /// 
>                                                  died_date_ons               
>                                    ///
>                                                  died_ons_covid              
>                                    ///
>                                                   pre_diverticulitis_icd     
>                            ///
>                                                  pre_diverticulitis_snomed   
>                            ///
>                                                  pre_diverticulitis_ae       
>                            ///
>                                                  pre_diarrhoea_snomed        
>                            ///
>                                                  pre_taste_snomed            
>                                    ///
>                                                  pre_taste_icd               
>                                    ///
>                                                  pre_rash_snomed             
>                                    ///
>                                                  pre_anaphylaxis_icd         
>                            ///
>                                                  pre_anaphylaxis_snomed      
>                            ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_drugreact_ae            
>                                    ///
>                                                  pre_allergic_ae             
>                                    ///
>                                                  pre_anaphlaxis_ae           
>                                    ///
>                                                  pre_rheumatoid_arthritis_ae 
>                    ///
>                                                  pre_rheumatoid_arthritis_sno
> med                ///
>                                                  pre_rheumatoid_arthritis_icd
>                    ///
>                                                  pre_ankylosing_spondylitis_c
> tv                 ///
>                                                  pre_ankylosing_spondylitis_a
> e                  ///
>                                                  pre_psoriasis_snomed        
>                            ///
>                                                  pre_psoriasis_ae            
>                                    ///
>                                                  pre_psoriatic_arthritis_ae  
>                            ///
>                                                  pre_psoriatic_arthritis_snom
> ed                 ///
>                                                  pre_sle_ctv                 
>                                    ///
>                                                  pre_sle_icd                 
>                                    ///
>                                                  pre_sle_ae                  
>                                            ///
>                                                  pre_ibd_snomed {            
>                             
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(30,000 missing values generated)
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(29,532 missing values generated)
(3,016 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(30,000 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(45,000 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(49,500 missing values generated)
(47,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)

. 
. ****************************
. *       EXPOSURE                *
. ****************************
. ** removing individuals who did not start therapy
. foreach var of varlist sotrovimab molnupiravir paxlovid {
  2.     display "`var'"
  3.         count if `var'!=.
  4.         count if `var'==date_treated & `var'!=. & date_treated!=.
  5.         gen `var'_start = 1 if `var'==date_treated & `var'!=. & date_treat
> ed!=. & `var'_not_start==.
  6.         replace `var'_start = 0 if `var'==date_treated & `var'!=. & date_t
> reated!=. & `var'_not_start!=.
  7.         tab `var'_start, m  //number on treatment, first drug given, and d
> rug was started
  8. }
sotrovimab
  5,000
  4,096
(45,951 missing values generated)
(47 real changes made)

sotrovimab_ |
      start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         47        0.09        0.09
          1 |      4,049        8.10        8.19
          . |     45,904       91.81      100.00
------------+-----------------------------------
      Total |     50,000      100.00
molnupiravir
  5,000
  4,091
(45,955 missing values generated)
(46 real changes made)

molnupiravi |
    r_start |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         46        0.09        0.09
          1 |      4,045        8.09        8.18
          . |     45,909       91.82      100.00
------------+-----------------------------------
      Total |     50,000      100.00
paxlovid
  5,000
  4,076
(45,965 missing values generated)
(41 real changes made)

paxlovid_st |
        art |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         41        0.08        0.08
          1 |      4,035        8.07        8.15
          . |     45,924       91.85      100.00
------------+-----------------------------------
      Total |     50,000      100.00

. gen drug=1 if sotrovimab==date_treated & sotrovimab_start==1 
(45,951 missing values generated)

. replace drug=2 if paxlovid==date_treated & paxlovid_start==1
(4,035 real changes made)

. replace drug=3 if molnupiravir==date_treated & molnupiravir_start==1
(4,045 real changes made)

. replace drug=4 if sotrovimab==date_treated & sotrovimab_start==0 
(47 real changes made)

. replace drug=5 if paxlovid==date_treated & paxlovid_start==0 
(41 real changes made)

. replace drug=6 if molnupiravir==date_treated & molnupiravir_start==0 
(46 real changes made)

. replace drug=7 if remdesivir==date_treated&remdesivir!=.&date_treated!=.
(4,088 real changes made)

. replace drug=8 if casirivimab==date_treated&casirivimab!=.&date_treated!=.
(4,123 real changes made)

. replace drug=0 if drug==.
(29,532 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir", re
> place

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     29,532       59.06       59.06
  sotrovimab |      4,046        8.09       67.16
    paxlovid |      4,035        8.07       75.23
molnupiravir |      4,043        8.09       83.31
           4 |         47        0.09       83.41
           5 |         41        0.08       83.49
           6 |         46        0.09       83.58
           7 |      4,087        8.17       91.75
           8 |      4,123        8.25      100.00
-------------+-----------------------------------
       Total |     50,000      100.00

. drop if drug>3
(8,344 observations deleted)

. ** start date is date treatment for treatment arms and date of covid test for
>  control arm 
. count if start_date==. //should be 0
  1,805

. count if start_date!=covid_test_positive_date & drug==0  //should be 0
  27,727

. count if start_date!=date_treated & start_date!=covid_test_positive_treat & d
> rug>0 //should be 0
  12,124

. count if start_date!=date_treated & drug>0  // i.e. start date is covid_test_
> positive_treat
  12,124

. count if start_date==covid_test_positive_treat & start_date!=date_treated & d
> rug>0  // i.e. start date is covid_test_positive_treat
  0

. gen time_startanddrug = (date_treated-start_date) if start_date!=date_treated
>  & drug>0
(29,532 missing values generated)

. tabstat time_startanddrug, stat(count mean p25 p50 p75 min max)  // time betw
> een start date and drug 

    Variable |         N      Mean       p25       p50       p75       Min
-------------+------------------------------------------------------------
time_start~g |     12124  20860.47     20726     20852     20992     20608
--------------------------------------------------------------------------

    Variable |       Max
-------------+----------
time_start~g |     21144
------------------------

. //replace start_date=covid_test_positive_date if drug==0 
. //replace start_date=date_treated if drug>0
. ** check number of positive covid tests prior to drug in treatment arms
. bys drug:count if covid_test_positive_date==. // should be 0 in control arm

-------------------------------------------------------------------------------
-> drug = control
  2,978
-------------------------------------------------------------------------------
-> drug = sotrovimab
  420
-------------------------------------------------------------------------------
-> drug = paxlovid
  416
-------------------------------------------------------------------------------
-> drug = molnupiravir
  409

. bys drug:count if covid_test_positive_date!=. 

-------------------------------------------------------------------------------
-> drug = control
  26,554
-------------------------------------------------------------------------------
-> drug = sotrovimab
  3,626
-------------------------------------------------------------------------------
-> drug = paxlovid
  3,619
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3,634

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& date_treated>c
> ovid_test_positive_date //test prior to treatment

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,715
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,718
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,762

. bys drug:count if covid_test_positive_date!=.&date_treated!=.& (date_treated-
> covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5) //test
>  <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  36
-------------------------------------------------------------------------------
-> drug = paxlovid
  45
-------------------------------------------------------------------------------
-> drug = molnupiravir
  23

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& date_treated<
> covid_test_positive_date2 //2nd covid episode prior to treatment 

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  193
-------------------------------------------------------------------------------
-> drug = paxlovid
  195
-------------------------------------------------------------------------------
-> drug = molnupiravir
  216

. bys drug:count if covid_test_positive_date2!=.&date_treated!=.& (date_treated
> -covid_test_positive_date2>0)&(date_treated-covid_test_positive_date2<=5) //t
> est <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  5
-------------------------------------------------------------------------------
-> drug = paxlovid
  7
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& date_treated<
> covid_test_positive_date3 //3rd covid episode prior to treatment 

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  232
-------------------------------------------------------------------------------
-> drug = paxlovid
  206
-------------------------------------------------------------------------------
-> drug = molnupiravir
  200

. bys drug:count if covid_test_positive_date3!=.&date_treated!=.& (date_treated
> -covid_test_positive_date3>0)&(date_treated-covid_test_positive_date3<=5) //t
> est <5d

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  4
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3

. ** check in control group that covid positive, and not repeat covid test afte
> r an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days if drug==0

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,852        149 |     3,001 
         1 |    25,207      1,324 |    26,531 
-----------+----------------------+----------
     Total |    28,059      1,473 |    29,532 

. drop if drug==0 & covid_test_positive==1 & covid_positive_previous_30_days==1
(1,324 observations deleted)

. ** gen study start and study end date
. gen campaign_start=mdy(12,16,2021)

. gen study_end_date=mdy(06,01,2023)

. gen start_date_29=date_treated+28
(28,208 missing values generated)

. format campaign_start study_end_date start_date_29 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ** inclusion criteria*
. keep if age>=18 & age<110
(8,516 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(1,594 observations deleted)

. ** exclusion criteria*
. count if start_date>dereg_date & start_date!=.
  0

. count if start_date>death_date & start_date!=.
  0

. drop if start_date>death_date | start_date>dereg_date
(246 observations deleted)

. 
. ** high risk cohort from blueteq therapeutics datafor drug arms
. tab high_risk_cohort_therapeutics drug,m //should be 0 in control group

high_risk_cohort_ther |                    drug
             apeutics |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
       Downs syndrome |     2,149        287        293        302 |     3,031 
          HIV or AIDS |     1,073        164        144        173 |     1,554 
                 IMID |     2,082        322        303        303 |     3,010 
    IMID,solid cancer |     2,149        300        307        314 |     3,070 
                   NA |     1,035        127        172        144 |     1,478 
haematological dise.. |     1,035        122        135        147 |     1,439 
haematological mali.. |     1,034        159        150        158 |     1,501 
        liver disease |     1,068        173        148        146 |     1,535 
primary immune defi.. |     2,111        277        318        294 |     3,000 
sickle cell disease.. |     2,101        280        302        288 |     2,971 
         solid cancer |     2,010        316        280        325 |     2,931 
solid organ transpl.. |     2,102        301        282        294 |     2,979 
stem cell transplan.. |     1,010        142        153        172 |     1,477 
----------------------+--------------------------------------------+----------
                Total |    20,959      2,970      2,987      3,060 |    29,976 

. gen downs_syndrome_therap= 1 if strpos(high_risk_cohort_therapeutics, "Downs 
> syndrome")
(26,945 missing values generated)

. gen solid_cancer_therap=1 if strpos(high_risk_cohort_therapeutics, "solid can
> cer")
(23,975 missing values generated)

. gen haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haematolo
> gical malignancies")
(28,475 missing values generated)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "sickl
> e cell disease")
(2,971 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "haema
> tological diseases")
(1,439 real changes made)

. replace haem_disease_therap=1 if strpos(high_risk_cohort_therapeutics, "stem 
> cell transplant")
(1,477 real changes made)

. gen renal_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "renal d
> isease")
(26,997 missing values generated)

. gen liver_disease_therap= 1 if strpos(high_risk_cohort_therapeutics, "liver d
> isease")
(28,441 missing values generated)

. gen imid_on_drug_therap= 1 if strpos(high_risk_cohort_therapeutics, "IMID")
(23,896 missing values generated)

. gen immunosupression_therap= 1 if strpos(high_risk_cohort_therapeutics, "prim
> ary immune deficiencies")
(26,976 missing values generated)

. gen hiv_aids_therap= 1 if strpos(high_risk_cohort_therapeutics, "HIV or AIDS"
> )
(28,422 missing values generated)

. gen organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "soli
> d organ recipients")
(29,976 missing values generated)

. replace organ_transplant_therap= 1 if strpos(high_risk_cohort_therapeutics, "
> solid organ transplant")
(2,979 real changes made)

. gen rare_neuro_therap= 1 if strpos(high_risk_cohort_therapeutics, "rare neuro
> logical conditions")
(27,005 missing values generated)

. bys drug: count if high_risk_cohort_therapeutics!=""&high_risk_cohort_therape
> utics!="other"& min(downs_syndrome_therap,solid_cancer_therap,haem_disease_th
> erap,renal_disease_therap,liver_disease_therap,imid_on_drug_therap,immunosupr
> ession_therap,hiv_aids_therap,organ_transplant_therap,rare_neuro_therap)==. /
> /check if all diseases have been captured

-------------------------------------------------------------------------------
-> drug = control
  1,035
-------------------------------------------------------------------------------
-> drug = sotrovimab
  127
-------------------------------------------------------------------------------
-> drug = paxlovid
  172
-------------------------------------------------------------------------------
-> drug = molnupiravir
  144

. tab drug high_risk_cohort_therapeutics if high_risk_cohort_therapeutics!=""&h
> igh_risk_cohort_therapeutics!="other"& min(downs_syndrome_therap,solid_cancer
> _therap,haem_disease_therap,renal_disease_therap,liver_disease_therap,imid_on
> _drug_therap,immunosupression_therap,hiv_aids_therap,organ_transplant_therap,
> rare_neuro_therap)==.

             | high_risk_
             | cohort_the
             | rapeutics
        drug |        NA |     Total
-------------+-----------+----------
     control |     1,035 |     1,035 
  sotrovimab |       127 |       127 
    paxlovid |       172 |       172 
molnupiravir |       144 |       144 
-------------+-----------+----------
       Total |     1,478 |     1,478 

. foreach var of varlist downs_syndrome_therap solid_cancer_therap haem_disease
> _therap renal_disease_therap liver_disease_therap imid_on_drug_therap immunos
> upression_therap hiv_aids_therap organ_transplant_therap rare_neuro_therap{
  2.         replace `var'=0 if `var'==. 
  3. }
(26,945 real changes made)
(23,975 real changes made)
(22,588 real changes made)
(26,997 real changes made)
(28,441 real changes made)
(23,896 real changes made)
(26,976 real changes made)
(28,422 real changes made)
(26,997 real changes made)
(27,005 real changes made)

. 
. ** high risk cohort from open codelist from control group
. tab high_risk_cohort_nhsd drug,m //should be no 0s in control group

high_risk_ |
cohort_nhs |                    drug
         d |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |       450         53         66         79 |       648 
         1 |    20,509      2,917      2,921      2,981 |    29,328 
-----------+--------------------------------------------+----------
     Total |    20,959      2,970      2,987      3,060 |    29,976 

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be 0
  8,129

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & downs_syndrome==0 &s
> olid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosu
> pression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  374

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 //should be 0
  336

. count if imid_on_drug==1 & imid_nhsd==0 & imid_drug==1 & downs_syndrome==0 &s
> olid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosu
> pression==0 &hiv_aids==0 &organ_transplant==0 &rare_neuro==0
  10

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  293

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 
  284

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_dr
> ug==1
  157

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immun
> osuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_on_dr
> ug==1 &downs_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 
> &liver_disease==0 &immunosupression==0 &hiv_aids==0 &organ_transplant==0 &rar
> e_neuro==0
  7

. replace imid_on_drug=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_dru
> gs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenola
> te==0 &imid_on_drug==1 //ignore if steriods<4 scripts in 6m & not coded other
>  imid drug 
(157 real changes made)

. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_
> steroid_drugs_nhsd==1 //ignore if steriods<4 scripts in 6m
(293 real changes made)

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 //should be same numbe
> r as those dropped above 
  8,129

. replace imid_on_drug=0 if imid_nhsd==1 & imid_drug==0 
(8,129 real changes made)

. replace imid_on_drug=0 if imid_nhsd==0 & imid_drug==1 
(271 real changes made)

. gen high_risk_cohort_codelist=((downs_syndrome + solid_cancer + haem_disease 
> + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids 
> + organ_transplant + rare_neuro )>0)

. tab high_risk_cohort_nhsd high_risk_cohort_codelist

high_risk_ | high_risk_cohort_code
cohort_nhs |         list
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |       648          0 |       648 
         1 |       387     28,941 |    29,328 
-----------+----------------------+----------
     Total |     1,035     28,941 |    29,976 

. 
. ** combine two high risk cohorts into one 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease
>  liver_disease imid_on_drug immunosupression hiv_aids organ_transplant rare_n
> euro {
  2.         gen `var'_comb = `var'
  3.         replace `var'_comb = 1 if `var'_therap==1 
  4.         tab `var' `var'_therap 
  5.         tab `var'_comb
  6. }
(2,448 real changes made)

downs_synd | downs_syndrome_therap
      rome |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,770      2,448 |    24,218 
         1 |     5,175        583 |     5,758 
-----------+----------------------+----------
     Total |    26,945      3,031 |    29,976 

downs_syndr |
   ome_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,770       72.62       72.62
          1 |      8,206       27.38      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(5,398 real changes made)

solid_canc |  solid_cancer_therap
        er |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,520      5,398 |    26,918 
         1 |     2,455        603 |     3,058 
-----------+----------------------+----------
     Total |    23,975      6,001 |    29,976 

solid_cance |
     r_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,520       71.79       71.79
          1 |      8,456       28.21      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(3,906 real changes made)

haem_disea |  haem_disease_therap
        se |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,993      3,906 |    15,899 
         1 |    10,595      3,482 |    14,077 
-----------+----------------------+----------
     Total |    22,588      7,388 |    29,976 

haem_diseas |
     e_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,993       40.01       40.01
          1 |     17,983       59.99      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(1,960 real changes made)

renal_dise | renal_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,739      1,960 |    19,699 
         1 |     9,258      1,019 |    10,277 
-----------+----------------------+----------
     Total |    26,997      2,979 |    29,976 

renal_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,739       59.18       59.18
          1 |     12,237       40.82      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(1,231 real changes made)

liver_dise | liver_disease_therap
       ase |         0          1 |     Total
-----------+----------------------+----------
         0 |    23,073      1,231 |    24,304 
         1 |     5,368        304 |     5,672 
-----------+----------------------+----------
     Total |    28,441      1,535 |    29,976 

liver_disea |
    se_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,073       76.97       76.97
          1 |      6,903       23.03      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(4,758 real changes made)

imid_on_dr |  imid_on_drug_therap
        ug |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,702      4,758 |    23,460 
         1 |     5,194      1,322 |     6,516 
-----------+----------------------+----------
     Total |    23,896      6,080 |    29,976 

imid_on_dru |
     g_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,702       62.39       62.39
          1 |     11,274       37.61      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(2,704 real changes made)

           | immunosupression_ther
immunosupr |          ap
    ession |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,288      2,704 |    26,992 
         1 |     2,688        296 |     2,984 
-----------+----------------------+----------
     Total |    26,976      3,000 |    29,976 

immunosupre |
 ssion_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,288       81.02       81.02
          1 |      5,688       18.98      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(1,246 real changes made)

           |    hiv_aids_therap
  hiv_aids |         0          1 |     Total
-----------+----------------------+----------
         0 |    23,045      1,246 |    24,291 
         1 |     5,377        308 |     5,685 
-----------+----------------------+----------
     Total |    28,422      1,554 |    29,976 

hiv_aids_co |
         mb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,045       76.88       76.88
          1 |      6,931       23.12      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(2,033 real changes made)

           | organ_transplant_ther
organ_tran |          ap
    splant |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,565      2,033 |    20,598 
         1 |     8,432        946 |     9,378 
-----------+----------------------+----------
     Total |    26,997      2,979 |    29,976 

organ_trans |
 plant_comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,565       61.93       61.93
          1 |     11,411       38.07      100.00
------------+-----------------------------------
      Total |     29,976      100.00
(1,293 real changes made)

           |   rare_neuro_therap
rare_neuro |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,604      1,293 |    12,897 
         1 |    15,401      1,678 |    17,079 
-----------+----------------------+----------
     Total |    27,005      2,971 |    29,976 

rare_neuro_ |
       comb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,604       38.71       38.71
          1 |     18,372       61.29      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. 
. ****************************
. *       OUTCOME         *
. ****************************
. *** AESI, IMAE and some Drug reaction (need to add further IMAE and DRESS, SJ
> S, TEN) 
. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_
> snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(20,232 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis
> _nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0
(20,226 missing values generated)

. gen new_ae_ra_ae = ae_rheumatoid_arthritis_ae if rheumatoid_arthritis_nhsd_sn
> omed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(20,166 missing values generated)

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(20,272 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(20,196 missing values generated)

. gen new_ae_sle_ae = ae_sle_ae if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(20,232 missing values generated)

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(19,135 missing values generated)

. gen new_ae_psoriasis_ae = ae_psoriasis_ae if psoriasis_nhsd==0
(19,187 missing values generated)

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_
> nhsd==0
(19,158 missing values generated)

. gen new_ae_psa_ae = ae_psoriatic_arthritis_ae if psoriatic_arthritis_nhsd==0
(19,167 missing values generated)

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondyli
> tis_nhsd==0
(19,207 missing values generated)

. gen new_ae_ankspon_ae = ae_ankylosing_spondylitis_ae if ankylosing_spondyliti
> s_nhsd==0
(19,137 missing values generated)

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(19,108 missing values generated)

. gen new_ae_ibd_ae = ae_ibd_ae if ibd_ctv==0
(19,095 missing values generated)

. 
. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed          
>                    ///
>                                                 ae_taste_snomed              
>                            

. global ae_spc_icd               ae_diverticulitis_icd                   ///
>                                                 ae_taste_icd                 
>                    

. global ae_spc_emerg             ae_diverticulitis_ae                         
>                                            

. global ae_drug                  ae_anaphylaxis_snomed                   ///  
>    
>                                                 ae_rash_snomed  

. global ae_drug_emerg    ae_anaphlaxis_ae                                ///
>                                                 ae_drugreact_ae              
>                    ///
>                                                 ae_allergic_ae               
>                                                                        

. global ae_drug_icd              ae_anaphylaxis_icd

. global ae_imae                  new_ae_ra_snomed                             
>    ///
>                                                 new_ae_sle_ctv               
>                    ///
>                                                 new_ae_psoriasis_snomed      
>            ///
>                                                 new_ae_psa_snomed            
>                    ///
>                                                 new_ae_ankspon_ctv           
>                    ///
>                                                 new_ae_ibd_snomed       

. global ae_imae_icd              new_ae_ra_icd                                
>    ///
>                                                 new_ae_sle_icd          

. global ae_imae_emerg    new_ae_ra_ae                                    ///
>                                                 new_ae_sle_ae                
>                    ///
>                                                 new_ae_psoriasis_ae          
>                    ///
>                                                 new_ae_psa_ae                
>                    ///
>                                                 new_ae_ankspon_ae            
>                    ///
>                                                 new_ae_ibd_ae                
>            

.                                                                         
. *remove event if occurred before start
. foreach x in $ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $ae_drug
> _emerg $ae_imae $ae_imae_icd $ae_drug_emerg{
  2.                                 display "`x'"
  3.                                 count if (`x' > start_date | `x' < start_d
> ate + 28) & `x'!=. 
  4.                                 count if (`x' < start_date | `x' > start_d
> ate + 28) & `x'!=. & drug==0
  5.                                 count if (`x' < start_date | `x' > start_d
> ate + 28) & `x'!=. & drug>0
  6.                                 //replace `x'=. if (`x' < start_date | `x'
>  > start_date + 28) & `x'!=.
. }
ae_diverticulitis_snomed
  11,864
  8,336
  3,528
ae_diarrhoea_snomed
  11,978
  8,353
  3,625
ae_taste_snomed
  11,864
  8,289
  3,575
ae_diverticulitis_icd
  11,882
  8,365
  3,517
ae_taste_icd
  11,933
  8,325
  3,608
ae_diverticulitis_ae
  11,969
  8,301
  3,668
ae_anaphylaxis_snomed
  11,971
  8,363
  3,608
ae_rash_snomed
  11,947
  8,360
  3,587
ae_anaphylaxis_icd
  11,982
  8,333
  3,649
ae_anaphlaxis_ae
  11,984
  8,375
  3,609
ae_drugreact_ae
  11,957
  8,355
  3,602
ae_allergic_ae
  11,882
  8,275
  3,607
new_ae_ra_snomed
  9,750
  6,784
  2,966
new_ae_sle_ctv
  9,780
  6,830
  2,950
new_ae_psoriasis_snomed
  10,841
  7,546
  3,295
new_ae_psa_snomed
  10,818
  7,638
  3,180
new_ae_ankspon_ctv
  10,769
  7,554
  3,215
new_ae_ibd_snomed
  10,868
  7,602
  3,266
new_ae_ra_icd
  9,744
  6,843
  2,901
new_ae_sle_icd
  9,704
  6,791
  2,913
ae_anaphlaxis_ae
  11,984
  8,375
  3,609
ae_drugreact_ae
  11,957
  8,355
  3,602
ae_allergic_ae
  11,882
  8,275
  3,607

. egen ae_spc_gp = rmin($ae_spc)
(6,572 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(10,970 missing values generated)

. egen ae_spc_emerg = rmin($ae_spc_emerg)
(18,007 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg)
(1,468 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(10,862 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(17,994 missing values generated)

. egen ae_drug_emerg = rmin($ae_drug_emerg)
(6,574 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd $ae_drug_emerg)
(1,419 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)
(2,256 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(13,657 missing values generated)

. egen ae_imae_emerg = rmin($ae_imae_emerg)
(2,290 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd $ae_imae_emerg)   
(111 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_spc_emerg $ae_drug $ae_drug_icd $a
> e_drug_emerg $ae_imae $ae_imae_icd $ae_imae_emerg)

. egen ae_all_serious = rmin($ae_spc_icd $ae_spc_emerg $ae_drug_icd $ae_drug_em
> erg $ae_imae_icd $ae_imae_emerg)
(28 missing values generated)

. by drug, sort: count if ae_spc_all!=.

-------------------------------------------------------------------------------
-> drug = control
  19,922
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,812
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,844
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,930

. by drug, sort: count if ae_drug_all!=.

-------------------------------------------------------------------------------
-> drug = control
  19,972
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,826
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,836
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,923

. by drug, sort: count if ae_imae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  20,886
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,963
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,969
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3,047

. by drug, sort: count if ae_all!=.

-------------------------------------------------------------------------------
-> drug = control
  20,959
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,970
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,987
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3,060

. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. * a&e all admission
. bys drug: count if allcause_emerg_aande!=.

-------------------------------------------------------------------------------
-> drug = control
  1,027
-------------------------------------------------------------------------------
-> drug = sotrovimab
  140
-------------------------------------------------------------------------------
-> drug = paxlovid
  131
-------------------------------------------------------------------------------
-> drug = molnupiravir
  166

. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - t
> o ignore sotro initiators with mab procedure codes*
. bys drug: count if covid_hosp_date!=. // all covid hospitalisation

-------------------------------------------------------------------------------
-> drug = control
  2,094
-------------------------------------------------------------------------------
-> drug = sotrovimab
  289
-------------------------------------------------------------------------------
-> drug = paxlovid
  308
-------------------------------------------------------------------------------
-> drug = molnupiravir
  298

. bys drug: count if covid_hosp_date0!=. // hospitalisation after treatment dat
> e (control group will not have covid_hosp_date0)

-------------------------------------------------------------------------------
-> drug = control
  225
-------------------------------------------------------------------------------
-> drug = sotrovimab
  26
-------------------------------------------------------------------------------
-> drug = paxlovid
  32
-------------------------------------------------------------------------------
-> drug = molnupiravir
  29

. // covid admission is the same date as date treated 
. bys drug: count if covid_hosp_date0!=date_treated&covid_hosp_date0!=.&date_tr
> eated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  26
-------------------------------------------------------------------------------
-> drug = paxlovid
  32
-------------------------------------------------------------------------------
-> drug = molnupiravir
  29

. bys drug: count if covid_hosp_date1!=(date_treated+1) &covid_hosp_date1!=.&da
> te_treated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  31
-------------------------------------------------------------------------------
-> drug = paxlovid
  28
-------------------------------------------------------------------------------
-> drug = molnupiravir
  24

. // covid admission is the same date as date treated and is a daycase
. bys drug: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=
> .

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mab
> s!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mab
> s!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // covid admission is the same date as mab and is a daycase or 24 hour admiss
> ion
. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.
> &covid_hosp_date0==covid_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.
> &covid_hosp_date1==covid_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.
> &(covid_discharge_date0 - covid_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.
> &(covid_discharge_date1 - covid_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagr
> e, or dischagre preceed admission 
. count if covid_hosp_date!=.&covid_discharge_date==.
  2,945

. count if covid_hosp_date==.&covid_discharge_date!=.
  260

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date==covid_di
> scharge_date
  0

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date<covid_dis
> charge_date
  23

. count if covid_hosp_date!=.&covid_discharge_date!=.&covid_hosp_date>covid_dis
> charge_date
  21

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_ho
> sp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_ho
> sp_date1!=.  
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after 
> treatment date AND a mab procedures for sotro 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hos
> p_date_mabs!=.&drug==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hos
> p_date_mabs!=.&drug==1 
(0 real changes made)

. 
. *correcting ALL hosp events: admitted on day 0 or day 1 after treatment - to 
> ignore sotro initiators with mab procedure codes*
. bys drug: count if all_hosp_date!=. // all hospitalisation

-------------------------------------------------------------------------------
-> drug = control
  2,101
-------------------------------------------------------------------------------
-> drug = sotrovimab
  248
-------------------------------------------------------------------------------
-> drug = paxlovid
  292
-------------------------------------------------------------------------------
-> drug = molnupiravir
  319

. bys drug: count if all_hosp_date0!=. // hospitalisation after treatment date 
> (control group will not have all_hosp_date0)

-------------------------------------------------------------------------------
-> drug = control
  223
-------------------------------------------------------------------------------
-> drug = sotrovimab
  19
-------------------------------------------------------------------------------
-> drug = paxlovid
  24
-------------------------------------------------------------------------------
-> drug = molnupiravir
  23

. // admission is the same date as date treated 
. bys drug: count if all_hosp_date0!=date_treated&all_hosp_date0!=.&date_treate
> d!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  19
-------------------------------------------------------------------------------
-> drug = paxlovid
  24
-------------------------------------------------------------------------------
-> drug = molnupiravir
  23

. bys drug: count if all_hosp_date1!=(date_treated+1) &all_hosp_date1!=.&date_t
> reated!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  33
-------------------------------------------------------------------------------
-> drug = paxlovid
  34
-------------------------------------------------------------------------------
-> drug = molnupiravir
  41

. // admission is the same date as date treated and is a daycase
. bys drug: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!
> =.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!
> =.

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all
> _hosp_date0==hosp_discharge_date0

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all
> _hosp_date1==hosp_discharge_date1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(ho
> sp_discharge_date0-all_hosp_date0)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. bys drug: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(ho
> sp_discharge_date1-all_hosp_date1)==1

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

. // checking admission and discharge date; missing admission, missing dischagr
> e, or dischagre preceed admission 
. count if all_hosp_date!=.&hosp_discharge_date==.
  2,660

. count if all_hosp_date==.&hosp_discharge_date!=.
  2,713

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharg
> e_date
  0

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge
> _date
  151

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge
> _date
  149

. // REPLACE - ignore covid admission if admission is for covid AND day 0 or da
> y 1 after treatment AND daycase
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =hosp_discharge_date0&all_hosp_date0!=.
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1=
> =hosp_discharge_date1&all_hosp_date1!=.
(0 real changes made)

. // REPLACE - ignore admission if admission is for covid AND day 0 or day 1 af
> ter treatment AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date0 & all_hosp_date0=
> =covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date1 & all_hosp_date1=
> =covid_hosp_date_mabs & covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. foreach var of varlist allcause_emerg_aande covid_hosp_date all_hosp_date die
> d_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' > start_date & `
> var' < start_date + 28) & `var'!=.                            
  4.                                 bys drug: count if (`var' < start_date | `
> var' > start_date + 28) & `var'!=.                            
  5.                                 //replace `var'=. if (`var' < start_date |
>  `var' > start_date + 28) & `var'!=.
. }
allcause_emerg_aande

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  1,027
-------------------------------------------------------------------------------
-> drug = sotrovimab
  140
-------------------------------------------------------------------------------
-> drug = paxlovid
  131
-------------------------------------------------------------------------------
-> drug = molnupiravir
  166
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  2,094
-------------------------------------------------------------------------------
-> drug = sotrovimab
  289
-------------------------------------------------------------------------------
-> drug = paxlovid
  308
-------------------------------------------------------------------------------
-> drug = molnupiravir
  298
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  2,101
-------------------------------------------------------------------------------
-> drug = sotrovimab
  248
-------------------------------------------------------------------------------
-> drug = paxlovid
  292
-------------------------------------------------------------------------------
-> drug = molnupiravir
  319
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  0
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-------------------------------------------------------------------------------
-> drug = control
  12,700
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,779
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,817
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,816

. 
. ****************************
. *       COVARIATES              *
. ****************************
. *Time between positive test and treatment*
. gen pre_drug_test=3 if drug>0 & covid_test_positive_date!=. &(date_treated-co
> vid_test_positive_date>0)&(date_treated-covid_test_positive_date<21)
(29,687 missing values generated)

. replace pre_drug_test=2 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=7)
(123 real changes made)

. replace pre_drug_test=1 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>0)&(date_treated-covid_test_positive_date<=5)
(80 real changes made)

. replace pre_drug_test=0 if drug>0 & covid_test_positive_date!=. &(date_treate
> d-covid_test_positive_date>=0)&(date_treated-covid_test_positive_date<=3)
(64 real changes made)

. replace pre_drug_test=4 if drug>0 & (date_treated-covid_test_positive_date<0)
>  & (date_treated-covid_test_positive_date>-7)
(82 real changes made)

. replace pre_drug_test=5 if drug>0 & (covid_test_positive_date==. | (date_trea
> ted-covid_test_positive_date<=-7) | (date_treated-covid_test_positive_date>=2
> 1)) 
(8,632 real changes made)

. label define pre_drug_test 0 "<3 days" 1 "3-5 days"  2 "5-7 days" 3 ">7 days 
> & <21 days" 4 "treatment proceeds test <7 days" 5 "no test", replace 

. label values pre_drug_test pre_drug_test

. tab pre_drug_test drug,m

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
              <3 days |         0         24         30         10 |        64 
             3-5 days |         0         11         11          8 |        30 
             5-7 days |         0         16         14         13 |        43 
   >7 days & <21 days |         0         50         52         64 |       166 
treatment proceeds te |         0         21         28         33 |        82 
              no test |         0      2,848      2,852      2,932 |     8,632 
                    . |    20,959          0          0          0 |    20,959 
----------------------+--------------------------------------------+----------
                Total |    20,959      2,970      2,987      3,060 |    29,976 

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |     29,976     48.7062    18.87276         18        109

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) 
> label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     10,922       36.44       36.44
      40-59 |     10,091       33.66       70.10
       >=60 |      8,963       29.90      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      3,262       10.88       10.88
        25- |      2,634        8.79       19.67
        30- |      2,493        8.32       27.99
        35- |      2,533        8.45       36.44
        40- |      2,273        7.58       44.02
        45- |      2,577        8.60       52.62
        50- |      2,702        9.01       61.63
        55- |      2,539        8.47       70.10
        60- |      2,169        7.24       77.34
        65- |      1,897        6.33       83.66
        70- |      1,841        6.14       89.81
        75- |      1,237        4.13       93.93
        80- |        897        2.99       96.92
        85- |        922        3.08      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. * Sex
. gen male = 1 if sex == "M"
(15,274 missing values generated)

. replace male = 0 if sex == "F"
(15,274 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(15,274 missing values generated)

. replace sex=1 if sex_str=="F"
(15,274 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     17,926       59.80       59.80
      Black |      1,160        3.87       63.67
      Mixed |      1,164        3.88       67.55
      Other |      1,229        4.10       71.65
South Asian |      1,186        3.96       75.61
      White |      7,311       24.39      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity                            
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. gen ethnicity_with_missing=ethnicity
(17,926 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(17,926 real changes made)

. gen White=1 if ethnicity==5
(22,665 missing values generated)

. replace White=0 if ethnicity!=5&ethnicity!=.
(4,739 real changes made)

. gen White_with_missing=White
(17,926 missing values generated)

. replace White_with_missing=9 if White==.
(17,926 real changes made)

. * IMD
. tab imdq5,m

             imdQ5 |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |      6,073       20.26       20.26
                 2 |      5,892       19.66       39.92
                 3 |      6,029       20.11       60.03
                 4 |      6,061       20.22       80.25
5 (least deprived) |      5,633       18.79       99.04
           Unknown |        288        0.96      100.00
-------------------+-----------------------------------
             Total |     29,976      100.00

. replace imdq5="." if imdq5=="Unknown" 
(288 real changes made)

. replace imdq5="1" if imdq5=="1 (most deprived)" 
(6,073 real changes made)

. replace imdq5="5" if imdq5=="5 (least deprived)" 
(5,633 real changes made)

. destring imdq5, replace
imdq5: all characters numeric; replaced as byte
(288 missing values generated)

. recode imdq5 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so 5 is more
>  deprived)
(23659 changes made to imdq5)

. label define imdq5 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived"
> , replace

. label values imdq5 imdq5

. gen imd_with_missing=imdq5
(288 missing values generated)

. replace imd_with_missing=9 if imdq5==.
(288 real changes made)

. tab imdq5,m

           imdQ5 |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      5,633       18.79       18.79
               2 |      6,061       20.22       39.01
               3 |      6,029       20.11       59.12
               4 |      5,892       19.66       78.78
 5 most deprived |      6,073       20.26       99.04
               . |        288        0.96      100.00
-----------------+-----------------------------------
           Total |     29,976      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,012       10.05       10.05
           East Midlands |      2,957        9.86       19.91
                  London |      6,012       20.06       39.97
              North East |      3,072       10.25       50.22
              North West |      2,936        9.79       60.01
              South East |      2,974        9.92       69.93
              South West |      2,994        9.99       79.92
           West Midlands |      3,055       10.19       90.11
Yorkshire and The Humber |      2,964        9.89      100.00
-------------------------+-----------------------------------
                   Total |     29,976      100.00

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,973        9.92        9.92
           East Midlands |      3,010       10.04       19.96
                  London |      5,969       19.91       39.87
              North East |      2,932        9.78       49.65
              North West |      2,992        9.98       59.63
              South East |      2,926        9.76       69.40
              South West |      3,087       10.30       79.69
           West Midlands |      3,075       10.26       89.95
Yorkshire and The Humber |      3,012       10.05      100.00
-------------------------+-----------------------------------
                   Total |     29,976      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      3,024       10.09       10.09
      STP10 |      2,910        9.71       19.80
       STP2 |      2,983        9.95       29.75
       STP3 |      2,945        9.82       39.57
       STP4 |      2,999       10.00       49.58
       STP5 |      3,013       10.05       59.63
       STP6 |      2,999       10.00       69.63
       STP7 |      3,112       10.38       80.01
       STP8 |      3,047       10.16       90.18
       STP9 |      2,944        9.82      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Oth
> er"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      3,024       10.09       10.09
      STP10 |      2,910        9.71       19.80
       STP2 |      2,983        9.95       29.75
       STP3 |      2,945        9.82       39.57
       STP4 |      2,999       10.00       49.58
       STP5 |      3,013       10.05       59.63
       STP6 |      2,999       10.00       69.63
       STP7 |      3,112       10.38       80.01
       STP8 |      3,047       10.16       90.18
       STP9 |      2,944        9.82      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
         bmi |  26.63523  21.65851  27.58809  33.05223 -4.985682  61.61169
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(1,864 real changes made, 1,864 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*1
> 0 & (age+((bmi_date_measured-start_date)/365)>=18)
(3,114 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(3,114 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 
> & (age+((bmi_date_measured-start_date)/365)>=18)
(3,114 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(1,864 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(1,864 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(1,864 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(1,864 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(1,864 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,982       90.01       90.01
          1 |      2,994        9.99      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,988       90.03       90.03
          1 |      2,988        9.97      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,007       90.10       90.10
          1 |      2,969        9.90      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,968       89.97       89.97
          1 |      3,008       10.03      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      2,970        9.91        9.91
          One vaccination |      3,040       10.14       20.05
       Three vaccinations |     14,974       49.95       70.00
         Two vaccinations |      2,960        9.87       79.88
            Un-vaccinated |      3,005       10.02       89.90
 Un-vaccinated (declined) |      3,027       10.10      100.00
--------------------------+-----------------------------------
                    Total |     29,976      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination
> _status_g=="Un-vaccinated (declined)"
(23,944 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(3,040 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(2,960 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(14,974 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinati
> ons"
(2,970 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two 
> vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(12,032 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(12,032 real changes made)

. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(4,141 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -432           -538
 5%         -301           -536
10%         -201           -535       Obs              25,835
25%            0           -531       Sum of wgt.      25,835

50%          272                      Mean           273.4147
                        Largest       Std. dev.      352.2807
75%          546           1080
90%          745           1082       Variance       124101.7
95%          849           1083       Skewness       .0082731
99%          986           1083       Kurtosis        2.18001

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(4,141 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -17 |         28        0.09        0.09
        -16 |         70        0.23        0.33
        -15 |         79        0.26        0.59
        -14 |        130        0.43        1.02
        -13 |        194        0.65        1.67
        -12 |        236        0.79        2.46
        -11 |        250        0.83        3.29
        -10 |        324        1.08        4.37
         -9 |        320        1.07        5.44
         -8 |        378        1.26        6.70
         -7 |        436        1.45        8.16
         -6 |        439        1.46        9.62
         -5 |        491        1.64       11.26
         -4 |        506        1.69       12.95
         -3 |        612        2.04       14.99
         -2 |        617        2.06       17.05
         -1 |        664        2.22       19.26
          0 |        704        2.35       21.61
          1 |        723        2.41       24.02
          2 |        716        2.39       26.41
          3 |        725        2.42       28.83
          4 |        734        2.45       31.28
          5 |        693        2.31       33.59
          6 |        677        2.26       35.85
          7 |        726        2.42       38.27
          8 |        703        2.35       40.62
          9 |        706        2.36       42.97
         10 |        695        2.32       45.29
         11 |        728        2.43       47.72
         12 |        684        2.28       50.00
         13 |        669        2.23       52.23
         14 |        671        2.24       54.47
         15 |        707        2.36       56.83
         16 |        709        2.37       59.19
         17 |        764        2.55       61.74
         18 |        712        2.38       64.12
         19 |        739        2.47       66.58
         20 |        657        2.19       68.78
         21 |        611        2.04       70.81
         22 |        565        1.88       72.70
         23 |        537        1.79       74.49
         24 |        554        1.85       76.34
         25 |        452        1.51       77.85
         26 |        420        1.40       79.25
         27 |        355        1.18       80.43
         28 |        341        1.14       81.57
         29 |        303        1.01       82.58
         30 |        249        0.83       83.41
         31 |        242        0.81       84.22
         32 |        216        0.72       84.94
         33 |        139        0.46       85.40
         34 |        107        0.36       85.76
         35 |         83        0.28       86.04
         36 |         42        0.14       86.18
         37 |          3        0.01       86.19
          . |      4,141       13.81      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)
(1,053 missing values generated)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -20608         -20608
 5%       -20607         -20608
10%       -20607         -20608       Obs              28,923
25%       -20607         -20608       Sum of wgt.      28,923

50%       -20607                      Mean           -20606.6
                        Largest       Std. dev.      .5202331
75%       -20606         -20606
90%       -20606         -20606       Variance       .2706424
95%       -20606         -20606       Skewness       .0887913
99%       -20606         -20606       Kurtosis       1.757644

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)
(1,053 missing values generated)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
       -686 |     28,923       96.49       96.49
          . |      1,053        3.51      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. * Variant
. tab sgtf,m

       sgtf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,968       69.95       69.95
          1 |      2,988        9.97       79.92
          9 |      3,028       10.10       90.02
          . |      2,992        9.98      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab sgtf_new, m

   sgtf_new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,030       70.16       70.16
          1 |      3,006       10.03       80.18
          9 |      2,981        9.94       90.13
          . |      2,959        9.87      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. tab variant_recorded,m

variant_reco |
        rded |      Freq.     Percent        Cum.
-------------+-----------------------------------
             |      3,053       10.18       10.18
   B.1.617.2 |     20,817       69.45       79.63
VOC-21JAN-02 |      6,106       20.37      100.00
-------------+-----------------------------------
       Total |     29,976      100.00

. tab sgtf_new variant_recorded ,m

                |         variant_recorded
       sgtf_new |            B.1.617.2  VOC-21J.. |     Total
----------------+---------------------------------+----------
S gene detected |     2,143     14,609      4,278 |    21,030 
 confirmed SGTF |       322      2,066        618 |     3,006 
             NA |       294      2,108        579 |     2,981 
              . |       294      2,034        631 |     2,959 
----------------+---------------------------------+----------
          Total |     3,053     20,817      6,106 |    29,976 

. * Prior infection
. tab prior_covid, m

prior_covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,015       70.11       70.11
          1 |      8,961       29.89      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. gen prior_covid_index=1 if prior_covid==1 & prior_covid_date<campaign_start
(29,901 missing values generated)

. tab prior_covid_index,m

prior_covid |
     _index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         75        0.25        0.25
          . |     29,901       99.75      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. replace prior_covid_index=0 if prior_covid_index==.
(29,901 real changes made)

. *Contraindications for Pax*
. tab drug if organ_transplant==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      6,546       69.80       69.80
  sotrovimab |        947       10.10       79.90
    paxlovid |        920        9.81       89.71
molnupiravir |        965       10.29      100.00
-------------+-----------------------------------
       Total |      9,378      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,098       69.98       69.98
  sotrovimab |        281        9.37       79.35
    paxlovid |        303       10.11       89.46
molnupiravir |        316       10.54      100.00
-------------+-----------------------------------
       Total |      2,998      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      7,170       69.77       69.77
  sotrovimab |      1,041       10.13       79.90
    paxlovid |      1,000        9.73       89.63
molnupiravir |      1,066       10.37      100.00
-------------+-----------------------------------
       Total |     10,277      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vacci
> ne-breakthrough/blob/updates-feb/analysis/data_process.R*
. tab creatinine_operator_ctv3,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      3,035       10.12       10.12
          < |      1,515        5.05       15.18
         <= |      1,526        5.09       20.27
          = |     19,414       64.77       85.03
          > |      1,527        5.09       90.13
         >= |      1,495        4.99       95.12
          ~ |      1,464        4.88      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |   56.9559  47.92766  58.88699  69.35995 -5.095028  121.5547
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_c
> tv3_date>start_date
(28,981 real changes made, 28,981 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  59.94001  49.85609  59.62272  69.64258  20.56911  110.3855
--------------------------------------------------------------------------

. tab creatinine_operator_ctv3 if creatinine_ctv3!=.,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |        104       10.45       10.45
          < |         49        4.92       15.38
         <= |         52        5.23       20.60
          = |        651       65.43       86.03
          > |         52        5.23       91.26
         >= |         40        4.02       95.28
          ~ |         47        4.72      100.00
------------+-----------------------------------
      Total |        995      100.00

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(995 real changes made)

. gen min_creatinine_ctv3=.
(29,976 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(494 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(501 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(272 real changes made)

. gen max_creatinine_ctv3=.
(29,976 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(494 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(501 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(29,704 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993
> ^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(28,992 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(489 real changes made)

. tab creatinine_operator_snomed,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      3,019       10.07       10.07
          < |      1,480        4.94       15.01
         <= |      1,454        4.85       19.86
          = |     19,519       65.12       84.97
          > |      1,527        5.09       90.07
         >= |      1,535        5.12       95.19
          ~ |      1,442        4.81      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab creatinine_operator_snomed if creatinine_snomed!=.,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      3,019       10.07       10.07
          < |      1,480        4.94       15.01
         <= |      1,454        4.85       19.86
          = |     19,519       65.12       84.97
          > |      1,527        5.09       90.07
         >= |      1,535        5.12       95.19
          ~ |      1,442        4.81      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
cre~e_snomed |   22.5003         0         0  44.93889 -40.15472  120.2777
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(29,494 real changes made, 29,494 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(crea
> tinine_snomed)
(21,984 real changes made, 7,217 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if miss
> ing(creatinine_snomed)
(16,377 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creati
> nine_snomed)
(29,149 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_sno
> med)
(29,494 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creat
> inine_snomed_date>start_date
(29,230 real changes made, 29,230 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(746 real changes made)

. gen min_creatinine_snomed=.
(29,976 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(377 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(369 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(103 real changes made)

. gen max_creatinine_snomed=.
(29,976 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(377 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(369 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(29,873 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*
> (0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snome
> d<=120
(29,244 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(371 real changes made)

. tab egfr_operator if egfr_record!=.,m

eGFR_operat |
         or |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,983        9.95        9.95
          < |      1,447        4.83       14.78
         <= |      1,484        4.95       19.73
          = |     19,515       65.10       84.83
          > |      1,505        5.02       89.85
         >= |      1,547        5.16       95.01
          ~ |      1,495        4.99      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab egfr_short_operator if egfr_short_record!=.,m

eGFR_short_ |
   operator |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      3,118       10.40       10.40
          < |      1,482        4.94       15.35
         <= |      1,535        5.12       20.47
          = |     19,507       65.08       85.54
          > |      1,489        4.97       90.51
         >= |      1,388        4.63       95.14
          ~ |      1,457        4.86      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<60&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(26,202 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(e
> gfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egf
> r_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<30&egfr
> _short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(29,088 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,650       70.22       70.22
  sotrovimab |        360        9.54       79.76
    paxlovid |        375        9.94       89.69
molnupiravir |        389       10.31      100.00
-------------+-----------------------------------
       Total |      3,774      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        609       68.58       68.58
  sotrovimab |         99       11.15       79.73
    paxlovid |         80        9.01       88.74
molnupiravir |        100       11.26      100.00
-------------+-----------------------------------
       Total |        888      100.00

. *drug interactions*
. tab drug if drugs_paxlovid_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,053      100.00      100.00
-------------+-----------------------------------
       Total |      1,053      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,001      100.00      100.00
-------------+-----------------------------------
       Total |      1,001      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,001      100.00      100.00
-------------+-----------------------------------
       Total |      1,001      100.00

. tab drug if drugs_paxlovid_interaction<=start_date&drugs_paxlovid_interaction
> >=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,001      100.00      100.00
-------------+-----------------------------------
       Total |      1,001      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,053      100.00      100.00
-------------+-----------------------------------
       Total |      1,053      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,005      100.00      100.00
-------------+-----------------------------------
       Total |      1,005      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,005      100.00      100.00
-------------+-----------------------------------
       Total |      1,005      100.00

. tab drug if drugs_nirmatrelvir_interaction<=start_date&drugs_nirmatrelvir_int
> eraction>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      1,005      100.00      100.00
-------------+-----------------------------------
       Total |      1,005      100.00

. gen paxlovid_interaction=(drugs_paxlovid_interaction<=start_date&drugs_paxlov
> id_interaction>=(start_date-180))  

. gen nirmatrelvir_interaction=(drugs_nirmatrelvir_interaction<=start_date&drug
> s_nirmatrelvir_interaction>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contraindicated = 1 if egfr_30==1 | dialysis==1
(26,196 missing values generated)

. replace paxlovid_contraindicated = 1 if liver_disease==1 
(4,963 real changes made)

. replace paxlovid_contraindicated = 1 if organ_transplant==1 
(6,683 real changes made)

. replace paxlovid_contraindicated = 1 if drugs_paxlovid_interaction<=start_dat
> e&drugs_paxlovid_interaction>=(start_date-180)
(497 real changes made)

. recode paxlovid_contraindicated . = 0
(14053 changes made to paxlovid_contraindicated)

. by drug, sort: count if paxlovid_contraindicated==1

-------------------------------------------------------------------------------
-> drug = control
  11,273
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,523
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,550
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,577

. 
. ****************************
. *       COX MODEL               *
. ****************************
. global ae               ae_spc_all                              ///
>                                 ae_drug_all                             ///  
>            
>                                 ae_imae_all                     ///          
>                    
>                                 ae_all                                  ///
>                                 allcause_emerg_aande    ///
>                                 covid_hosp_date                 ///
>                                 all_hosp_date                   ///
>                                 died_date_ons

. * Generate failure 
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         by drug, sort: count if `x'!=.
  4.         by drug, sort: count if `x'<start_date & `x' 
  5.         replace `x'=. if `x'<start_date & `x'!=.
  6.         gen fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, paxl
> ovid, molnupiravir)) if drug==1
  7.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, 
> sotrovimab, molnupiravir)) if drug==2
  8.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, 
> sotrovimab, paxlovid)) if drug==3
  9.         replace fail_`x'=(`x'!=.&`x'<= min(study_end_date, start_date_29, 
> sotrovimab, paxlovid, molnupiravir)) if drug==0
 10.         tab drug fail_`x', m
 11. }
ae_spc_all

-------------------------------------------------------------------------------
-> drug = control
  19,922
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,812
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,844
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,930

-------------------------------------------------------------------------------
-> drug = control
  994
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(994 real changes made, 994 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     2,056     18,903 |    20,959 
  sotrovimab |       977      1,993 |     2,970 
    paxlovid |     1,028      1,959 |     2,987 
molnupiravir |       936      2,124 |     3,060 
-------------+----------------------+----------
       Total |     4,997     24,979 |    29,976 
ae_drug_all

-------------------------------------------------------------------------------
-> drug = control
  19,972
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,826
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,836
-------------------------------------------------------------------------------
-> drug = molnupiravir
  2,923

-------------------------------------------------------------------------------
-> drug = control
  1,002
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(1,002 real changes made, 1,002 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |   fail_ae_drug_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     2,017     18,942 |    20,959 
  sotrovimab |     1,016      1,954 |     2,970 
    paxlovid |       955      2,032 |     2,987 
molnupiravir |     1,007      2,053 |     3,060 
-------------+----------------------+----------
       Total |     4,995     24,981 |    29,976 
ae_imae_all

-------------------------------------------------------------------------------
-> drug = control
  20,886
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,963
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,969
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3,047

-------------------------------------------------------------------------------
-> drug = control
  1,049
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(1,049 real changes made, 1,049 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     1,126     19,833 |    20,959 
  sotrovimab |       515      2,455 |     2,970 
    paxlovid |       531      2,456 |     2,987 
molnupiravir |       483      2,577 |     3,060 
-------------+----------------------+----------
       Total |     2,655     27,321 |    29,976 
ae_all

-------------------------------------------------------------------------------
-> drug = control
  20,959
-------------------------------------------------------------------------------
-> drug = sotrovimab
  2,970
-------------------------------------------------------------------------------
-> drug = paxlovid
  2,987
-------------------------------------------------------------------------------
-> drug = molnupiravir
  3,060

-------------------------------------------------------------------------------
-> drug = control
  1,053
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(1,053 real changes made, 1,053 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     1,053     19,906 |    20,959 
  sotrovimab |       219      2,751 |     2,970 
    paxlovid |       238      2,749 |     2,987 
molnupiravir |       195      2,865 |     3,060 
-------------+----------------------+----------
       Total |     1,705     28,271 |    29,976 
allcause_emerg_aande

-------------------------------------------------------------------------------
-> drug = control
  1,027
-------------------------------------------------------------------------------
-> drug = sotrovimab
  140
-------------------------------------------------------------------------------
-> drug = paxlovid
  131
-------------------------------------------------------------------------------
-> drug = molnupiravir
  166

-------------------------------------------------------------------------------
-> drug = control
  52
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(52 real changes made, 52 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_allcause_emerg_a
             |         ande
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    19,994        965 |    20,959 
  sotrovimab |     2,908         62 |     2,970 
    paxlovid |     2,918         69 |     2,987 
molnupiravir |     2,970         90 |     3,060 
-------------+----------------------+----------
       Total |    28,790      1,186 |    29,976 
covid_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  2,094
-------------------------------------------------------------------------------
-> drug = sotrovimab
  289
-------------------------------------------------------------------------------
-> drug = paxlovid
  308
-------------------------------------------------------------------------------
-> drug = molnupiravir
  298

-------------------------------------------------------------------------------
-> drug = control
  106
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(106 real changes made, 106 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_covid_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    18,993      1,966 |    20,959 
  sotrovimab |     2,842        128 |     2,970 
    paxlovid |     2,859        128 |     2,987 
molnupiravir |     2,908        152 |     3,060 
-------------+----------------------+----------
       Total |    27,602      2,374 |    29,976 
all_hosp_date

-------------------------------------------------------------------------------
-> drug = control
  2,101
-------------------------------------------------------------------------------
-> drug = sotrovimab
  248
-------------------------------------------------------------------------------
-> drug = paxlovid
  292
-------------------------------------------------------------------------------
-> drug = molnupiravir
  319

-------------------------------------------------------------------------------
-> drug = control
  110
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(110 real changes made, 110 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_all_hosp_date
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    18,983      1,976 |    20,959 
  sotrovimab |     2,852        118 |     2,970 
    paxlovid |     2,858        129 |     2,987 
molnupiravir |     2,920        140 |     3,060 
-------------+----------------------+----------
       Total |    27,613      2,363 |    29,976 
died_date_ons

-------------------------------------------------------------------------------
-> drug = control
  12,700
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,779
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,817
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,816

-------------------------------------------------------------------------------
-> drug = control
  607
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(607 real changes made, 607 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_died_date_ons
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |     8,933     12,026 |    20,959 
  sotrovimab |     1,717      1,253 |     2,970 
    paxlovid |     1,735      1,252 |     2,987 
molnupiravir |     1,771      1,289 |     3,060 
-------------+----------------------+----------
       Total |    14,156     15,820 |    29,976 
ae_diverticulitis_snomed

-------------------------------------------------------------------------------
-> drug = control
  8,336
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,131
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,132
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,265

-------------------------------------------------------------------------------
-> drug = control
  422
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(422 real changes made, 422 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,123      7,836 |    20,959 
  sotrovimab |     2,380        590 |     2,970 
    paxlovid |     2,430        557 |     2,987 
molnupiravir |     2,419        641 |     3,060 
-------------+----------------------+----------
       Total |    20,352      9,624 |    29,976 
ae_diarrhoea_snomed

-------------------------------------------------------------------------------
-> drug = control
  8,353
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,212
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,196
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,217

-------------------------------------------------------------------------------
-> drug = control
  429
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(429 real changes made, 429 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,106      7,853 |    20,959 
  sotrovimab |     2,362        608 |     2,970 
    paxlovid |     2,407        580 |     2,987 
molnupiravir |     2,410        650 |     3,060 
-------------+----------------------+----------
       Total |    20,285      9,691 |    29,976 
ae_taste_snomed

-------------------------------------------------------------------------------
-> drug = control
  8,289
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,158
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,185
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,232

-------------------------------------------------------------------------------
-> drug = control
  405
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(405 real changes made, 405 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,142      7,817 |    20,959 
  sotrovimab |     2,364        606 |     2,970 
    paxlovid |     2,374        613 |     2,987 
molnupiravir |     2,373        687 |     3,060 
-------------+----------------------+----------
       Total |    20,253      9,723 |    29,976 
ae_diverticulitis_icd

-------------------------------------------------------------------------------
-> drug = control
  8,365
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,159
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,176
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,182

-------------------------------------------------------------------------------
-> drug = control
  394
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(394 real changes made, 394 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_diverticuliti
             |         s_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,055      7,904 |    20,959 
  sotrovimab |     2,361        609 |     2,970 
    paxlovid |     2,365        622 |     2,987 
molnupiravir |     2,429        631 |     3,060 
-------------+----------------------+----------
       Total |    20,210      9,766 |    29,976 
ae_taste_icd

-------------------------------------------------------------------------------
-> drug = control
  8,325
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,194
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,170
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,244

-------------------------------------------------------------------------------
-> drug = control
  426
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(426 real changes made, 426 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |   fail_ae_taste_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,131      7,828 |    20,959 
  sotrovimab |     2,373        597 |     2,970 
    paxlovid |     2,371        616 |     2,987 
molnupiravir |     2,383        677 |     3,060 
-------------+----------------------+----------
       Total |    20,258      9,718 |    29,976 
ae_diverticulitis_ae

-------------------------------------------------------------------------------
-> drug = control
  8,301
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,203
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,204
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,261

-------------------------------------------------------------------------------
-> drug = control
  418
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(418 real changes made, 418 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_diverticuliti
             |         s_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,156      7,803 |    20,959 
  sotrovimab |     2,320        650 |     2,970 
    paxlovid |     2,369        618 |     2,987 
molnupiravir |     2,402        658 |     3,060 
-------------+----------------------+----------
       Total |    20,247      9,729 |    29,976 
ae_anaphylaxis_snomed

-------------------------------------------------------------------------------
-> drug = control
  8,363
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,169
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,191
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,248

-------------------------------------------------------------------------------
-> drug = control
  423
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(423 real changes made, 423 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,094      7,865 |    20,959 
  sotrovimab |     2,357        613 |     2,970 
    paxlovid |     2,342        645 |     2,987 
molnupiravir |     2,424        636 |     3,060 
-------------+----------------------+----------
       Total |    20,217      9,759 |    29,976 
ae_rash_snomed

-------------------------------------------------------------------------------
-> drug = control
  8,360
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,176
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,222
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,189

-------------------------------------------------------------------------------
-> drug = control
  417
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(417 real changes made, 417 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_ae_rash_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,066      7,893 |    20,959 
  sotrovimab |     2,364        606 |     2,970 
    paxlovid |     2,347        640 |     2,987 
molnupiravir |     2,438        622 |     3,060 
-------------+----------------------+----------
       Total |    20,215      9,761 |    29,976 
ae_anaphylaxis_icd

-------------------------------------------------------------------------------
-> drug = control
  8,333
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,202
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,219
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,228

-------------------------------------------------------------------------------
-> drug = control
  405
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(405 real changes made, 405 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_anaphylaxis_i
             |          cd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,108      7,851 |    20,959 
  sotrovimab |     2,371        599 |     2,970 
    paxlovid |     2,341        646 |     2,987 
molnupiravir |     2,433        627 |     3,060 
-------------+----------------------+----------
       Total |    20,253      9,723 |    29,976 
ae_anaphlaxis_ae

-------------------------------------------------------------------------------
-> drug = control
  8,375
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,165
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,194
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,250

-------------------------------------------------------------------------------
-> drug = control
  409
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(409 real changes made, 409 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_anaphlaxis_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,073      7,886 |    20,959 
  sotrovimab |     2,385        585 |     2,970 
    paxlovid |     2,377        610 |     2,987 
molnupiravir |     2,405        655 |     3,060 
-------------+----------------------+----------
       Total |    20,240      9,736 |    29,976 
ae_drugreact_ae

-------------------------------------------------------------------------------
-> drug = control
  8,355
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,208
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,207
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,187

-------------------------------------------------------------------------------
-> drug = control
  431
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(431 real changes made, 431 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_ae_drugreact_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,106      7,853 |    20,959 
  sotrovimab |     2,360        610 |     2,970 
    paxlovid |     2,354        633 |     2,987 
molnupiravir |     2,435        625 |     3,060 
-------------+----------------------+----------
       Total |    20,255      9,721 |    29,976 
ae_allergic_ae

-------------------------------------------------------------------------------
-> drug = control
  8,275
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,204
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,193
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,210

-------------------------------------------------------------------------------
-> drug = control
  394
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(394 real changes made, 394 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_ae_allergic_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,149      7,810 |    20,959 
  sotrovimab |     2,351        619 |     2,970 
    paxlovid |     2,351        636 |     2,987 
molnupiravir |     2,423        637 |     3,060 
-------------+----------------------+----------
       Total |    20,274      9,702 |    29,976 
new_ae_ra_snomed

-------------------------------------------------------------------------------
-> drug = control
  6,784
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,003
-------------------------------------------------------------------------------
-> drug = paxlovid
  946
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,017

-------------------------------------------------------------------------------
-> drug = control
  344
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(344 real changes made, 344 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    14,573      6,386 |    20,959 
  sotrovimab |     2,446        524 |     2,970 
    paxlovid |     2,496        491 |     2,987 
molnupiravir |     2,505        555 |     3,060 
-------------+----------------------+----------
       Total |    22,020      7,956 |    29,976 
new_ae_sle_ctv

-------------------------------------------------------------------------------
-> drug = control
  6,830
-------------------------------------------------------------------------------
-> drug = sotrovimab
  937
-------------------------------------------------------------------------------
-> drug = paxlovid
  981
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,032

-------------------------------------------------------------------------------
-> drug = control
  346
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(346 real changes made, 346 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    14,536      6,423 |    20,959 
  sotrovimab |     2,506        464 |     2,970 
    paxlovid |     2,479        508 |     2,987 
molnupiravir |     2,533        527 |     3,060 
-------------+----------------------+----------
       Total |    22,054      7,922 |    29,976 
new_ae_psoriasis_snomed

-------------------------------------------------------------------------------
-> drug = control
  7,546
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,097
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,105
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,093

-------------------------------------------------------------------------------
-> drug = control
  393
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(393 real changes made, 393 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,878      7,081 |    20,959 
  sotrovimab |     2,432        538 |     2,970 
    paxlovid |     2,426        561 |     2,987 
molnupiravir |     2,466        594 |     3,060 
-------------+----------------------+----------
       Total |    21,202      8,774 |    29,976 
new_ae_psa_snomed

-------------------------------------------------------------------------------
-> drug = control
  7,638
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,032
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,075
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,073

-------------------------------------------------------------------------------
-> drug = control
  415
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(415 real changes made, 415 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,810      7,149 |    20,959 
  sotrovimab |     2,453        517 |     2,970 
    paxlovid |     2,427        560 |     2,987 
molnupiravir |     2,500        560 |     3,060 
-------------+----------------------+----------
       Total |    21,190      8,786 |    29,976 
new_ae_ankspon_ctv

-------------------------------------------------------------------------------
-> drug = control
  7,554
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,062
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,049
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,104

-------------------------------------------------------------------------------
-> drug = control
  394
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(394 real changes made, 394 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,869      7,090 |    20,959 
  sotrovimab |     2,412        558 |     2,970 
    paxlovid |     2,439        548 |     2,987 
molnupiravir |     2,505        555 |     3,060 
-------------+----------------------+----------
       Total |    21,225      8,751 |    29,976 
new_ae_ibd_snomed

-------------------------------------------------------------------------------
-> drug = control
  7,602
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,088
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,068
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,110

-------------------------------------------------------------------------------
-> drug = control
  382
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(382 real changes made, 382 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,796      7,163 |    20,959 
  sotrovimab |     2,402        568 |     2,970 
    paxlovid |     2,420        567 |     2,987 
molnupiravir |     2,471        589 |     3,060 
-------------+----------------------+----------
       Total |    21,089      8,887 |    29,976 
new_ae_ra_icd

-------------------------------------------------------------------------------
-> drug = control
  6,843
-------------------------------------------------------------------------------
-> drug = sotrovimab
  963
-------------------------------------------------------------------------------
-> drug = paxlovid
  974
-------------------------------------------------------------------------------
-> drug = molnupiravir
  964

-------------------------------------------------------------------------------
-> drug = control
  346
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(346 real changes made, 346 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_new_ae_ra_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    14,502      6,457 |    20,959 
  sotrovimab |     2,451        519 |     2,970 
    paxlovid |     2,477        510 |     2,987 
molnupiravir |     2,548        512 |     3,060 
-------------+----------------------+----------
       Total |    21,978      7,998 |    29,976 
new_ae_sle_icd

-------------------------------------------------------------------------------
-> drug = control
  6,791
-------------------------------------------------------------------------------
-> drug = sotrovimab
  993
-------------------------------------------------------------------------------
-> drug = paxlovid
  965
-------------------------------------------------------------------------------
-> drug = molnupiravir
  955

-------------------------------------------------------------------------------
-> drug = control
  334
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(334 real changes made, 334 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_new_ae_sle_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    14,551      6,408 |    20,959 
  sotrovimab |     2,481        489 |     2,970 
    paxlovid |     2,481        506 |     2,987 
molnupiravir |     2,570        490 |     3,060 
-------------+----------------------+----------
       Total |    22,083      7,893 |    29,976 
new_ae_ra_ae

-------------------------------------------------------------------------------
-> drug = control
  6,889
-------------------------------------------------------------------------------
-> drug = sotrovimab
  962
-------------------------------------------------------------------------------
-> drug = paxlovid
  969
-------------------------------------------------------------------------------
-> drug = molnupiravir
  990

-------------------------------------------------------------------------------
-> drug = control
  347
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(347 real changes made, 347 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |   fail_new_ae_ra_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    14,475      6,484 |    20,959 
  sotrovimab |     2,466        504 |     2,970 
    paxlovid |     2,480        507 |     2,987 
molnupiravir |     2,524        536 |     3,060 
-------------+----------------------+----------
       Total |    21,945      8,031 |    29,976 
new_ae_sle_ae

-------------------------------------------------------------------------------
-> drug = control
  6,879
-------------------------------------------------------------------------------
-> drug = sotrovimab
  961
-------------------------------------------------------------------------------
-> drug = paxlovid
  936
-------------------------------------------------------------------------------
-> drug = molnupiravir
  968

-------------------------------------------------------------------------------
-> drug = control
  360
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(360 real changes made, 360 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_new_ae_sle_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    14,497      6,462 |    20,959 
  sotrovimab |     2,459        511 |     2,970 
    paxlovid |     2,503        484 |     2,987 
molnupiravir |     2,555        505 |     3,060 
-------------+----------------------+----------
       Total |    22,014      7,962 |    29,976 
new_ae_psoriasis_ae

-------------------------------------------------------------------------------
-> drug = control
  7,484
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,114
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,050
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,141

-------------------------------------------------------------------------------
-> drug = control
  363
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(363 real changes made, 363 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_psoriasis
             |          _ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,896      7,063 |    20,959 
  sotrovimab |     2,399        571 |     2,970 
    paxlovid |     2,435        552 |     2,987 
molnupiravir |     2,441        619 |     3,060 
-------------+----------------------+----------
       Total |    21,171      8,805 |    29,976 
new_ae_psa_ae

-------------------------------------------------------------------------------
-> drug = control
  7,549
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,095
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,086
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,079

-------------------------------------------------------------------------------
-> drug = control
  369
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(369 real changes made, 369 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_new_ae_psa_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,837      7,122 |    20,959 
  sotrovimab |     2,413        557 |     2,970 
    paxlovid |     2,412        575 |     2,987 
molnupiravir |     2,506        554 |     3,060 
-------------+----------------------+----------
       Total |    21,168      8,808 |    29,976 
new_ae_ankspon_ae

-------------------------------------------------------------------------------
-> drug = control
  7,585
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,068
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,058
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,128

-------------------------------------------------------------------------------
-> drug = control
  365
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(365 real changes made, 365 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             | fail_new_ae_ankspon_a
             |           e
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,806      7,153 |    20,959 
  sotrovimab |     2,412        558 |     2,970 
    paxlovid |     2,417        570 |     2,987 
molnupiravir |     2,428        632 |     3,060 
-------------+----------------------+----------
       Total |    21,063      8,913 |    29,976 
new_ae_ibd_ae

-------------------------------------------------------------------------------
-> drug = control
  7,588
-------------------------------------------------------------------------------
-> drug = sotrovimab
  1,085
-------------------------------------------------------------------------------
-> drug = paxlovid
  1,100
-------------------------------------------------------------------------------
-> drug = molnupiravir
  1,108

-------------------------------------------------------------------------------
-> drug = control
  382
-------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-------------------------------------------------------------------------------
-> drug = paxlovid
  0
-------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(382 real changes made, 382 to missing)
(27,006 missing values generated)
(2,987 real changes made)
(3,060 real changes made)
(20,959 real changes made)

             |  fail_new_ae_ibd_ae
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    13,815      7,144 |    20,959 
  sotrovimab |     2,406        564 |     2,970 
    paxlovid |     2,405        582 |     2,987 
molnupiravir |     2,468        592 |     3,060 
-------------+----------------------+----------
       Total |    21,094      8,882 |    29,976 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         display "`x'"
  3.         replace `x'=`x'+0.5 if `x'==start_date
  4. }
ae_spc_all
(0 real changes made)
ae_drug_all
(0 real changes made)
ae_imae_all
(0 real changes made)
ae_all
(0 real changes made)
allcause_emerg_aande
(0 real changes made)
covid_hosp_date
(0 real changes made)
all_hosp_date
(0 real changes made)
died_date_ons
(0 real changes made)
ae_diverticulitis_snomed
(0 real changes made)
ae_diarrhoea_snomed
(0 real changes made)
ae_taste_snomed
(0 real changes made)
ae_diverticulitis_icd
(0 real changes made)
ae_taste_icd
(0 real changes made)
ae_diverticulitis_ae
(0 real changes made)
ae_anaphylaxis_snomed
(0 real changes made)
ae_rash_snomed
(0 real changes made)
ae_anaphylaxis_icd
(0 real changes made)
ae_anaphlaxis_ae
(0 real changes made)
ae_drugreact_ae
(0 real changes made)
ae_allergic_ae
(0 real changes made)
new_ae_ra_snomed
(0 real changes made)
new_ae_sle_ctv
(0 real changes made)
new_ae_psoriasis_snomed
(0 real changes made)
new_ae_psa_snomed
(0 real changes made)
new_ae_ankspon_ctv
(0 real changes made)
new_ae_ibd_snomed
(0 real changes made)
new_ae_ra_icd
(0 real changes made)
new_ae_sle_icd
(0 real changes made)
new_ae_ra_ae
(0 real changes made)
new_ae_sle_ae
(0 real changes made)
new_ae_psoriasis_ae
(0 real changes made)
new_ae_psa_ae
(0 real changes made)
new_ae_ankspon_ae
(0 real changes made)
new_ae_ibd_ae
(0 real changes made)

. 
. *Generate censor date
. foreach x in    $ae $ae_spc $ae_spc_icd $ae_spc_emerg ///
>                                 $ae_drug $ae_drug_icd $ae_drug_emerg ///
>                                 $ae_imae $ae_imae_icd $ae_imae_emerg ///
>                                 {
  2.         gen stop_`x'=`x' if fail_`x'==1
  3.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,paxlovid,molnupiravir) if fail_`x'==0&drug==1
  4.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,sotrovimab,molnupiravir) if fail_`x'==0&drug==2
  5.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,sotrovimab,paxlovid) if fail_`x'==0&drug==3
  6.         replace stop_`x'=min(death_date,dereg_date,study_end_date,start_da
> te_29,sotrovimab,paxlovid,molnupiravir) if fail_`x'==0&drug==0
  7.         format %td stop_`x'
  8. }
(4,997 missing values generated)
(977 real changes made)
(1,028 real changes made)
(936 real changes made)
(2,056 real changes made)
(4,995 missing values generated)
(1,016 real changes made)
(955 real changes made)
(1,007 real changes made)
(2,017 real changes made)
(2,655 missing values generated)
(515 real changes made)
(531 real changes made)
(483 real changes made)
(1,126 real changes made)
(1,705 missing values generated)
(219 real changes made)
(238 real changes made)
(195 real changes made)
(1,053 real changes made)
(28,790 missing values generated)
(2,908 real changes made)
(2,918 real changes made)
(2,970 real changes made)
(19,994 real changes made)
(27,602 missing values generated)
(2,842 real changes made)
(2,859 real changes made)
(2,908 real changes made)
(18,993 real changes made)
(27,613 missing values generated)
(2,852 real changes made)
(2,858 real changes made)
(2,920 real changes made)
(18,983 real changes made)
(14,156 missing values generated)
(1,717 real changes made)
(1,735 real changes made)
(1,771 real changes made)
(8,933 real changes made)
(20,352 missing values generated)
(2,380 real changes made)
(2,430 real changes made)
(2,419 real changes made)
(13,123 real changes made)
(20,285 missing values generated)
(2,362 real changes made)
(2,407 real changes made)
(2,410 real changes made)
(13,106 real changes made)
(20,253 missing values generated)
(2,364 real changes made)
(2,374 real changes made)
(2,373 real changes made)
(13,142 real changes made)
(20,210 missing values generated)
(2,361 real changes made)
(2,365 real changes made)
(2,429 real changes made)
(13,055 real changes made)
(20,258 missing values generated)
(2,373 real changes made)
(2,371 real changes made)
(2,383 real changes made)
(13,131 real changes made)
(20,247 missing values generated)
(2,320 real changes made)
(2,369 real changes made)
(2,402 real changes made)
(13,156 real changes made)
(20,217 missing values generated)
(2,357 real changes made)
(2,342 real changes made)
(2,424 real changes made)
(13,094 real changes made)
(20,215 missing values generated)
(2,364 real changes made)
(2,347 real changes made)
(2,438 real changes made)
(13,066 real changes made)
(20,253 missing values generated)
(2,371 real changes made)
(2,341 real changes made)
(2,433 real changes made)
(13,108 real changes made)
(20,240 missing values generated)
(2,385 real changes made)
(2,377 real changes made)
(2,405 real changes made)
(13,073 real changes made)
(20,255 missing values generated)
(2,360 real changes made)
(2,354 real changes made)
(2,435 real changes made)
(13,106 real changes made)
(20,274 missing values generated)
(2,351 real changes made)
(2,351 real changes made)
(2,423 real changes made)
(13,149 real changes made)
(22,020 missing values generated)
(2,446 real changes made)
(2,496 real changes made)
(2,505 real changes made)
(14,573 real changes made)
(22,054 missing values generated)
(2,506 real changes made)
(2,479 real changes made)
(2,533 real changes made)
(14,536 real changes made)
(21,202 missing values generated)
(2,432 real changes made)
(2,426 real changes made)
(2,466 real changes made)
(13,878 real changes made)
(21,190 missing values generated)
(2,453 real changes made)
(2,427 real changes made)
(2,500 real changes made)
(13,810 real changes made)
(21,225 missing values generated)
(2,412 real changes made)
(2,439 real changes made)
(2,505 real changes made)
(13,869 real changes made)
(21,089 missing values generated)
(2,402 real changes made)
(2,420 real changes made)
(2,471 real changes made)
(13,796 real changes made)
(21,978 missing values generated)
(2,451 real changes made)
(2,477 real changes made)
(2,548 real changes made)
(14,502 real changes made)
(22,083 missing values generated)
(2,481 real changes made)
(2,481 real changes made)
(2,570 real changes made)
(14,551 real changes made)
(21,945 missing values generated)
(2,466 real changes made)
(2,480 real changes made)
(2,524 real changes made)
(14,475 real changes made)
(22,014 missing values generated)
(2,459 real changes made)
(2,503 real changes made)
(2,555 real changes made)
(14,497 real changes made)
(21,171 missing values generated)
(2,399 real changes made)
(2,435 real changes made)
(2,441 real changes made)
(13,896 real changes made)
(21,168 missing values generated)
(2,413 real changes made)
(2,412 real changes made)
(2,506 real changes made)
(13,837 real changes made)
(21,063 missing values generated)
(2,412 real changes made)
(2,417 real changes made)
(2,428 real changes made)
(13,806 real changes made)
(21,094 missing values generated)
(2,406 real changes made)
(2,405 real changes made)
(2,468 real changes made)
(13,815 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_da
> te) failure(fail_ae_all==1) 

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date

--------------------------------------------------------------------------
     29,976  total observations
      1,053  ignored because never entered
--------------------------------------------------------------------------
     28,923  observations remaining, representing
     28,923  subjects
     28,271  failures in single-failure-per-subject data
  597569772  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =    21,097

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==1&min(paxlovid,molnupiravir)==stop_ae_all
  2

. count if fail_ae_all==0&drug==2&min(sotrovimab,molnupiravir)==stop_ae_all
  4

. count if fail_ae_all==0&drug==3&min(sotrovimab,paxlovid,remdesivir,casirivima
> b)==stop_ae_all
  2

. count if fail_ae_all==0&drug==0&min(sotrovimab,paxlovid,molnupiravir)==stop_a
> e_all
  0

. tab _st  // keep if _st==1 -> removes observations that end on or before ente
> r -> should be 0 in actual dataset

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,053        3.51        3.51
          1 |     28,923       96.49      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab _t,m

   Analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
      20607 |          3        0.01        0.01
      20608 |        226        0.75        0.76
      20609 |        552        1.84        2.61
      20610 |        517        1.72        4.33
      20611 |        483        1.61        5.94
      20612 |        516        1.72        7.66
      20613 |        494        1.65        9.31
      20614 |        479        1.60       10.91
      20615 |        472        1.57       12.48
      20616 |        490        1.63       14.12
      20617 |        446        1.49       15.61
      20618 |        410        1.37       16.97
      20619 |        431        1.44       18.41
      20620 |        444        1.48       19.89
      20621 |        410        1.37       21.26
      20622 |        420        1.40       22.66
      20623 |        357        1.19       23.85
      20624 |        389        1.30       25.15
      20625 |        409        1.36       26.51
      20626 |        343        1.14       27.66
      20627 |        374        1.25       28.91
      20628 |        366        1.22       30.13
      20629 |        355        1.18       31.31
      20630 |        350        1.17       32.48
      20631 |        351        1.17       33.65
      20632 |        338        1.13       34.78
      20633 |        338        1.13       35.91
      20634 |        330        1.10       37.01
      20635 |        318        1.06       38.07
      20636 |        304        1.01       39.08
      20637 |        342        1.14       40.22
      20638 |        337        1.12       41.35
      20639 |        303        1.01       42.36
      20640 |        274        0.91       43.27
      20641 |        298        0.99       44.27
      20642 |        276        0.92       45.19
      20643 |        300        1.00       46.19
      20644 |        281        0.94       47.12
      20645 |        282        0.94       48.07
      20646 |        285        0.95       49.02
      20647 |        270        0.90       49.92
      20648 |        255        0.85       50.77
      20649 |        280        0.93       51.70
      20650 |        232        0.77       52.48
      20651 |        257        0.86       53.33
      20652 |        262        0.87       54.21
      20653 |        255        0.85       55.06
      20654 |        244        0.81       55.87
      20655 |        234        0.78       56.65
      20656 |        226        0.75       57.41
      20657 |        228        0.76       58.17
      20658 |        219        0.73       58.90
      20659 |        208        0.69       59.59
      20660 |        224        0.75       60.34
      20661 |        194        0.65       60.99
      20662 |        213        0.71       61.70
      20663 |        182        0.61       62.30
      20664 |        196        0.65       62.96
      20665 |        204        0.68       63.64
      20666 |        172        0.57       64.21
      20667 |        188        0.63       64.84
      20668 |        161        0.54       65.38
      20669 |        153        0.51       65.89
      20670 |        184        0.61       66.50
      20671 |        169        0.56       67.06
      20672 |        193        0.64       67.71
      20673 |        168        0.56       68.27
      20674 |        149        0.50       68.77
      20675 |        157        0.52       69.29
      20676 |        156        0.52       69.81
      20677 |        146        0.49       70.30
      20678 |        118        0.39       70.69
      20679 |        152        0.51       71.20
      20680 |        138        0.46       71.66
      20681 |        150        0.50       72.16
      20682 |        149        0.50       72.65
      20683 |        126        0.42       73.08
      20684 |        123        0.41       73.49
      20685 |        127        0.42       73.91
      20686 |        122        0.41       74.32
      20687 |        118        0.39       74.71
      20688 |        132        0.44       75.15
      20689 |        114        0.38       75.53
      20690 |        136        0.45       75.98
      20691 |        115        0.38       76.37
      20692 |        111        0.37       76.74
      20693 |        110        0.37       77.11
      20694 |        110        0.37       77.47
      20695 |        106        0.35       77.83
      20696 |        129        0.43       78.26
      20697 |        109        0.36       78.62
      20698 |         93        0.31       78.93
      20699 |        114        0.38       79.31
      20700 |        109        0.36       79.67
      20701 |         99        0.33       80.00
      20702 |        109        0.36       80.37
      20703 |        104        0.35       80.71
      20704 |         83        0.28       80.99
      20705 |        101        0.34       81.33
      20706 |         85        0.28       81.61
      20707 |         94        0.31       81.93
      20708 |         85        0.28       82.21
      20709 |         87        0.29       82.50
      20710 |         82        0.27       82.77
      20711 |         65        0.22       82.99
      20712 |         71        0.24       83.23
      20713 |         85        0.28       83.51
      20714 |         74        0.25       83.76
      20715 |         62        0.21       83.96
      20716 |         76        0.25       84.22
      20717 |         75        0.25       84.47
      20718 |         73        0.24       84.71
      20719 |         87        0.29       85.00
      20720 |         68        0.23       85.23
      20721 |         62        0.21       85.44
      20722 |         56        0.19       85.62
      20723 |         63        0.21       85.83
      20724 |         65        0.22       86.05
      20725 |         57        0.19       86.24
      20726 |         62        0.21       86.45
      20727 |         49        0.16       86.61
      20728 |         54        0.18       86.79
      20729 |         48        0.16       86.95
      20730 |         78        0.26       87.21
      20731 |         64        0.21       87.42
      20732 |         54        0.18       87.60
      20733 |         60        0.20       87.80
      20734 |         55        0.18       87.99
      20735 |         64        0.21       88.20
      20736 |         59        0.20       88.40
      20737 |         45        0.15       88.55
      20738 |         59        0.20       88.74
      20739 |         38        0.13       88.87
      20740 |         36        0.12       88.99
      20741 |         47        0.16       89.15
      20742 |         40        0.13       89.28
      20743 |         48        0.16       89.44
      20744 |         39        0.13       89.57
      20745 |         36        0.12       89.69
      20746 |         50        0.17       89.86
      20747 |         40        0.13       89.99
      20748 |         36        0.12       90.11
      20749 |         37        0.12       90.24
      20750 |         51        0.17       90.41
      20751 |         40        0.13       90.54
      20752 |         37        0.12       90.66
      20753 |         40        0.13       90.80
      20754 |         29        0.10       90.89
      20755 |         38        0.13       91.02
      20756 |         38        0.13       91.15
      20757 |         35        0.12       91.26
      20758 |         36        0.12       91.38
      20759 |         36        0.12       91.50
      20760 |         27        0.09       91.59
      20761 |         29        0.10       91.69
      20762 |         32        0.11       91.80
      20763 |         25        0.08       91.88
      20764 |         23        0.08       91.96
      20765 |         21        0.07       92.03
      20766 |         27        0.09       92.12
      20767 |         22        0.07       92.19
      20768 |         22        0.07       92.26
      20769 |         24        0.08       92.34
      20770 |         26        0.09       92.43
      20771 |         25        0.08       92.51
      20772 |         19        0.06       92.58
      20773 |         34        0.11       92.69
      20774 |         17        0.06       92.75
      20775 |         20        0.07       92.81
      20776 |         26        0.09       92.90
      20777 |         19        0.06       92.96
      20778 |         25        0.08       93.05
      20779 |         23        0.08       93.12
      20780 |         20        0.07       93.19
      20781 |         18        0.06       93.25
      20782 |         21        0.07       93.32
      20783 |         19        0.06       93.38
      20784 |         25        0.08       93.47
      20785 |         18        0.06       93.53
      20786 |         15        0.05       93.58
      20787 |         20        0.07       93.64
      20788 |         24        0.08       93.72
      20789 |         17        0.06       93.78
      20790 |         15        0.05       93.83
      20791 |         15        0.05       93.88
      20792 |         16        0.05       93.94
      20793 |         12        0.04       93.98
      20794 |         13        0.04       94.02
      20795 |          8        0.03       94.05
      20796 |         17        0.06       94.10
      20797 |         14        0.05       94.15
      20798 |         17        0.06       94.21
      20799 |         13        0.04       94.25
      20800 |         13        0.04       94.29
      20801 |         16        0.05       94.35
      20802 |         18        0.06       94.41
      20803 |         13        0.04       94.45
      20804 |         11        0.04       94.49
      20805 |          9        0.03       94.52
      20806 |          7        0.02       94.54
      20807 |         10        0.03       94.57
      20808 |         19        0.06       94.64
      20809 |         16        0.05       94.69
      20810 |         11        0.04       94.73
      20811 |         11        0.04       94.76
      20812 |         12        0.04       94.80
      20813 |          7        0.02       94.83
      20814 |         10        0.03       94.86
      20815 |          9        0.03       94.89
      20816 |          8        0.03       94.92
      20817 |          8        0.03       94.94
      20818 |         15        0.05       94.99
      20819 |          9        0.03       95.02
      20820 |          6        0.02       95.04
      20821 |         12        0.04       95.08
      20822 |         10        0.03       95.12
      20823 |          7        0.02       95.14
      20824 |          9        0.03       95.17
      20825 |         11        0.04       95.21
      20826 |         12        0.04       95.25
      20827 |          5        0.02       95.26
      20828 |          8        0.03       95.29
      20829 |          7        0.02       95.31
      20830 |          5        0.02       95.33
      20831 |          5        0.02       95.35
      20832 |          8        0.03       95.37
      20833 |          9        0.03       95.40
      20834 |          3        0.01       95.41
      20835 |          9        0.03       95.44
      20836 |          4        0.01       95.46
      20837 |          6        0.02       95.48
      20838 |          6        0.02       95.50
      20839 |          6        0.02       95.52
      20840 |          4        0.01       95.53
      20841 |          3        0.01       95.54
      20842 |          4        0.01       95.55
      20843 |          3        0.01       95.56
      20844 |         13        0.04       95.61
      20845 |          3        0.01       95.62
      20846 |          8        0.03       95.64
      20847 |          6        0.02       95.66
      20848 |          4        0.01       95.68
      20849 |          5        0.02       95.69
      20850 |          7        0.02       95.72
      20851 |          4        0.01       95.73
      20852 |          5        0.02       95.75
      20853 |          5        0.02       95.76
      20854 |          6        0.02       95.78
      20855 |          5        0.02       95.80
      20856 |          4        0.01       95.81
      20857 |          4        0.01       95.83
      20858 |          5        0.02       95.84
      20859 |          2        0.01       95.85
      20860 |          3        0.01       95.86
      20861 |          4        0.01       95.87
      20862 |          5        0.02       95.89
      20863 |          2        0.01       95.90
      20864 |          3        0.01       95.91
      20865 |          1        0.00       95.91
      20866 |          1        0.00       95.91
      20867 |          2        0.01       95.92
      20868 |          4        0.01       95.93
      20869 |          5        0.02       95.95
      20870 |          2        0.01       95.96
      20871 |          7        0.02       95.98
      20872 |          1        0.00       95.98
      20874 |          2        0.01       95.99
      20875 |          2        0.01       96.00
      20876 |          7        0.02       96.02
      20877 |          8        0.03       96.05
      20878 |          3        0.01       96.06
      20879 |          4        0.01       96.07
      20880 |          2        0.01       96.08
      20881 |          4        0.01       96.09
      20882 |          1        0.00       96.09
      20883 |          2        0.01       96.10
      20884 |          1        0.00       96.10
      20885 |          5        0.02       96.12
      20886 |          4        0.01       96.13
      20887 |          2        0.01       96.14
      20888 |          3        0.01       96.15
      20890 |          1        0.00       96.15
      20891 |          3        0.01       96.16
      20892 |          3        0.01       96.17
      20893 |          1        0.00       96.18
      20895 |          2        0.01       96.18
      20896 |          3        0.01       96.19
      20897 |          2        0.01       96.20
      20898 |          2        0.01       96.21
      20899 |          1        0.00       96.21
      20901 |          2        0.01       96.22
      20902 |          1        0.00       96.22
      20903 |          1        0.00       96.22
      20904 |          2        0.01       96.23
      20905 |          3        0.01       96.24
      20906 |          1        0.00       96.24
      20907 |          3        0.01       96.25
      20909 |          1        0.00       96.26
      20911 |          1        0.00       96.26
      20913 |          1        0.00       96.26
      20914 |          2        0.01       96.27
      20915 |          1        0.00       96.27
      20916 |          1        0.00       96.28
      20917 |          2        0.01       96.28
      20918 |          3        0.01       96.29
      20919 |          2        0.01       96.30
      20920 |          1        0.00       96.30
      20921 |          1        0.00       96.31
      20923 |          1        0.00       96.31
      20924 |          1        0.00       96.31
      20925 |          2        0.01       96.32
      20926 |          2        0.01       96.33
      20930 |          2        0.01       96.33
      20933 |          2        0.01       96.34
      20934 |          1        0.00       96.34
      20935 |          1        0.00       96.35
      20936 |          2        0.01       96.35
      20937 |          3        0.01       96.36
      20938 |          2        0.01       96.37
      20939 |          2        0.01       96.38
      20940 |          1        0.00       96.38
      20942 |          1        0.00       96.38
      20944 |          1        0.00       96.39
      20945 |          1        0.00       96.39
      20949 |          1        0.00       96.39
      20950 |          1        0.00       96.40
      20953 |          3        0.01       96.41
      20954 |          1        0.00       96.41
      20959 |          1        0.00       96.41
      20960 |          1        0.00       96.42
      20961 |          2        0.01       96.42
      20962 |          2        0.01       96.43
      20965 |          1        0.00       96.43
      20967 |          2        0.01       96.44
      20972 |          1        0.00       96.44
      20975 |          1        0.00       96.45
      20980 |          1        0.00       96.45
      20981 |          1        0.00       96.45
      20982 |          1        0.00       96.46
      20988 |          1        0.00       96.46
      21005 |          1        0.00       96.46
      21011 |          1        0.00       96.47
      21023 |          1        0.00       96.47
      21024 |          1        0.00       96.47
      21031 |          2        0.01       96.48
      21064 |          1        0.00       96.48
      21097 |          1        0.00       96.49
          . |      1,053        3.51      100.00
------------+-----------------------------------
      Total |     29,976      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
     20607 |         0          2          1          0 |         3 
           |      0.00       0.07       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20608 |       123         36         26         41 |       226 
           |      0.59       1.21       0.87       1.34 |      0.75 
-----------+--------------------------------------------+----------
     20609 |       348         63         69         72 |       552 
           |      1.66       2.12       2.31       2.35 |      1.84 
-----------+--------------------------------------------+----------
     20610 |       336         65         61         55 |       517 
           |      1.60       2.19       2.04       1.80 |      1.72 
-----------+--------------------------------------------+----------
     20611 |       316         54         50         63 |       483 
           |      1.51       1.82       1.67       2.06 |      1.61 
-----------+--------------------------------------------+----------
     20612 |       360         52         48         56 |       516 
           |      1.72       1.75       1.61       1.83 |      1.72 
-----------+--------------------------------------------+----------
     20613 |       347         43         48         56 |       494 
           |      1.66       1.45       1.61       1.83 |      1.65 
-----------+--------------------------------------------+----------
     20614 |       335         50         47         47 |       479 
           |      1.60       1.68       1.57       1.54 |      1.60 
-----------+--------------------------------------------+----------
     20615 |       309         49         55         59 |       472 
           |      1.47       1.65       1.84       1.93 |      1.57 
-----------+--------------------------------------------+----------
     20616 |       341         47         49         53 |       490 
           |      1.63       1.58       1.64       1.73 |      1.63 
-----------+--------------------------------------------+----------
     20617 |       325         40         43         38 |       446 
           |      1.55       1.35       1.44       1.24 |      1.49 
-----------+--------------------------------------------+----------
     20618 |       293         25         45         47 |       410 
           |      1.40       0.84       1.51       1.54 |      1.37 
-----------+--------------------------------------------+----------
     20619 |       282         45         58         46 |       431 
           |      1.35       1.52       1.94       1.50 |      1.44 
-----------+--------------------------------------------+----------
     20620 |       291         48         49         56 |       444 
           |      1.39       1.62       1.64       1.83 |      1.48 
-----------+--------------------------------------------+----------
     20621 |       288         39         41         42 |       410 
           |      1.37       1.31       1.37       1.37 |      1.37 
-----------+--------------------------------------------+----------
     20622 |       287         44         56         33 |       420 
           |      1.37       1.48       1.87       1.08 |      1.40 
-----------+--------------------------------------------+----------
     20623 |       230         46         43         38 |       357 
           |      1.10       1.55       1.44       1.24 |      1.19 
-----------+--------------------------------------------+----------
     20624 |       263         31         46         49 |       389 
           |      1.25       1.04       1.54       1.60 |      1.30 
-----------+--------------------------------------------+----------
     20625 |       284         44         42         39 |       409 
           |      1.36       1.48       1.41       1.27 |      1.36 
-----------+--------------------------------------------+----------
     20626 |       214         48         38         43 |       343 
           |      1.02       1.62       1.27       1.41 |      1.14 
-----------+--------------------------------------------+----------
     20627 |       244         29         51         50 |       374 
           |      1.16       0.98       1.71       1.63 |      1.25 
-----------+--------------------------------------------+----------
     20628 |       267         33         31         35 |       366 
           |      1.27       1.11       1.04       1.14 |      1.22 
-----------+--------------------------------------------+----------
     20629 |       257         37         27         34 |       355 
           |      1.23       1.25       0.90       1.11 |      1.18 
-----------+--------------------------------------------+----------
     20630 |       247         31         35         37 |       350 
           |      1.18       1.04       1.17       1.21 |      1.17 
-----------+--------------------------------------------+----------
     20631 |       244         40         36         31 |       351 
           |      1.16       1.35       1.21       1.01 |      1.17 
-----------+--------------------------------------------+----------
     20632 |       223         25         40         50 |       338 
           |      1.06       0.84       1.34       1.63 |      1.13 
-----------+--------------------------------------------+----------
     20633 |       240         33         24         41 |       338 
           |      1.15       1.11       0.80       1.34 |      1.13 
-----------+--------------------------------------------+----------
     20634 |       244         36         26         24 |       330 
           |      1.16       1.21       0.87       0.78 |      1.10 
-----------+--------------------------------------------+----------
     20635 |       218         36         34         30 |       318 
           |      1.04       1.21       1.14       0.98 |      1.06 
-----------+--------------------------------------------+----------
     20636 |       205         30         33         36 |       304 
           |      0.98       1.01       1.10       1.18 |      1.01 
-----------+--------------------------------------------+----------
     20637 |       242         36         33         31 |       342 
           |      1.15       1.21       1.10       1.01 |      1.14 
-----------+--------------------------------------------+----------
     20638 |       245         38         24         30 |       337 
           |      1.17       1.28       0.80       0.98 |      1.12 
-----------+--------------------------------------------+----------
     20639 |       187         45         40         31 |       303 
           |      0.89       1.52       1.34       1.01 |      1.01 
-----------+--------------------------------------------+----------
     20640 |       197         23         31         23 |       274 
           |      0.94       0.77       1.04       0.75 |      0.91 
-----------+--------------------------------------------+----------
     20641 |       208         25         32         33 |       298 
           |      0.99       0.84       1.07       1.08 |      0.99 
-----------+--------------------------------------------+----------
     20642 |       183         36         24         33 |       276 
           |      0.87       1.21       0.80       1.08 |      0.92 
-----------+--------------------------------------------+----------
     20643 |       197         36         36         31 |       300 
           |      0.94       1.21       1.21       1.01 |      1.00 
-----------+--------------------------------------------+----------
     20644 |       196         25         31         29 |       281 
           |      0.94       0.84       1.04       0.95 |      0.94 
-----------+--------------------------------------------+----------
     20645 |       181         34         32         35 |       282 
           |      0.86       1.14       1.07       1.14 |      0.94 
-----------+--------------------------------------------+----------
     20646 |       188         41         34         22 |       285 
           |      0.90       1.38       1.14       0.72 |      0.95 
-----------+--------------------------------------------+----------
     20647 |       191         33         25         21 |       270 
           |      0.91       1.11       0.84       0.69 |      0.90 
-----------+--------------------------------------------+----------
     20648 |       163         33         23         36 |       255 
           |      0.78       1.11       0.77       1.18 |      0.85 
-----------+--------------------------------------------+----------
     20649 |       179         38         30         33 |       280 
           |      0.85       1.28       1.00       1.08 |      0.93 
-----------+--------------------------------------------+----------
     20650 |       157         32         20         23 |       232 
           |      0.75       1.08       0.67       0.75 |      0.77 
-----------+--------------------------------------------+----------
     20651 |       174         35         26         22 |       257 
           |      0.83       1.18       0.87       0.72 |      0.86 
-----------+--------------------------------------------+----------
     20652 |       172         31         30         29 |       262 
           |      0.82       1.04       1.00       0.95 |      0.87 
-----------+--------------------------------------------+----------
     20653 |       167         24         35         29 |       255 
           |      0.80       0.81       1.17       0.95 |      0.85 
-----------+--------------------------------------------+----------
     20654 |       171         24         18         31 |       244 
           |      0.82       0.81       0.60       1.01 |      0.81 
-----------+--------------------------------------------+----------
     20655 |       171         23         19         21 |       234 
           |      0.82       0.77       0.64       0.69 |      0.78 
-----------+--------------------------------------------+----------
     20656 |       156         21         24         25 |       226 
           |      0.74       0.71       0.80       0.82 |      0.75 
-----------+--------------------------------------------+----------
     20657 |       156         14         32         26 |       228 
           |      0.74       0.47       1.07       0.85 |      0.76 
-----------+--------------------------------------------+----------
     20658 |       149         27         23         20 |       219 
           |      0.71       0.91       0.77       0.65 |      0.73 
-----------+--------------------------------------------+----------
     20659 |       135         23         27         23 |       208 
           |      0.64       0.77       0.90       0.75 |      0.69 
-----------+--------------------------------------------+----------
     20660 |       146         27         18         33 |       224 
           |      0.70       0.91       0.60       1.08 |      0.75 
-----------+--------------------------------------------+----------
     20661 |       128         23         19         24 |       194 
           |      0.61       0.77       0.64       0.78 |      0.65 
-----------+--------------------------------------------+----------
     20662 |       143         20         25         25 |       213 
           |      0.68       0.67       0.84       0.82 |      0.71 
-----------+--------------------------------------------+----------
     20663 |       121         19         21         21 |       182 
           |      0.58       0.64       0.70       0.69 |      0.61 
-----------+--------------------------------------------+----------
     20664 |       136         15         20         25 |       196 
           |      0.65       0.51       0.67       0.82 |      0.65 
-----------+--------------------------------------------+----------
     20665 |       139         17         22         26 |       204 
           |      0.66       0.57       0.74       0.85 |      0.68 
-----------+--------------------------------------------+----------
     20666 |       118         16         20         18 |       172 
           |      0.56       0.54       0.67       0.59 |      0.57 
-----------+--------------------------------------------+----------
     20667 |       127         15         24         22 |       188 
           |      0.61       0.51       0.80       0.72 |      0.63 
-----------+--------------------------------------------+----------
     20668 |       104         16         22         19 |       161 
           |      0.50       0.54       0.74       0.62 |      0.54 
-----------+--------------------------------------------+----------
     20669 |       115         12         14         12 |       153 
           |      0.55       0.40       0.47       0.39 |      0.51 
-----------+--------------------------------------------+----------
     20670 |       123         23         14         24 |       184 
           |      0.59       0.77       0.47       0.78 |      0.61 
-----------+--------------------------------------------+----------
     20671 |       105         22         21         21 |       169 
           |      0.50       0.74       0.70       0.69 |      0.56 
-----------+--------------------------------------------+----------
     20672 |       137         15         16         25 |       193 
           |      0.65       0.51       0.54       0.82 |      0.64 
-----------+--------------------------------------------+----------
     20673 |       126         15         13         14 |       168 
           |      0.60       0.51       0.44       0.46 |      0.56 
-----------+--------------------------------------------+----------
     20674 |       101         17         17         14 |       149 
           |      0.48       0.57       0.57       0.46 |      0.50 
-----------+--------------------------------------------+----------
     20675 |       102         19         23         13 |       157 
           |      0.49       0.64       0.77       0.42 |      0.52 
-----------+--------------------------------------------+----------
     20676 |       102         20         17         17 |       156 
           |      0.49       0.67       0.57       0.56 |      0.52 
-----------+--------------------------------------------+----------
     20677 |       100         24         12         10 |       146 
           |      0.48       0.81       0.40       0.33 |      0.49 
-----------+--------------------------------------------+----------
     20678 |        80         11         12         15 |       118 
           |      0.38       0.37       0.40       0.49 |      0.39 
-----------+--------------------------------------------+----------
     20679 |       113         11         14         14 |       152 
           |      0.54       0.37       0.47       0.46 |      0.51 
-----------+--------------------------------------------+----------
     20680 |        91         19         16         12 |       138 
           |      0.43       0.64       0.54       0.39 |      0.46 
-----------+--------------------------------------------+----------
     20681 |       107         18         11         14 |       150 
           |      0.51       0.61       0.37       0.46 |      0.50 
-----------+--------------------------------------------+----------
     20682 |       105          9         17         18 |       149 
           |      0.50       0.30       0.57       0.59 |      0.50 
-----------+--------------------------------------------+----------
     20683 |        79         16         18         13 |       126 
           |      0.38       0.54       0.60       0.42 |      0.42 
-----------+--------------------------------------------+----------
     20684 |        88          7         12         16 |       123 
           |      0.42       0.24       0.40       0.52 |      0.41 
-----------+--------------------------------------------+----------
     20685 |        91         14         10         12 |       127 
           |      0.43       0.47       0.33       0.39 |      0.42 
-----------+--------------------------------------------+----------
     20686 |        88          7         15         12 |       122 
           |      0.42       0.24       0.50       0.39 |      0.41 
-----------+--------------------------------------------+----------
     20687 |        82         15         11         10 |       118 
           |      0.39       0.51       0.37       0.33 |      0.39 
-----------+--------------------------------------------+----------
     20688 |       100          9         11         12 |       132 
           |      0.48       0.30       0.37       0.39 |      0.44 
-----------+--------------------------------------------+----------
     20689 |        79         10         13         12 |       114 
           |      0.38       0.34       0.44       0.39 |      0.38 
-----------+--------------------------------------------+----------
     20690 |        85         18         16         17 |       136 
           |      0.41       0.61       0.54       0.56 |      0.45 
-----------+--------------------------------------------+----------
     20691 |        80         13         12         10 |       115 
           |      0.38       0.44       0.40       0.33 |      0.38 
-----------+--------------------------------------------+----------
     20692 |        76         12         14          9 |       111 
           |      0.36       0.40       0.47       0.29 |      0.37 
-----------+--------------------------------------------+----------
     20693 |        81         12         12          5 |       110 
           |      0.39       0.40       0.40       0.16 |      0.37 
-----------+--------------------------------------------+----------
     20694 |        66         20          9         15 |       110 
           |      0.31       0.67       0.30       0.49 |      0.37 
-----------+--------------------------------------------+----------
     20695 |        75         10         14          7 |       106 
           |      0.36       0.34       0.47       0.23 |      0.35 
-----------+--------------------------------------------+----------
     20696 |        89         15         11         14 |       129 
           |      0.42       0.51       0.37       0.46 |      0.43 
-----------+--------------------------------------------+----------
     20697 |        70          9         10         20 |       109 
           |      0.33       0.30       0.33       0.65 |      0.36 
-----------+--------------------------------------------+----------
     20698 |        68         12          8          5 |        93 
           |      0.32       0.40       0.27       0.16 |      0.31 
-----------+--------------------------------------------+----------
     20699 |        78         10         11         15 |       114 
           |      0.37       0.34       0.37       0.49 |      0.38 
-----------+--------------------------------------------+----------
     20700 |        81          6         12         10 |       109 
           |      0.39       0.20       0.40       0.33 |      0.36 
-----------+--------------------------------------------+----------
     20701 |        71          6          9         13 |        99 
           |      0.34       0.20       0.30       0.42 |      0.33 
-----------+--------------------------------------------+----------
     20702 |        78          7         11         13 |       109 
           |      0.37       0.24       0.37       0.42 |      0.36 
-----------+--------------------------------------------+----------
     20703 |        69         16         12          7 |       104 
           |      0.33       0.54       0.40       0.23 |      0.35 
-----------+--------------------------------------------+----------
     20704 |        51         13         10          9 |        83 
           |      0.24       0.44       0.33       0.29 |      0.28 
-----------+--------------------------------------------+----------
     20705 |        65         16         12          8 |       101 
           |      0.31       0.54       0.40       0.26 |      0.34 
-----------+--------------------------------------------+----------
     20706 |        56         10         10          9 |        85 
           |      0.27       0.34       0.33       0.29 |      0.28 
-----------+--------------------------------------------+----------
     20707 |        66         13          4         11 |        94 
           |      0.31       0.44       0.13       0.36 |      0.31 
-----------+--------------------------------------------+----------
     20708 |        60         12          6          7 |        85 
           |      0.29       0.40       0.20       0.23 |      0.28 
-----------+--------------------------------------------+----------
     20709 |        59          7          8         13 |        87 
           |      0.28       0.24       0.27       0.42 |      0.29 
-----------+--------------------------------------------+----------
     20710 |        53          8         10         11 |        82 
           |      0.25       0.27       0.33       0.36 |      0.27 
-----------+--------------------------------------------+----------
     20711 |        49          4          6          6 |        65 
           |      0.23       0.13       0.20       0.20 |      0.22 
-----------+--------------------------------------------+----------
     20712 |        58          4          5          4 |        71 
           |      0.28       0.13       0.17       0.13 |      0.24 
-----------+--------------------------------------------+----------
     20713 |        66          5          9          5 |        85 
           |      0.31       0.17       0.30       0.16 |      0.28 
-----------+--------------------------------------------+----------
     20714 |        52          8          5          9 |        74 
           |      0.25       0.27       0.17       0.29 |      0.25 
-----------+--------------------------------------------+----------
     20715 |        45          8          3          6 |        62 
           |      0.21       0.27       0.10       0.20 |      0.21 
-----------+--------------------------------------------+----------
     20716 |        60          3          6          7 |        76 
           |      0.29       0.10       0.20       0.23 |      0.25 
-----------+--------------------------------------------+----------
     20717 |        53          6          7          9 |        75 
           |      0.25       0.20       0.23       0.29 |      0.25 
-----------+--------------------------------------------+----------
     20718 |        55          8          6          4 |        73 
           |      0.26       0.27       0.20       0.13 |      0.24 
-----------+--------------------------------------------+----------
     20719 |        54         14          7         12 |        87 
           |      0.26       0.47       0.23       0.39 |      0.29 
-----------+--------------------------------------------+----------
     20720 |        44          3         11         10 |        68 
           |      0.21       0.10       0.37       0.33 |      0.23 
-----------+--------------------------------------------+----------
     20721 |        40          8          9          5 |        62 
           |      0.19       0.27       0.30       0.16 |      0.21 
-----------+--------------------------------------------+----------
     20722 |        42          5          5          4 |        56 
           |      0.20       0.17       0.17       0.13 |      0.19 
-----------+--------------------------------------------+----------
     20723 |        41          3          8         11 |        63 
           |      0.20       0.10       0.27       0.36 |      0.21 
-----------+--------------------------------------------+----------
     20724 |        51          6          6          2 |        65 
           |      0.24       0.20       0.20       0.07 |      0.22 
-----------+--------------------------------------------+----------
     20725 |        35          6          7          9 |        57 
           |      0.17       0.20       0.23       0.29 |      0.19 
-----------+--------------------------------------------+----------
     20726 |        35         10          4         13 |        62 
           |      0.17       0.34       0.13       0.42 |      0.21 
-----------+--------------------------------------------+----------
     20727 |        35          6          7          1 |        49 
           |      0.17       0.20       0.23       0.03 |      0.16 
-----------+--------------------------------------------+----------
     20728 |        39          3          8          4 |        54 
           |      0.19       0.10       0.27       0.13 |      0.18 
-----------+--------------------------------------------+----------
     20729 |        33          3          5          7 |        48 
           |      0.16       0.10       0.17       0.23 |      0.16 
-----------+--------------------------------------------+----------
     20730 |        58          5          8          7 |        78 
           |      0.28       0.17       0.27       0.23 |      0.26 
-----------+--------------------------------------------+----------
     20731 |        45          9          4          6 |        64 
           |      0.21       0.30       0.13       0.20 |      0.21 
-----------+--------------------------------------------+----------
     20732 |        28          6          6         14 |        54 
           |      0.13       0.20       0.20       0.46 |      0.18 
-----------+--------------------------------------------+----------
     20733 |        41          8          8          3 |        60 
           |      0.20       0.27       0.27       0.10 |      0.20 
-----------+--------------------------------------------+----------
     20734 |        41          2          6          6 |        55 
           |      0.20       0.07       0.20       0.20 |      0.18 
-----------+--------------------------------------------+----------
     20735 |        44          2          9          9 |        64 
           |      0.21       0.07       0.30       0.29 |      0.21 
-----------+--------------------------------------------+----------
     20736 |        38         10          8          3 |        59 
           |      0.18       0.34       0.27       0.10 |      0.20 
-----------+--------------------------------------------+----------
     20737 |        34          1          5          5 |        45 
           |      0.16       0.03       0.17       0.16 |      0.15 
-----------+--------------------------------------------+----------
     20738 |        38          5          8          8 |        59 
           |      0.18       0.17       0.27       0.26 |      0.20 
-----------+--------------------------------------------+----------
     20739 |        31          2          2          3 |        38 
           |      0.15       0.07       0.07       0.10 |      0.13 
-----------+--------------------------------------------+----------
     20740 |        28          4          4          0 |        36 
           |      0.13       0.13       0.13       0.00 |      0.12 
-----------+--------------------------------------------+----------
     20741 |        32          7          4          4 |        47 
           |      0.15       0.24       0.13       0.13 |      0.16 
-----------+--------------------------------------------+----------
     20742 |        33          1          0          6 |        40 
           |      0.16       0.03       0.00       0.20 |      0.13 
-----------+--------------------------------------------+----------
     20743 |        32          3          8          5 |        48 
           |      0.15       0.10       0.27       0.16 |      0.16 
-----------+--------------------------------------------+----------
     20744 |        27          3          4          5 |        39 
           |      0.13       0.10       0.13       0.16 |      0.13 
-----------+--------------------------------------------+----------
     20745 |        29          1          4          2 |        36 
           |      0.14       0.03       0.13       0.07 |      0.12 
-----------+--------------------------------------------+----------
     20746 |        34          5          7          4 |        50 
           |      0.16       0.17       0.23       0.13 |      0.17 
-----------+--------------------------------------------+----------
     20747 |        31          5          1          3 |        40 
           |      0.15       0.17       0.03       0.10 |      0.13 
-----------+--------------------------------------------+----------
     20748 |        30          1          3          2 |        36 
           |      0.14       0.03       0.10       0.07 |      0.12 
-----------+--------------------------------------------+----------
     20749 |        25          3          4          5 |        37 
           |      0.12       0.10       0.13       0.16 |      0.12 
-----------+--------------------------------------------+----------
     20750 |        37          6          5          3 |        51 
           |      0.18       0.20       0.17       0.10 |      0.17 
-----------+--------------------------------------------+----------
     20751 |        34          4          1          1 |        40 
           |      0.16       0.13       0.03       0.03 |      0.13 
-----------+--------------------------------------------+----------
     20752 |        28          4          3          2 |        37 
           |      0.13       0.13       0.10       0.07 |      0.12 
-----------+--------------------------------------------+----------
     20753 |        33          2          2          3 |        40 
           |      0.16       0.07       0.07       0.10 |      0.13 
-----------+--------------------------------------------+----------
     20754 |        23          0          3          3 |        29 
           |      0.11       0.00       0.10       0.10 |      0.10 
-----------+--------------------------------------------+----------
     20755 |        28          5          3          2 |        38 
           |      0.13       0.17       0.10       0.07 |      0.13 
-----------+--------------------------------------------+----------
     20756 |        27          1          4          6 |        38 
           |      0.13       0.03       0.13       0.20 |      0.13 
-----------+--------------------------------------------+----------
     20757 |        27          2          2          4 |        35 
           |      0.13       0.07       0.07       0.13 |      0.12 
-----------+--------------------------------------------+----------
     20758 |        26          2          4          4 |        36 
           |      0.12       0.07       0.13       0.13 |      0.12 
-----------+--------------------------------------------+----------
     20759 |        27          2          3          4 |        36 
           |      0.13       0.07       0.10       0.13 |      0.12 
-----------+--------------------------------------------+----------
     20760 |        22          3          0          2 |        27 
           |      0.10       0.10       0.00       0.07 |      0.09 
-----------+--------------------------------------------+----------
     20761 |        23          3          3          0 |        29 
           |      0.11       0.10       0.10       0.00 |      0.10 
-----------+--------------------------------------------+----------
     20762 |        29          2          1          0 |        32 
           |      0.14       0.07       0.03       0.00 |      0.11 
-----------+--------------------------------------------+----------
     20763 |        21          0          1          3 |        25 
           |      0.10       0.00       0.03       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20764 |        18          2          1          2 |        23 
           |      0.09       0.07       0.03       0.07 |      0.08 
-----------+--------------------------------------------+----------
     20765 |        17          2          1          1 |        21 
           |      0.08       0.07       0.03       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20766 |        23          1          2          1 |        27 
           |      0.11       0.03       0.07       0.03 |      0.09 
-----------+--------------------------------------------+----------
     20767 |        19          1          1          1 |        22 
           |      0.09       0.03       0.03       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20768 |        18          3          1          0 |        22 
           |      0.09       0.10       0.03       0.00 |      0.07 
-----------+--------------------------------------------+----------
     20769 |        19          2          0          3 |        24 
           |      0.09       0.07       0.00       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20770 |        20          1          2          3 |        26 
           |      0.10       0.03       0.07       0.10 |      0.09 
-----------+--------------------------------------------+----------
     20771 |        17          1          4          3 |        25 
           |      0.08       0.03       0.13       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20772 |        14          1          1          3 |        19 
           |      0.07       0.03       0.03       0.10 |      0.06 
-----------+--------------------------------------------+----------
     20773 |        28          5          0          1 |        34 
           |      0.13       0.17       0.00       0.03 |      0.11 
-----------+--------------------------------------------+----------
     20774 |        10          2          3          2 |        17 
           |      0.05       0.07       0.10       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20775 |        12          0          5          3 |        20 
           |      0.06       0.00       0.17       0.10 |      0.07 
-----------+--------------------------------------------+----------
     20776 |        13          7          4          2 |        26 
           |      0.06       0.24       0.13       0.07 |      0.09 
-----------+--------------------------------------------+----------
     20777 |        16          2          1          0 |        19 
           |      0.08       0.07       0.03       0.00 |      0.06 
-----------+--------------------------------------------+----------
     20778 |        20          1          1          3 |        25 
           |      0.10       0.03       0.03       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20779 |        14          3          3          3 |        23 
           |      0.07       0.10       0.10       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20780 |        16          3          0          1 |        20 
           |      0.08       0.10       0.00       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20781 |        11          1          4          2 |        18 
           |      0.05       0.03       0.13       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20782 |        13          1          2          5 |        21 
           |      0.06       0.03       0.07       0.16 |      0.07 
-----------+--------------------------------------------+----------
     20783 |        15          1          2          1 |        19 
           |      0.07       0.03       0.07       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20784 |        17          2          2          4 |        25 
           |      0.08       0.07       0.07       0.13 |      0.08 
-----------+--------------------------------------------+----------
     20785 |        13          3          0          2 |        18 
           |      0.06       0.10       0.00       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20786 |        10          3          0          2 |        15 
           |      0.05       0.10       0.00       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20787 |        18          0          1          1 |        20 
           |      0.09       0.00       0.03       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20788 |        20          1          2          1 |        24 
           |      0.10       0.03       0.07       0.03 |      0.08 
-----------+--------------------------------------------+----------
     20789 |        14          1          0          2 |        17 
           |      0.07       0.03       0.00       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20790 |        10          1          1          3 |        15 
           |      0.05       0.03       0.03       0.10 |      0.05 
-----------+--------------------------------------------+----------
     20791 |        11          2          1          1 |        15 
           |      0.05       0.07       0.03       0.03 |      0.05 
-----------+--------------------------------------------+----------
     20792 |        12          1          1          2 |        16 
           |      0.06       0.03       0.03       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20793 |         8          1          2          1 |        12 
           |      0.04       0.03       0.07       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20794 |        10          1          2          0 |        13 
           |      0.05       0.03       0.07       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20795 |         8          0          0          0 |         8 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20796 |        13          2          1          1 |        17 
           |      0.06       0.07       0.03       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20797 |        11          2          1          0 |        14 
           |      0.05       0.07       0.03       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20798 |        12          0          4          1 |        17 
           |      0.06       0.00       0.13       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20799 |        11          1          1          0 |        13 
           |      0.05       0.03       0.03       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20800 |        10          1          0          2 |        13 
           |      0.05       0.03       0.00       0.07 |      0.04 
-----------+--------------------------------------------+----------
     20801 |        10          1          3          2 |        16 
           |      0.05       0.03       0.10       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20802 |        16          0          1          1 |        18 
           |      0.08       0.00       0.03       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20803 |        11          1          0          1 |        13 
           |      0.05       0.03       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20804 |         8          3          0          0 |        11 
           |      0.04       0.10       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20805 |         8          0          1          0 |         9 
           |      0.04       0.00       0.03       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20806 |         5          0          1          1 |         7 
           |      0.02       0.00       0.03       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20807 |         8          0          0          2 |        10 
           |      0.04       0.00       0.00       0.07 |      0.03 
-----------+--------------------------------------------+----------
     20808 |        14          1          1          3 |        19 
           |      0.07       0.03       0.03       0.10 |      0.06 
-----------+--------------------------------------------+----------
     20809 |        13          0          1          2 |        16 
           |      0.06       0.00       0.03       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20810 |         8          2          0          1 |        11 
           |      0.04       0.07       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20811 |        10          0          0          1 |        11 
           |      0.05       0.00       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20812 |        10          0          1          1 |        12 
           |      0.05       0.00       0.03       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20813 |         5          0          1          1 |         7 
           |      0.02       0.00       0.03       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20814 |         5          2          3          0 |        10 
           |      0.02       0.07       0.10       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20815 |         6          0          3          0 |         9 
           |      0.03       0.00       0.10       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20816 |         7          1          0          0 |         8 
           |      0.03       0.03       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20817 |         7          0          1          0 |         8 
           |      0.03       0.00       0.03       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20818 |        13          1          1          0 |        15 
           |      0.06       0.03       0.03       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20819 |         7          2          0          0 |         9 
           |      0.03       0.07       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20820 |         6          0          0          0 |         6 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20821 |         7          1          4          0 |        12 
           |      0.03       0.03       0.13       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20822 |         8          1          1          0 |        10 
           |      0.04       0.03       0.03       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20823 |         5          0          0          2 |         7 
           |      0.02       0.00       0.00       0.07 |      0.02 
-----------+--------------------------------------------+----------
     20824 |         5          1          1          2 |         9 
           |      0.02       0.03       0.03       0.07 |      0.03 
-----------+--------------------------------------------+----------
     20825 |         9          1          1          0 |        11 
           |      0.04       0.03       0.03       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20826 |         8          0          2          2 |        12 
           |      0.04       0.00       0.07       0.07 |      0.04 
-----------+--------------------------------------------+----------
     20827 |         4          0          1          0 |         5 
           |      0.02       0.00       0.03       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20828 |         6          1          1          0 |         8 
           |      0.03       0.03       0.03       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20829 |         5          2          0          0 |         7 
           |      0.02       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20830 |         3          2          0          0 |         5 
           |      0.01       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20831 |         5          0          0          0 |         5 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20832 |         7          1          0          0 |         8 
           |      0.03       0.03       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20833 |         7          0          0          2 |         9 
           |      0.03       0.00       0.00       0.07 |      0.03 
-----------+--------------------------------------------+----------
     20834 |         1          0          2          0 |         3 
           |      0.00       0.00       0.07       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20835 |         8          1          0          0 |         9 
           |      0.04       0.03       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20836 |         2          2          0          0 |         4 
           |      0.01       0.07       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20837 |         4          2          0          0 |         6 
           |      0.02       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20838 |         4          2          0          0 |         6 
           |      0.02       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20839 |         4          1          0          1 |         6 
           |      0.02       0.03       0.00       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20840 |         2          2          0          0 |         4 
           |      0.01       0.07       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20841 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20842 |         3          1          0          0 |         4 
           |      0.01       0.03       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20843 |         0          1          1          1 |         3 
           |      0.00       0.03       0.03       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20844 |        11          1          0          1 |        13 
           |      0.05       0.03       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20845 |         2          0          1          0 |         3 
           |      0.01       0.00       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20846 |         7          0          0          1 |         8 
           |      0.03       0.00       0.00       0.03 |      0.03 
-----------+--------------------------------------------+----------
     20847 |         3          0          0          3 |         6 
           |      0.01       0.00       0.00       0.10 |      0.02 
-----------+--------------------------------------------+----------
     20848 |         3          1          0          0 |         4 
           |      0.01       0.03       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20849 |         5          0          0          0 |         5 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20850 |         5          0          1          1 |         7 
           |      0.02       0.00       0.03       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20851 |         2          1          0          1 |         4 
           |      0.01       0.03       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20852 |         4          0          0          1 |         5 
           |      0.02       0.00       0.00       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20853 |         4          0          1          0 |         5 
           |      0.02       0.00       0.03       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20854 |         5          0          0          1 |         6 
           |      0.02       0.00       0.00       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20855 |         4          0          1          0 |         5 
           |      0.02       0.00       0.03       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20856 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20857 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20858 |         5          0          0          0 |         5 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20859 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20860 |         2          1          0          0 |         3 
           |      0.01       0.03       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20861 |         3          0          0          1 |         4 
           |      0.01       0.00       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20862 |         5          0          0          0 |         5 
           |      0.02       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20863 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20864 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20865 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20866 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20867 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20868 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20869 |         3          0          2          0 |         5 
           |      0.01       0.00       0.07       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20870 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20871 |         6          1          0          0 |         7 
           |      0.03       0.03       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20872 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20874 |         1          0          1          0 |         2 
           |      0.00       0.00       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20875 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20876 |         6          0          1          0 |         7 
           |      0.03       0.00       0.03       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20877 |         5          3          0          0 |         8 
           |      0.02       0.10       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20878 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20879 |         3          0          1          0 |         4 
           |      0.01       0.00       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20880 |         1          1          0          0 |         2 
           |      0.00       0.03       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20881 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20882 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20883 |         1          1          0          0 |         2 
           |      0.00       0.03       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20884 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20885 |         2          1          2          0 |         5 
           |      0.01       0.03       0.07       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20886 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20887 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20888 |         2          0          1          0 |         3 
           |      0.01       0.00       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20890 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20891 |         2          0          0          1 |         3 
           |      0.01       0.00       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20892 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20893 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20895 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20896 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20897 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20898 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20899 |         0          1          0          0 |         1 
           |      0.00       0.03       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20901 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20902 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20903 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20904 |         0          1          0          1 |         2 
           |      0.00       0.03       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20905 |         2          0          0          1 |         3 
           |      0.01       0.00       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20906 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20907 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20909 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20911 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20913 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20914 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20915 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20916 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20917 |         1          1          0          0 |         2 
           |      0.00       0.03       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20918 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20919 |         1          0          1          0 |         2 
           |      0.00       0.00       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20920 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20921 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20923 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20924 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20925 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20926 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20930 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20933 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20934 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20935 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20936 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20937 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20938 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20939 |         1          0          1          0 |         2 
           |      0.00       0.00       0.03       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20940 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20942 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20944 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20945 |         0          1          0          0 |         1 
           |      0.00       0.03       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20949 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20950 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20953 |         3          0          0          0 |         3 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20954 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20959 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20960 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20961 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20962 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20965 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20967 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20972 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20975 |         0          0          1          0 |         1 
           |      0.00       0.00       0.03       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20980 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20981 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20982 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20988 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21005 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21011 |         0          0          1          0 |         1 
           |      0.00       0.00       0.03       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21023 |         0          1          0          0 |         1 
           |      0.00       0.03       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21024 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21031 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     21064 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21097 |         1          0          0          0 |         1 
           |      0.00       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
         . |     1,053          0          0          0 |     1,053 
           |      5.02       0.00       0.00       0.00 |      3.51 
-----------+--------------------------------------------+----------
     Total |    20,959      2,970      2,987      3,060 |    29,976 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
     20608 |       123         26         19         30 |       198 
           |      0.62       0.95       0.69       1.05 |      0.70 
-----------+--------------------------------------------+----------
     20609 |       348         50         58         65 |       521 
           |      1.75       1.82       2.11       2.27 |      1.84 
-----------+--------------------------------------------+----------
     20610 |       336         51         52         42 |       481 
           |      1.69       1.85       1.89       1.47 |      1.70 
-----------+--------------------------------------------+----------
     20611 |       316         43         42         54 |       455 
           |      1.59       1.56       1.53       1.88 |      1.61 
-----------+--------------------------------------------+----------
     20612 |       360         52         48         56 |       516 
           |      1.81       1.89       1.75       1.95 |      1.83 
-----------+--------------------------------------------+----------
     20613 |       347         43         48         56 |       494 
           |      1.74       1.56       1.75       1.95 |      1.75 
-----------+--------------------------------------------+----------
     20614 |       335         50         47         47 |       479 
           |      1.68       1.82       1.71       1.64 |      1.69 
-----------+--------------------------------------------+----------
     20615 |       309         49         55         59 |       472 
           |      1.55       1.78       2.00       2.06 |      1.67 
-----------+--------------------------------------------+----------
     20616 |       341         47         49         53 |       490 
           |      1.71       1.71       1.78       1.85 |      1.73 
-----------+--------------------------------------------+----------
     20617 |       325         40         43         38 |       446 
           |      1.63       1.45       1.56       1.33 |      1.58 
-----------+--------------------------------------------+----------
     20618 |       293         25         45         47 |       410 
           |      1.47       0.91       1.64       1.64 |      1.45 
-----------+--------------------------------------------+----------
     20619 |       282         45         58         46 |       431 
           |      1.42       1.64       2.11       1.61 |      1.52 
-----------+--------------------------------------------+----------
     20620 |       291         48         49         56 |       444 
           |      1.46       1.74       1.78       1.95 |      1.57 
-----------+--------------------------------------------+----------
     20621 |       288         39         41         42 |       410 
           |      1.45       1.42       1.49       1.47 |      1.45 
-----------+--------------------------------------------+----------
     20622 |       287         44         56         33 |       420 
           |      1.44       1.60       2.04       1.15 |      1.49 
-----------+--------------------------------------------+----------
     20623 |       230         46         43         38 |       357 
           |      1.16       1.67       1.56       1.33 |      1.26 
-----------+--------------------------------------------+----------
     20624 |       263         31         46         49 |       389 
           |      1.32       1.13       1.67       1.71 |      1.38 
-----------+--------------------------------------------+----------
     20625 |       284         44         42         39 |       409 
           |      1.43       1.60       1.53       1.36 |      1.45 
-----------+--------------------------------------------+----------
     20626 |       214         48         38         43 |       343 
           |      1.08       1.74       1.38       1.50 |      1.21 
-----------+--------------------------------------------+----------
     20627 |       244         29         51         50 |       374 
           |      1.23       1.05       1.86       1.75 |      1.32 
-----------+--------------------------------------------+----------
     20628 |       267         33         31         35 |       366 
           |      1.34       1.20       1.13       1.22 |      1.29 
-----------+--------------------------------------------+----------
     20629 |       257         37         27         34 |       355 
           |      1.29       1.34       0.98       1.19 |      1.26 
-----------+--------------------------------------------+----------
     20630 |       247         31         35         37 |       350 
           |      1.24       1.13       1.27       1.29 |      1.24 
-----------+--------------------------------------------+----------
     20631 |       244         40         36         31 |       351 
           |      1.23       1.45       1.31       1.08 |      1.24 
-----------+--------------------------------------------+----------
     20632 |       223         25         40         50 |       338 
           |      1.12       0.91       1.46       1.75 |      1.20 
-----------+--------------------------------------------+----------
     20633 |       240         33         24         41 |       338 
           |      1.21       1.20       0.87       1.43 |      1.20 
-----------+--------------------------------------------+----------
     20634 |       244         36         26         24 |       330 
           |      1.23       1.31       0.95       0.84 |      1.17 
-----------+--------------------------------------------+----------
     20635 |       218         36         34         30 |       318 
           |      1.10       1.31       1.24       1.05 |      1.12 
-----------+--------------------------------------------+----------
     20636 |       205         29         33         36 |       303 
           |      1.03       1.05       1.20       1.26 |      1.07 
-----------+--------------------------------------------+----------
     20637 |       242         32         28         26 |       328 
           |      1.22       1.16       1.02       0.91 |      1.16 
-----------+--------------------------------------------+----------
     20638 |       245         34         24         29 |       332 
           |      1.23       1.24       0.87       1.01 |      1.17 
-----------+--------------------------------------------+----------
     20639 |       187         42         32         28 |       289 
           |      0.94       1.53       1.16       0.98 |      1.02 
-----------+--------------------------------------------+----------
     20640 |       197         23         27         21 |       268 
           |      0.99       0.84       0.98       0.73 |      0.95 
-----------+--------------------------------------------+----------
     20641 |       208         21         30         32 |       291 
           |      1.04       0.76       1.09       1.12 |      1.03 
-----------+--------------------------------------------+----------
     20642 |       183         35         23         32 |       273 
           |      0.92       1.27       0.84       1.12 |      0.97 
-----------+--------------------------------------------+----------
     20643 |       197         35         31         30 |       293 
           |      0.99       1.27       1.13       1.05 |      1.04 
-----------+--------------------------------------------+----------
     20644 |       196         19         29         27 |       271 
           |      0.98       0.69       1.05       0.94 |      0.96 
-----------+--------------------------------------------+----------
     20645 |       181         34         27         35 |       277 
           |      0.91       1.24       0.98       1.22 |      0.98 
-----------+--------------------------------------------+----------
     20646 |       188         36         30         22 |       276 
           |      0.94       1.31       1.09       0.77 |      0.98 
-----------+--------------------------------------------+----------
     20647 |       191         28         23         21 |       263 
           |      0.96       1.02       0.84       0.73 |      0.93 
-----------+--------------------------------------------+----------
     20648 |       163         31         22         31 |       247 
           |      0.82       1.13       0.80       1.08 |      0.87 
-----------+--------------------------------------------+----------
     20649 |       179         37         28         30 |       274 
           |      0.90       1.34       1.02       1.05 |      0.97 
-----------+--------------------------------------------+----------
     20650 |       157         30         18         21 |       226 
           |      0.79       1.09       0.65       0.73 |      0.80 
-----------+--------------------------------------------+----------
     20651 |       174         34         23         21 |       252 
           |      0.87       1.24       0.84       0.73 |      0.89 
-----------+--------------------------------------------+----------
     20652 |       172         28         27         28 |       255 
           |      0.86       1.02       0.98       0.98 |      0.90 
-----------+--------------------------------------------+----------
     20653 |       167         24         28         26 |       245 
           |      0.84       0.87       1.02       0.91 |      0.87 
-----------+--------------------------------------------+----------
     20654 |       171         24         17         28 |       240 
           |      0.86       0.87       0.62       0.98 |      0.85 
-----------+--------------------------------------------+----------
     20655 |       171         21         17         18 |       227 
           |      0.86       0.76       0.62       0.63 |      0.80 
-----------+--------------------------------------------+----------
     20656 |       156         17         22         21 |       216 
           |      0.78       0.62       0.80       0.73 |      0.76 
-----------+--------------------------------------------+----------
     20657 |       156         12         32         26 |       226 
           |      0.78       0.44       1.16       0.91 |      0.80 
-----------+--------------------------------------------+----------
     20658 |       149         26         19         19 |       213 
           |      0.75       0.95       0.69       0.66 |      0.75 
-----------+--------------------------------------------+----------
     20659 |       135         20         24         21 |       200 
           |      0.68       0.73       0.87       0.73 |      0.71 
-----------+--------------------------------------------+----------
     20660 |       146         23         16         32 |       217 
           |      0.73       0.84       0.58       1.12 |      0.77 
-----------+--------------------------------------------+----------
     20661 |       128         21         17         23 |       189 
           |      0.64       0.76       0.62       0.80 |      0.67 
-----------+--------------------------------------------+----------
     20662 |       143         18         24         23 |       208 
           |      0.72       0.65       0.87       0.80 |      0.74 
-----------+--------------------------------------------+----------
     20663 |       121         17         18         18 |       174 
           |      0.61       0.62       0.65       0.63 |      0.62 
-----------+--------------------------------------------+----------
     20664 |       136         13         18         21 |       188 
           |      0.68       0.47       0.65       0.73 |      0.66 
-----------+--------------------------------------------+----------
     20665 |       139         16         20         25 |       200 
           |      0.70       0.58       0.73       0.87 |      0.71 
-----------+--------------------------------------------+----------
     20666 |       118         15         17         17 |       167 
           |      0.59       0.55       0.62       0.59 |      0.59 
-----------+--------------------------------------------+----------
     20667 |       127         13         21         19 |       180 
           |      0.64       0.47       0.76       0.66 |      0.64 
-----------+--------------------------------------------+----------
     20668 |       104         11         18         17 |       150 
           |      0.52       0.40       0.65       0.59 |      0.53 
-----------+--------------------------------------------+----------
     20669 |       115          9         13         12 |       149 
           |      0.58       0.33       0.47       0.42 |      0.53 
-----------+--------------------------------------------+----------
     20670 |       123         19         14         21 |       177 
           |      0.62       0.69       0.51       0.73 |      0.63 
-----------+--------------------------------------------+----------
     20671 |       105         20         17         19 |       161 
           |      0.53       0.73       0.62       0.66 |      0.57 
-----------+--------------------------------------------+----------
     20672 |       137         15         14         21 |       187 
           |      0.69       0.55       0.51       0.73 |      0.66 
-----------+--------------------------------------------+----------
     20673 |       126         14         11         11 |       162 
           |      0.63       0.51       0.40       0.38 |      0.57 
-----------+--------------------------------------------+----------
     20674 |       101         13         17         12 |       143 
           |      0.51       0.47       0.62       0.42 |      0.51 
-----------+--------------------------------------------+----------
     20675 |       102         19         21         12 |       154 
           |      0.51       0.69       0.76       0.42 |      0.54 
-----------+--------------------------------------------+----------
     20676 |       102         17         17         15 |       151 
           |      0.51       0.62       0.62       0.52 |      0.53 
-----------+--------------------------------------------+----------
     20677 |       100         21         10          7 |       138 
           |      0.50       0.76       0.36       0.24 |      0.49 
-----------+--------------------------------------------+----------
     20678 |        80          9         11         14 |       114 
           |      0.40       0.33       0.40       0.49 |      0.40 
-----------+--------------------------------------------+----------
     20679 |       113         11         11         14 |       149 
           |      0.57       0.40       0.40       0.49 |      0.53 
-----------+--------------------------------------------+----------
     20680 |        91         18         13         11 |       133 
           |      0.46       0.65       0.47       0.38 |      0.47 
-----------+--------------------------------------------+----------
     20681 |       107         17         10         12 |       146 
           |      0.54       0.62       0.36       0.42 |      0.52 
-----------+--------------------------------------------+----------
     20682 |       105          9         17         17 |       148 
           |      0.53       0.33       0.62       0.59 |      0.52 
-----------+--------------------------------------------+----------
     20683 |        79         16         17         13 |       125 
           |      0.40       0.58       0.62       0.45 |      0.44 
-----------+--------------------------------------------+----------
     20684 |        88          4         11         15 |       118 
           |      0.44       0.15       0.40       0.52 |      0.42 
-----------+--------------------------------------------+----------
     20685 |        91         11         10         12 |       124 
           |      0.46       0.40       0.36       0.42 |      0.44 
-----------+--------------------------------------------+----------
     20686 |        88          5         15         12 |       120 
           |      0.44       0.18       0.55       0.42 |      0.42 
-----------+--------------------------------------------+----------
     20687 |        82         14          8          9 |       113 
           |      0.41       0.51       0.29       0.31 |      0.40 
-----------+--------------------------------------------+----------
     20688 |       100          8         11         12 |       131 
           |      0.50       0.29       0.40       0.42 |      0.46 
-----------+--------------------------------------------+----------
     20689 |        79          8         10         10 |       107 
           |      0.40       0.29       0.36       0.35 |      0.38 
-----------+--------------------------------------------+----------
     20690 |        85         16         14         16 |       131 
           |      0.43       0.58       0.51       0.56 |      0.46 
-----------+--------------------------------------------+----------
     20691 |        80         12         11          9 |       112 
           |      0.40       0.44       0.40       0.31 |      0.40 
-----------+--------------------------------------------+----------
     20692 |        76         12         13          4 |       105 
           |      0.38       0.44       0.47       0.14 |      0.37 
-----------+--------------------------------------------+----------
     20693 |        81         11         11          5 |       108 
           |      0.41       0.40       0.40       0.17 |      0.38 
-----------+--------------------------------------------+----------
     20694 |        66         19          9         13 |       107 
           |      0.33       0.69       0.33       0.45 |      0.38 
-----------+--------------------------------------------+----------
     20695 |        75          9         13          6 |       103 
           |      0.38       0.33       0.47       0.21 |      0.36 
-----------+--------------------------------------------+----------
     20696 |        89         15          9         13 |       126 
           |      0.45       0.55       0.33       0.45 |      0.45 
-----------+--------------------------------------------+----------
     20697 |        70          7         10         17 |       104 
           |      0.35       0.25       0.36       0.59 |      0.37 
-----------+--------------------------------------------+----------
     20698 |        68          9          7          4 |        88 
           |      0.34       0.33       0.25       0.14 |      0.31 
-----------+--------------------------------------------+----------
     20699 |        78          8         10         14 |       110 
           |      0.39       0.29       0.36       0.49 |      0.39 
-----------+--------------------------------------------+----------
     20700 |        81          6         11         10 |       108 
           |      0.41       0.22       0.40       0.35 |      0.38 
-----------+--------------------------------------------+----------
     20701 |        71          5          7         12 |        95 
           |      0.36       0.18       0.25       0.42 |      0.34 
-----------+--------------------------------------------+----------
     20702 |        78          7          8         12 |       105 
           |      0.39       0.25       0.29       0.42 |      0.37 
-----------+--------------------------------------------+----------
     20703 |        69         14         10          7 |       100 
           |      0.35       0.51       0.36       0.24 |      0.35 
-----------+--------------------------------------------+----------
     20704 |        51         13          6          9 |        79 
           |      0.26       0.47       0.22       0.31 |      0.28 
-----------+--------------------------------------------+----------
     20705 |        65         15         11          7 |        98 
           |      0.33       0.55       0.40       0.24 |      0.35 
-----------+--------------------------------------------+----------
     20706 |        56          7          8          8 |        79 
           |      0.28       0.25       0.29       0.28 |      0.28 
-----------+--------------------------------------------+----------
     20707 |        66         12          2         11 |        91 
           |      0.33       0.44       0.07       0.38 |      0.32 
-----------+--------------------------------------------+----------
     20708 |        60         12          4          7 |        83 
           |      0.30       0.44       0.15       0.24 |      0.29 
-----------+--------------------------------------------+----------
     20709 |        59          6          7         10 |        82 
           |      0.30       0.22       0.25       0.35 |      0.29 
-----------+--------------------------------------------+----------
     20710 |        53          6          8         10 |        77 
           |      0.27       0.22       0.29       0.35 |      0.27 
-----------+--------------------------------------------+----------
     20711 |        49          4          5          6 |        64 
           |      0.25       0.15       0.18       0.21 |      0.23 
-----------+--------------------------------------------+----------
     20712 |        58          4          5          4 |        71 
           |      0.29       0.15       0.18       0.14 |      0.25 
-----------+--------------------------------------------+----------
     20713 |        66          5          8          4 |        83 
           |      0.33       0.18       0.29       0.14 |      0.29 
-----------+--------------------------------------------+----------
     20714 |        52          8          4          7 |        71 
           |      0.26       0.29       0.15       0.24 |      0.25 
-----------+--------------------------------------------+----------
     20715 |        45          8          3          5 |        61 
           |      0.23       0.29       0.11       0.17 |      0.22 
-----------+--------------------------------------------+----------
     20716 |        60          1          5          6 |        72 
           |      0.30       0.04       0.18       0.21 |      0.25 
-----------+--------------------------------------------+----------
     20717 |        53          6          7          9 |        75 
           |      0.27       0.22       0.25       0.31 |      0.27 
-----------+--------------------------------------------+----------
     20718 |        55          7          6          4 |        72 
           |      0.28       0.25       0.22       0.14 |      0.25 
-----------+--------------------------------------------+----------
     20719 |        54         12          6         11 |        83 
           |      0.27       0.44       0.22       0.38 |      0.29 
-----------+--------------------------------------------+----------
     20720 |        44          2          9         10 |        65 
           |      0.22       0.07       0.33       0.35 |      0.23 
-----------+--------------------------------------------+----------
     20721 |        40          6          8          4 |        58 
           |      0.20       0.22       0.29       0.14 |      0.21 
-----------+--------------------------------------------+----------
     20722 |        42          4          5          3 |        54 
           |      0.21       0.15       0.18       0.10 |      0.19 
-----------+--------------------------------------------+----------
     20723 |        41          3          7          9 |        60 
           |      0.21       0.11       0.25       0.31 |      0.21 
-----------+--------------------------------------------+----------
     20724 |        51          5          5          2 |        63 
           |      0.26       0.18       0.18       0.07 |      0.22 
-----------+--------------------------------------------+----------
     20725 |        35          6          7          7 |        55 
           |      0.18       0.22       0.25       0.24 |      0.19 
-----------+--------------------------------------------+----------
     20726 |        35         10          4         10 |        59 
           |      0.18       0.36       0.15       0.35 |      0.21 
-----------+--------------------------------------------+----------
     20727 |        35          6          6          1 |        48 
           |      0.18       0.22       0.22       0.03 |      0.17 
-----------+--------------------------------------------+----------
     20728 |        39          3          7          4 |        53 
           |      0.20       0.11       0.25       0.14 |      0.19 
-----------+--------------------------------------------+----------
     20729 |        33          2          3          7 |        45 
           |      0.17       0.07       0.11       0.24 |      0.16 
-----------+--------------------------------------------+----------
     20730 |        58          5          7          6 |        76 
           |      0.29       0.18       0.25       0.21 |      0.27 
-----------+--------------------------------------------+----------
     20731 |        45          7          4          6 |        62 
           |      0.23       0.25       0.15       0.21 |      0.22 
-----------+--------------------------------------------+----------
     20732 |        28          5          6         12 |        51 
           |      0.14       0.18       0.22       0.42 |      0.18 
-----------+--------------------------------------------+----------
     20733 |        41          8          5          3 |        57 
           |      0.21       0.29       0.18       0.10 |      0.20 
-----------+--------------------------------------------+----------
     20734 |        41          2          6          4 |        53 
           |      0.21       0.07       0.22       0.14 |      0.19 
-----------+--------------------------------------------+----------
     20735 |        44          2          9          9 |        64 
           |      0.22       0.07       0.33       0.31 |      0.23 
-----------+--------------------------------------------+----------
     20736 |        38          9          5          3 |        55 
           |      0.19       0.33       0.18       0.10 |      0.19 
-----------+--------------------------------------------+----------
     20737 |        34          1          3          5 |        43 
           |      0.17       0.04       0.11       0.17 |      0.15 
-----------+--------------------------------------------+----------
     20738 |        38          4          7          7 |        56 
           |      0.19       0.15       0.25       0.24 |      0.20 
-----------+--------------------------------------------+----------
     20739 |        31          2          2          3 |        38 
           |      0.16       0.07       0.07       0.10 |      0.13 
-----------+--------------------------------------------+----------
     20740 |        28          4          4          0 |        36 
           |      0.14       0.15       0.15       0.00 |      0.13 
-----------+--------------------------------------------+----------
     20741 |        32          6          4          4 |        46 
           |      0.16       0.22       0.15       0.14 |      0.16 
-----------+--------------------------------------------+----------
     20742 |        33          1          0          5 |        39 
           |      0.17       0.04       0.00       0.17 |      0.14 
-----------+--------------------------------------------+----------
     20743 |        32          2          8          4 |        46 
           |      0.16       0.07       0.29       0.14 |      0.16 
-----------+--------------------------------------------+----------
     20744 |        27          2          3          3 |        35 
           |      0.14       0.07       0.11       0.10 |      0.12 
-----------+--------------------------------------------+----------
     20745 |        29          1          4          2 |        36 
           |      0.15       0.04       0.15       0.07 |      0.13 
-----------+--------------------------------------------+----------
     20746 |        34          4          7          4 |        49 
           |      0.17       0.15       0.25       0.14 |      0.17 
-----------+--------------------------------------------+----------
     20747 |        31          4          1          3 |        39 
           |      0.16       0.15       0.04       0.10 |      0.14 
-----------+--------------------------------------------+----------
     20748 |        30          1          3          2 |        36 
           |      0.15       0.04       0.11       0.07 |      0.13 
-----------+--------------------------------------------+----------
     20749 |        25          3          4          5 |        37 
           |      0.13       0.11       0.15       0.17 |      0.13 
-----------+--------------------------------------------+----------
     20750 |        37          6          4          3 |        50 
           |      0.19       0.22       0.15       0.10 |      0.18 
-----------+--------------------------------------------+----------
     20751 |        34          4          1          1 |        40 
           |      0.17       0.15       0.04       0.03 |      0.14 
-----------+--------------------------------------------+----------
     20752 |        28          3          2          2 |        35 
           |      0.14       0.11       0.07       0.07 |      0.12 
-----------+--------------------------------------------+----------
     20753 |        33          2          2          3 |        40 
           |      0.17       0.07       0.07       0.10 |      0.14 
-----------+--------------------------------------------+----------
     20754 |        23          0          2          3 |        28 
           |      0.12       0.00       0.07       0.10 |      0.10 
-----------+--------------------------------------------+----------
     20755 |        28          5          2          2 |        37 
           |      0.14       0.18       0.07       0.07 |      0.13 
-----------+--------------------------------------------+----------
     20756 |        27          1          4          4 |        36 
           |      0.14       0.04       0.15       0.14 |      0.13 
-----------+--------------------------------------------+----------
     20757 |        27          2          1          4 |        34 
           |      0.14       0.07       0.04       0.14 |      0.12 
-----------+--------------------------------------------+----------
     20758 |        26          2          4          4 |        36 
           |      0.13       0.07       0.15       0.14 |      0.13 
-----------+--------------------------------------------+----------
     20759 |        27          1          2          3 |        33 
           |      0.14       0.04       0.07       0.10 |      0.12 
-----------+--------------------------------------------+----------
     20760 |        22          3          0          1 |        26 
           |      0.11       0.11       0.00       0.03 |      0.09 
-----------+--------------------------------------------+----------
     20761 |        23          3          2          0 |        28 
           |      0.12       0.11       0.07       0.00 |      0.10 
-----------+--------------------------------------------+----------
     20762 |        29          2          1          0 |        32 
           |      0.15       0.07       0.04       0.00 |      0.11 
-----------+--------------------------------------------+----------
     20763 |        21          0          1          3 |        25 
           |      0.11       0.00       0.04       0.10 |      0.09 
-----------+--------------------------------------------+----------
     20764 |        18          2          0          2 |        22 
           |      0.09       0.07       0.00       0.07 |      0.08 
-----------+--------------------------------------------+----------
     20765 |        17          2          1          1 |        21 
           |      0.09       0.07       0.04       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20766 |        23          1          2          1 |        27 
           |      0.12       0.04       0.07       0.03 |      0.10 
-----------+--------------------------------------------+----------
     20767 |        19          1          1          1 |        22 
           |      0.10       0.04       0.04       0.03 |      0.08 
-----------+--------------------------------------------+----------
     20768 |        18          3          0          0 |        21 
           |      0.09       0.11       0.00       0.00 |      0.07 
-----------+--------------------------------------------+----------
     20769 |        19          2          0          3 |        24 
           |      0.10       0.07       0.00       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20770 |        20          1          2          2 |        25 
           |      0.10       0.04       0.07       0.07 |      0.09 
-----------+--------------------------------------------+----------
     20771 |        17          1          4          2 |        24 
           |      0.09       0.04       0.15       0.07 |      0.08 
-----------+--------------------------------------------+----------
     20772 |        14          1          1          3 |        19 
           |      0.07       0.04       0.04       0.10 |      0.07 
-----------+--------------------------------------------+----------
     20773 |        28          5          0          1 |        34 
           |      0.14       0.18       0.00       0.03 |      0.12 
-----------+--------------------------------------------+----------
     20774 |        10          2          3          2 |        17 
           |      0.05       0.07       0.11       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20775 |        12          0          3          3 |        18 
           |      0.06       0.00       0.11       0.10 |      0.06 
-----------+--------------------------------------------+----------
     20776 |        13          6          4          1 |        24 
           |      0.07       0.22       0.15       0.03 |      0.08 
-----------+--------------------------------------------+----------
     20777 |        16          2          1          0 |        19 
           |      0.08       0.07       0.04       0.00 |      0.07 
-----------+--------------------------------------------+----------
     20778 |        20          1          1          3 |        25 
           |      0.10       0.04       0.04       0.10 |      0.09 
-----------+--------------------------------------------+----------
     20779 |        14          3          3          3 |        23 
           |      0.07       0.11       0.11       0.10 |      0.08 
-----------+--------------------------------------------+----------
     20780 |        16          2          0          1 |        19 
           |      0.08       0.07       0.00       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20781 |        11          0          2          2 |        15 
           |      0.06       0.00       0.07       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20782 |        13          0          0          5 |        18 
           |      0.07       0.00       0.00       0.17 |      0.06 
-----------+--------------------------------------------+----------
     20783 |        15          1          2          1 |        19 
           |      0.08       0.04       0.07       0.03 |      0.07 
-----------+--------------------------------------------+----------
     20784 |        17          2          2          4 |        25 
           |      0.09       0.07       0.07       0.14 |      0.09 
-----------+--------------------------------------------+----------
     20785 |        13          3          0          2 |        18 
           |      0.07       0.11       0.00       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20786 |        10          3          0          2 |        15 
           |      0.05       0.11       0.00       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20787 |        18          0          1          0 |        19 
           |      0.09       0.00       0.04       0.00 |      0.07 
-----------+--------------------------------------------+----------
     20788 |        20          1          2          1 |        24 
           |      0.10       0.04       0.07       0.03 |      0.08 
-----------+--------------------------------------------+----------
     20789 |        14          1          0          1 |        16 
           |      0.07       0.04       0.00       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20790 |        10          0          1          3 |        14 
           |      0.05       0.00       0.04       0.10 |      0.05 
-----------+--------------------------------------------+----------
     20791 |        11          2          0          0 |        13 
           |      0.06       0.07       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20792 |        12          1          1          0 |        14 
           |      0.06       0.04       0.04       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20793 |         8          1          2          1 |        12 
           |      0.04       0.04       0.07       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20794 |        10          1          1          0 |        12 
           |      0.05       0.04       0.04       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20795 |         8          0          0          0 |         8 
           |      0.04       0.00       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20796 |        13          2          1          1 |        17 
           |      0.07       0.07       0.04       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20797 |        11          2          1          0 |        14 
           |      0.06       0.07       0.04       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20798 |        12          0          4          1 |        17 
           |      0.06       0.00       0.15       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20799 |        11          1          1          0 |        13 
           |      0.06       0.04       0.04       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20800 |        10          1          0          1 |        12 
           |      0.05       0.04       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20801 |        10          0          2          2 |        14 
           |      0.05       0.00       0.07       0.07 |      0.05 
-----------+--------------------------------------------+----------
     20802 |        16          0          1          1 |        18 
           |      0.08       0.00       0.04       0.03 |      0.06 
-----------+--------------------------------------------+----------
     20803 |        11          1          0          1 |        13 
           |      0.06       0.04       0.00       0.03 |      0.05 
-----------+--------------------------------------------+----------
     20804 |         8          3          0          0 |        11 
           |      0.04       0.11       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20805 |         8          0          1          0 |         9 
           |      0.04       0.00       0.04       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20806 |         5          0          1          1 |         7 
           |      0.03       0.00       0.04       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20807 |         8          0          0          2 |        10 
           |      0.04       0.00       0.00       0.07 |      0.04 
-----------+--------------------------------------------+----------
     20808 |        14          1          0          3 |        18 
           |      0.07       0.04       0.00       0.10 |      0.06 
-----------+--------------------------------------------+----------
     20809 |        13          0          1          2 |        16 
           |      0.07       0.00       0.04       0.07 |      0.06 
-----------+--------------------------------------------+----------
     20810 |         8          2          0          1 |        11 
           |      0.04       0.07       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20811 |        10          0          0          0 |        10 
           |      0.05       0.00       0.00       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20812 |        10          0          0          1 |        11 
           |      0.05       0.00       0.00       0.03 |      0.04 
-----------+--------------------------------------------+----------
     20813 |         5          0          1          1 |         7 
           |      0.03       0.00       0.04       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20814 |         5          2          3          0 |        10 
           |      0.03       0.07       0.11       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20815 |         6          0          1          0 |         7 
           |      0.03       0.00       0.04       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20816 |         7          1          0          0 |         8 
           |      0.04       0.04       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20817 |         7          0          1          0 |         8 
           |      0.04       0.00       0.04       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20818 |        13          1          1          0 |        15 
           |      0.07       0.04       0.04       0.00 |      0.05 
-----------+--------------------------------------------+----------
     20819 |         7          2          0          0 |         9 
           |      0.04       0.07       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20820 |         6          0          0          0 |         6 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20821 |         7          1          4          0 |        12 
           |      0.04       0.04       0.15       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20822 |         8          1          1          0 |        10 
           |      0.04       0.04       0.04       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20823 |         5          0          0          2 |         7 
           |      0.03       0.00       0.00       0.07 |      0.02 
-----------+--------------------------------------------+----------
     20824 |         5          0          1          2 |         8 
           |      0.03       0.00       0.04       0.07 |      0.03 
-----------+--------------------------------------------+----------
     20825 |         9          1          1          0 |        11 
           |      0.05       0.04       0.04       0.00 |      0.04 
-----------+--------------------------------------------+----------
     20826 |         8          0          2          2 |        12 
           |      0.04       0.00       0.07       0.07 |      0.04 
-----------+--------------------------------------------+----------
     20827 |         4          0          1          0 |         5 
           |      0.02       0.00       0.04       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20828 |         6          1          1          0 |         8 
           |      0.03       0.04       0.04       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20829 |         5          2          0          0 |         7 
           |      0.03       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20830 |         3          1          0          0 |         4 
           |      0.02       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20831 |         5          0          0          0 |         5 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20832 |         7          1          0          0 |         8 
           |      0.04       0.04       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20833 |         7          0          0          2 |         9 
           |      0.04       0.00       0.00       0.07 |      0.03 
-----------+--------------------------------------------+----------
     20834 |         1          0          2          0 |         3 
           |      0.01       0.00       0.07       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20835 |         8          1          0          0 |         9 
           |      0.04       0.04       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20836 |         2          2          0          0 |         4 
           |      0.01       0.07       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20837 |         4          2          0          0 |         6 
           |      0.02       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20838 |         4          2          0          0 |         6 
           |      0.02       0.07       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20839 |         4          1          0          1 |         6 
           |      0.02       0.04       0.00       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20840 |         2          2          0          0 |         4 
           |      0.01       0.07       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20841 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20842 |         3          1          0          0 |         4 
           |      0.02       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20843 |         0          1          1          1 |         3 
           |      0.00       0.04       0.04       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20844 |        11          1          0          1 |        13 
           |      0.06       0.04       0.00       0.03 |      0.05 
-----------+--------------------------------------------+----------
     20845 |         2          0          1          0 |         3 
           |      0.01       0.00       0.04       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20846 |         7          0          0          1 |         8 
           |      0.04       0.00       0.00       0.03 |      0.03 
-----------+--------------------------------------------+----------
     20847 |         3          0          0          2 |         5 
           |      0.02       0.00       0.00       0.07 |      0.02 
-----------+--------------------------------------------+----------
     20848 |         3          1          0          0 |         4 
           |      0.02       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20849 |         5          0          0          0 |         5 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20850 |         5          0          1          1 |         7 
           |      0.03       0.00       0.04       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20851 |         2          1          0          1 |         4 
           |      0.01       0.04       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20852 |         4          0          0          1 |         5 
           |      0.02       0.00       0.00       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20853 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20854 |         5          0          0          1 |         6 
           |      0.03       0.00       0.00       0.03 |      0.02 
-----------+--------------------------------------------+----------
     20855 |         4          0          1          0 |         5 
           |      0.02       0.00       0.04       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20856 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20857 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20858 |         5          0          0          0 |         5 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20859 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20860 |         2          1          0          0 |         3 
           |      0.01       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20861 |         3          0          0          1 |         4 
           |      0.02       0.00       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20862 |         5          0          0          0 |         5 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20863 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20864 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20865 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20866 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20867 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20868 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20869 |         3          0          2          0 |         5 
           |      0.02       0.00       0.07       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20870 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20871 |         6          0          0          0 |         6 
           |      0.03       0.00       0.00       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20872 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20874 |         1          0          1          0 |         2 
           |      0.01       0.00       0.04       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20875 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20876 |         6          0          1          0 |         7 
           |      0.03       0.00       0.04       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20877 |         5          3          0          0 |         8 
           |      0.03       0.11       0.00       0.00 |      0.03 
-----------+--------------------------------------------+----------
     20878 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20879 |         3          0          1          0 |         4 
           |      0.02       0.00       0.04       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20880 |         1          1          0          0 |         2 
           |      0.01       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20881 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20882 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20883 |         1          1          0          0 |         2 
           |      0.01       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20884 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20885 |         2          1          2          0 |         5 
           |      0.01       0.04       0.07       0.00 |      0.02 
-----------+--------------------------------------------+----------
     20886 |         4          0          0          0 |         4 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20887 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20888 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20890 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20891 |         2          0          0          1 |         3 
           |      0.01       0.00       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20892 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20893 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20895 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20896 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20897 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20898 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20899 |         0          1          0          0 |         1 
           |      0.00       0.04       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20901 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20902 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20903 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20904 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20905 |         2          0          0          1 |         3 
           |      0.01       0.00       0.00       0.03 |      0.01 
-----------+--------------------------------------------+----------
     20906 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20907 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20909 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20911 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20913 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20914 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20915 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20916 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20917 |         1          1          0          0 |         2 
           |      0.01       0.04       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20918 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20919 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20920 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20921 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20923 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20924 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20925 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20926 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20930 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20933 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20934 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20935 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20936 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20937 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20938 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20939 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20940 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20942 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20944 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20945 |         0          1          0          0 |         1 
           |      0.00       0.04       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20949 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20950 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20953 |         3          0          0          0 |         3 
           |      0.02       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20954 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20959 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20960 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20961 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20962 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20965 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20967 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     20972 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20975 |         0          0          1          0 |         1 
           |      0.00       0.00       0.04       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20980 |         0          0          0          1 |         1 
           |      0.00       0.00       0.00       0.03 |      0.00 
-----------+--------------------------------------------+----------
     20981 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20982 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     20988 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21005 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21011 |         0          0          1          0 |         1 
           |      0.00       0.00       0.04       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21023 |         0          1          0          0 |         1 
           |      0.00       0.04       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21024 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21031 |         2          0          0          0 |         2 
           |      0.01       0.00       0.00       0.00 |      0.01 
-----------+--------------------------------------------+----------
     21064 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     21097 |         1          0          0          0 |         1 
           |      0.01       0.00       0.00       0.00 |      0.00 
-----------+--------------------------------------------+----------
     Total |    19,906      2,751      2,749      2,865 |    28,271 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
     20608 |       123         26         19         30 |       198 
     20609 |       348         50         58         65 |       521 
     20610 |       336         51         52         42 |       481 
     20611 |       316         43         42         54 |       455 
     20612 |       360         52         48         56 |       516 
     20613 |       347         43         48         56 |       494 
     20614 |       335         50         47         47 |       479 
     20615 |       309         49         55         59 |       472 
     20616 |       341         47         49         53 |       490 
     20617 |       325         40         43         38 |       446 
     20618 |       293         25         45         47 |       410 
     20619 |       282         45         58         46 |       431 
     20620 |       291         48         49         56 |       444 
     20621 |       288         39         41         42 |       410 
     20622 |       287         44         56         33 |       420 
     20623 |       230         46         43         38 |       357 
     20624 |       263         31         46         49 |       389 
     20625 |       284         44         42         39 |       409 
     20626 |       214         48         38         43 |       343 
     20627 |       244         29         51         50 |       374 
     20628 |       267         33         31         35 |       366 
     20629 |       257         37         27         34 |       355 
     20630 |       247         31         35         37 |       350 
     20631 |       244         40         36         31 |       351 
     20632 |       223         25         40         50 |       338 
     20633 |       240         33         24         41 |       338 
     20634 |       244         36         26         24 |       330 
     20635 |       218         36         34         30 |       318 
     20636 |       205         29         33         36 |       303 
     20637 |       242         32         28         26 |       328 
     20638 |       245         34         24         29 |       332 
     20639 |       187         42         32         28 |       289 
     20640 |       197         23         27         21 |       268 
     20641 |       208         21         30         32 |       291 
     20642 |       183         35         23         32 |       273 
     20643 |       197         35         31         30 |       293 
     20644 |       196         19         29         27 |       271 
     20645 |       181         34         27         35 |       277 
     20646 |       188         36         30         22 |       276 
     20647 |       191         28         23         21 |       263 
     20648 |       163         31         22         31 |       247 
     20649 |       179         37         28         30 |       274 
     20650 |       157         30         18         21 |       226 
     20651 |       174         34         23         21 |       252 
     20652 |       172         28         27         28 |       255 
     20653 |       167         24         28         26 |       245 
     20654 |       171         24         17         28 |       240 
     20655 |       171         21         17         18 |       227 
     20656 |       156         17         22         21 |       216 
     20657 |       156         12         32         26 |       226 
     20658 |       149         26         19         19 |       213 
     20659 |       135         20         24         21 |       200 
     20660 |       146         23         16         32 |       217 
     20661 |       128         21         17         23 |       189 
     20662 |       143         18         24         23 |       208 
     20663 |       121         17         18         18 |       174 
     20664 |       136         13         18         21 |       188 
     20665 |       139         16         20         25 |       200 
     20666 |       118         15         17         17 |       167 
     20667 |       127         13         21         19 |       180 
     20668 |       104         11         18         17 |       150 
     20669 |       115          9         13         12 |       149 
     20670 |       123         19         14         21 |       177 
     20671 |       105         20         17         19 |       161 
     20672 |       137         15         14         21 |       187 
     20673 |       126         14         11         11 |       162 
     20674 |       101         13         17         12 |       143 
     20675 |       102         19         21         12 |       154 
     20676 |       102         17         17         15 |       151 
     20677 |       100         21         10          7 |       138 
     20678 |        80          9         11         14 |       114 
     20679 |       113         11         11         14 |       149 
     20680 |        91         18         13         11 |       133 
     20681 |       107         17         10         12 |       146 
     20682 |       105          9         17         17 |       148 
     20683 |        79         16         17         13 |       125 
     20684 |        88          4         11         15 |       118 
     20685 |        91         11         10         12 |       124 
     20686 |        88          5         15         12 |       120 
     20687 |        82         14          8          9 |       113 
     20688 |       100          8         11         12 |       131 
     20689 |        79          8         10         10 |       107 
     20690 |        85         16         14         16 |       131 
     20691 |        80         12         11          9 |       112 
     20692 |        76         12         13          4 |       105 
     20693 |        81         11         11          5 |       108 
     20694 |        66         19          9         13 |       107 
     20695 |        75          9         13          6 |       103 
     20696 |        89         15          9         13 |       126 
     20697 |        70          7         10         17 |       104 
     20698 |        68          9          7          4 |        88 
     20699 |        78          8         10         14 |       110 
     20700 |        81          6         11         10 |       108 
     20701 |        71          5          7         12 |        95 
     20702 |        78          7          8         12 |       105 
     20703 |        69         14         10          7 |       100 
     20704 |        51         13          6          9 |        79 
     20705 |        65         15         11          7 |        98 
     20706 |        56          7          8          8 |        79 
     20707 |        66         12          2         11 |        91 
     20708 |        60         12          4          7 |        83 
     20709 |        59          6          7         10 |        82 
     20710 |        53          6          8         10 |        77 
     20711 |        49          4          5          6 |        64 
     20712 |        58          4          5          4 |        71 
     20713 |        66          5          8          4 |        83 
     20714 |        52          8          4          7 |        71 
     20715 |        45          8          3          5 |        61 
     20716 |        60          1          5          6 |        72 
     20717 |        53          6          7          9 |        75 
     20718 |        55          7          6          4 |        72 
     20719 |        54         12          6         11 |        83 
     20720 |        44          2          9         10 |        65 
     20721 |        40          6          8          4 |        58 
     20722 |        42          4          5          3 |        54 
     20723 |        41          3          7          9 |        60 
     20724 |        51          5          5          2 |        63 
     20725 |        35          6          7          7 |        55 
     20726 |        35         10          4         10 |        59 
     20727 |        35          6          6          1 |        48 
     20728 |        39          3          7          4 |        53 
     20729 |        33          2          3          7 |        45 
     20730 |        58          5          7          6 |        76 
     20731 |        45          7          4          6 |        62 
     20732 |        28          5          6         12 |        51 
     20733 |        41          8          5          3 |        57 
     20734 |        41          2          6          4 |        53 
     20735 |        44          2          9          9 |        64 
     20736 |        38          9          5          3 |        55 
     20737 |        34          1          3          5 |        43 
     20738 |        38          4          7          7 |        56 
     20739 |        31          2          2          3 |        38 
     20740 |        28          4          4          0 |        36 
     20741 |        32          6          4          4 |        46 
     20742 |        33          1          0          5 |        39 
     20743 |        32          2          8          4 |        46 
     20744 |        27          2          3          3 |        35 
     20745 |        29          1          4          2 |        36 
     20746 |        34          4          7          4 |        49 
     20747 |        31          4          1          3 |        39 
     20748 |        30          1          3          2 |        36 
     20749 |        25          3          4          5 |        37 
     20750 |        37          6          4          3 |        50 
     20751 |        34          4          1          1 |        40 
     20752 |        28          3          2          2 |        35 
     20753 |        33          2          2          3 |        40 
     20754 |        23          0          2          3 |        28 
     20755 |        28          5          2          2 |        37 
     20756 |        27          1          4          4 |        36 
     20757 |        27          2          1          4 |        34 
     20758 |        26          2          4          4 |        36 
     20759 |        27          1          2          3 |        33 
     20760 |        22          3          0          1 |        26 
     20761 |        23          3          2          0 |        28 
     20762 |        29          2          1          0 |        32 
     20763 |        21          0          1          3 |        25 
     20764 |        18          2          0          2 |        22 
     20765 |        17          2          1          1 |        21 
     20766 |        23          1          2          1 |        27 
     20767 |        19          1          1          1 |        22 
     20768 |        18          3          0          0 |        21 
     20769 |        19          2          0          3 |        24 
     20770 |        20          1          2          2 |        25 
     20771 |        17          1          4          2 |        24 
     20772 |        14          1          1          3 |        19 
     20773 |        28          5          0          1 |        34 
     20774 |        10          2          3          2 |        17 
     20775 |        12          0          3          3 |        18 
     20776 |        13          6          4          1 |        24 
     20777 |        16          2          1          0 |        19 
     20778 |        20          1          1          3 |        25 
     20779 |        14          3          3          3 |        23 
     20780 |        16          2          0          1 |        19 
     20781 |        11          0          2          2 |        15 
     20782 |        13          0          0          5 |        18 
     20783 |        15          1          2          1 |        19 
     20784 |        17          2          2          4 |        25 
     20785 |        13          3          0          2 |        18 
     20786 |        10          3          0          2 |        15 
     20787 |        18          0          1          0 |        19 
     20788 |        20          1          2          1 |        24 
     20789 |        14          1          0          1 |        16 
     20790 |        10          0          1          3 |        14 
     20791 |        11          2          0          0 |        13 
     20792 |        12          1          1          0 |        14 
     20793 |         8          1          2          1 |        12 
     20794 |        10          1          1          0 |        12 
     20795 |         8          0          0          0 |         8 
     20796 |        13          2          1          1 |        17 
     20797 |        11          2          1          0 |        14 
     20798 |        12          0          4          1 |        17 
     20799 |        11          1          1          0 |        13 
     20800 |        10          1          0          1 |        12 
     20801 |        10          0          2          2 |        14 
     20802 |        16          0          1          1 |        18 
     20803 |        11          1          0          1 |        13 
     20804 |         8          3          0          0 |        11 
     20805 |         8          0          1          0 |         9 
     20806 |         5          0          1          1 |         7 
     20807 |         8          0          0          2 |        10 
     20808 |        14          1          0          3 |        18 
     20809 |        13          0          1          2 |        16 
     20810 |         8          2          0          1 |        11 
     20811 |        10          0          0          0 |        10 
     20812 |        10          0          0          1 |        11 
     20813 |         5          0          1          1 |         7 
     20814 |         5          2          3          0 |        10 
     20815 |         6          0          1          0 |         7 
     20816 |         7          1          0          0 |         8 
     20817 |         7          0          1          0 |         8 
     20818 |        13          1          1          0 |        15 
     20819 |         7          2          0          0 |         9 
     20820 |         6          0          0          0 |         6 
     20821 |         7          1          4          0 |        12 
     20822 |         8          1          1          0 |        10 
     20823 |         5          0          0          2 |         7 
     20824 |         5          0          1          2 |         8 
     20825 |         9          1          1          0 |        11 
     20826 |         8          0          2          2 |        12 
     20827 |         4          0          1          0 |         5 
     20828 |         6          1          1          0 |         8 
     20829 |         5          2          0          0 |         7 
     20830 |         3          1          0          0 |         4 
     20831 |         5          0          0          0 |         5 
     20832 |         7          1          0          0 |         8 
     20833 |         7          0          0          2 |         9 
     20834 |         1          0          2          0 |         3 
     20835 |         8          1          0          0 |         9 
     20836 |         2          2          0          0 |         4 
     20837 |         4          2          0          0 |         6 
     20838 |         4          2          0          0 |         6 
     20839 |         4          1          0          1 |         6 
     20840 |         2          2          0          0 |         4 
     20841 |         3          0          0          0 |         3 
     20842 |         3          1          0          0 |         4 
     20843 |         0          1          1          1 |         3 
     20844 |        11          1          0          1 |        13 
     20845 |         2          0          1          0 |         3 
     20846 |         7          0          0          1 |         8 
     20847 |         3          0          0          2 |         5 
     20848 |         3          1          0          0 |         4 
     20849 |         5          0          0          0 |         5 
     20850 |         5          0          1          1 |         7 
     20851 |         2          1          0          1 |         4 
     20852 |         4          0          0          1 |         5 
     20853 |         4          0          0          0 |         4 
     20854 |         5          0          0          1 |         6 
     20855 |         4          0          1          0 |         5 
     20856 |         4          0          0          0 |         4 
     20857 |         4          0          0          0 |         4 
     20858 |         5          0          0          0 |         5 
     20859 |         2          0          0          0 |         2 
     20860 |         2          1          0          0 |         3 
     20861 |         3          0          0          1 |         4 
     20862 |         5          0          0          0 |         5 
     20863 |         2          0          0          0 |         2 
     20864 |         3          0          0          0 |         3 
     20865 |         1          0          0          0 |         1 
     20866 |         1          0          0          0 |         1 
     20867 |         2          0          0          0 |         2 
     20868 |         4          0          0          0 |         4 
     20869 |         3          0          2          0 |         5 
     20870 |         2          0          0          0 |         2 
     20871 |         6          0          0          0 |         6 
     20872 |         1          0          0          0 |         1 
     20874 |         1          0          1          0 |         2 
     20875 |         2          0          0          0 |         2 
     20876 |         6          0          1          0 |         7 
     20877 |         5          3          0          0 |         8 
     20878 |         3          0          0          0 |         3 
     20879 |         3          0          1          0 |         4 
     20880 |         1          1          0          0 |         2 
     20881 |         4          0          0          0 |         4 
     20882 |         1          0          0          0 |         1 
     20883 |         1          1          0          0 |         2 
     20884 |         1          0          0          0 |         1 
     20885 |         2          1          2          0 |         5 
     20886 |         4          0          0          0 |         4 
     20887 |         2          0          0          0 |         2 
     20888 |         2          0          0          0 |         2 
     20890 |         1          0          0          0 |         1 
     20891 |         2          0          0          1 |         3 
     20892 |         3          0          0          0 |         3 
     20893 |         1          0          0          0 |         1 
     20895 |         2          0          0          0 |         2 
     20896 |         3          0          0          0 |         3 
     20897 |         2          0          0          0 |         2 
     20898 |         2          0          0          0 |         2 
     20899 |         0          1          0          0 |         1 
     20901 |         2          0          0          0 |         2 
     20902 |         1          0          0          0 |         1 
     20903 |         0          0          0          1 |         1 
     20904 |         0          0          0          1 |         1 
     20905 |         2          0          0          1 |         3 
     20906 |         1          0          0          0 |         1 
     20907 |         3          0          0          0 |         3 
     20909 |         1          0          0          0 |         1 
     20911 |         1          0          0          0 |         1 
     20913 |         1          0          0          0 |         1 
     20914 |         2          0          0          0 |         2 
     20915 |         1          0          0          0 |         1 
     20916 |         0          0          0          1 |         1 
     20917 |         1          1          0          0 |         2 
     20918 |         3          0          0          0 |         3 
     20919 |         1          0          0          0 |         1 
     20920 |         1          0          0          0 |         1 
     20921 |         1          0          0          0 |         1 
     20923 |         1          0          0          0 |         1 
     20924 |         1          0          0          0 |         1 
     20925 |         2          0          0          0 |         2 
     20926 |         2          0          0          0 |         2 
     20930 |         2          0          0          0 |         2 
     20933 |         2          0          0          0 |         2 
     20934 |         1          0          0          0 |         1 
     20935 |         1          0          0          0 |         1 
     20936 |         2          0          0          0 |         2 
     20937 |         3          0          0          0 |         3 
     20938 |         2          0          0          0 |         2 
     20939 |         1          0          0          0 |         1 
     20940 |         1          0          0          0 |         1 
     20942 |         0          0          0          1 |         1 
     20944 |         1          0          0          0 |         1 
     20945 |         0          1          0          0 |         1 
     20949 |         1          0          0          0 |         1 
     20950 |         1          0          0          0 |         1 
     20953 |         3          0          0          0 |         3 
     20954 |         1          0          0          0 |         1 
     20959 |         1          0          0          0 |         1 
     20960 |         1          0          0          0 |         1 
     20961 |         2          0          0          0 |         2 
     20962 |         2          0          0          0 |         2 
     20965 |         1          0          0          0 |         1 
     20967 |         2          0          0          0 |         2 
     20972 |         1          0          0          0 |         1 
     20975 |         0          0          1          0 |         1 
     20980 |         0          0          0          1 |         1 
     20981 |         1          0          0          0 |         1 
     20982 |         1          0          0          0 |         1 
     20988 |         1          0          0          0 |         1 
     21005 |         1          0          0          0 |         1 
     21011 |         0          0          1          0 |         1 
     21023 |         0          1          0          0 |         1 
     21024 |         1          0          0          0 |         1 
     21031 |         2          0          0          0 |         2 
     21064 |         1          0          0          0 |         1 
     21097 |         1          0          0          0 |         1 
-----------+--------------------------------------------+----------
     Total |    19,906      2,751      2,749      2,865 |    28,271 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |     1,053        219        238        195 |     1,705 
           |      5.02       7.37       7.97       6.37 |      5.69 
-----------+--------------------------------------------+----------
         1 |    19,906      2,751      2,749      2,865 |    28,271 
           |     94.98      92.63      92.03      93.63 |     94.31 
-----------+--------------------------------------------+----------
     Total |    20,959      2,970      2,987      3,060 |    29,976 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid,molnupiravir)&d
> rug==1,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,molnupiravir)
> &drug==2,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid)&dru
> g==3,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab,paxlovid,moln
> upiravir)&drug==0,m col
no observations

. 
. /****************************
> *       COMPARATOR RATE         *
> ****************************
> *generate rate for adverse outcome in year 3-4 prior to start date for compar
> ative rate by person years 
> * 1. Need to ensure no established diagnosis for some of the condition 4 year
>  prior [ ie: gen NEW_pre]
> * 2. Need to define start and end date
> * 3. Gen rate of failure:       gen fail_`x' if `x'=!. &`x'<end_date
> * 4. Failures over 1 years - convert into 29 day rate
> 
> global pre_ae                    pre_diverticulitis_icd  pre_diverticulitis_s
> nomed pre_diverticulitis_ae pre_divertic_all pre_diarrhoea_snomed pre_taste_s
> nomed ///
>                                                  pre_taste_icd pre_rash_snome
> d pre_anaphylaxis_icd      pre_anaphylaxis_snomed  pre_anaphlaxis_ae pre_anap
> hylaxis_all pre_drugreact_ae  ///
>                                                  pre_allergic_ae pre_rheumato
> id_arthritis_ae pre_rheumatoid_arthritis_snomed pre_rheumatoid_arthritis_icd 
> ///           
>                                                  pre_ankylosing_spondylitis_c
> tv pre_ankylosing_spondylitis_ae pre_psoriasis_snomed pre_psoriasis_ae ///
>                                                  pre_psoriatic_arthritis_ae p
> re_psoriatic_arthritis_snomed pre_sle_ctv pre_sle_icd pre_sle_ae pre_ibd_snom
> ed    
> 
> */
. 
. save "$projectdir/output/data/main.dta", replace
file C:\Users\k1635179\OneDrive - King's College
    London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/data/main.dta
    saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafel
> y\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/clea
> ning_dataset.log
  log type:  text
 closed on:   6 Jun 2023, 22:21:30
-------------------------------------------------------------------------------
