-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/cox_model.log
  log type:  text
 opened on:  13 Dec 2023, 17:30:12

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. 
. use "$projectdir/output/data/sensitivity_analysis.dta", clear

. 
. 
. * Models
. global crude    i.drug 

. global agesex   i.drug age i.sex

. global adj              i.drug age i.sex i.region_nhs i.imdq5 White 1b.bmi_group ///
>                                 paxlovid_contraindicated i.vaccination_status diabetes chronic_cardiac_disease chronic_respiratory_disease hypertension ///
>                             downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosuppression hiv_aids organ_transplant rare_neuro  

. global adj2     i.drug age i.sex i.region_nhs i.imdq5 White 1b.bmi_group 

. global adj3     i.drug age i.sex i.region_nhs i.imdq5 White 1b.bmi_group ///
>                                 paxlovid_contraindicated i.vaccination_status diabetes chronic_cardiac_disease chronic_respiratory_disease hypertension 

. global adj4             paxlovid_contraindicated i.vaccination_status diabetes chronic_cardiac_disease chronic_respiratory_disease hypertension ///
>                             downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosuppression hiv_aids organ_transplant rare_neuro ///
>                                 dementia care_home serious_mental_illness

. 
. * Outcome
. global ae_disease                       ae_diverticulitis                               ///
>                                                         ae_diarrhoea                                    ///
>                                                         ae_taste                                                ///
>                                                         ae_rash                                                 ///
>                                                         ae_bronchospasm                                 ///
>                                                         ae_contactderm                                  ///
>                                                         ae_dizziness                                    ///
>                                                         ae_nausea_vomit                                 ///
>                                                         ae_headache                                             ///
>                                                         ae_anaphylaxis                                  ///
>                                                         ae_drugreaction                                 ///
>                                                         ae_ra                                                   ///
>                                                         ae_sle                                                  ///
>                                                         ae_psorasis                                     ///
>                                                         ae_psa                                                  ///
>                                                         ae_axspa                                                ///
>                                                         ae_ibd                                          

. global ae_disease_serious       ae_diverticulitis_serious               ///
>                                                         ae_diarrhoea_serious                    ///
>                                                         ae_taste_serious                                ///
>                                                         ae_rash_serious                                 ///
>                                                         ae_contactderm_serious                  ///
>                                                         ae_dizziness_serious                    ///
>                                                         ae_nausea_vomit_serious                 ///
>                                                         ae_headache_serious                             ///
>                                                         ae_anaphylaxis_serious                  ///
>                                                         ae_drugreaction_serious                 ///
>                                                         ae_ra_serious                                   ///
>                                                         ae_sle_serious                                  ///
>                                                         ae_psorasis_serious                     ///
>                                                         ae_psa_serious                                  ///
>                                                         ae_axspa_serious                                ///
>                                                         ae_ibd_serious  

. global ae_combined                      ae_all                                                  ///
>                                                         ae_all_serious                                  ///
>                                                         ae_spc_all                                              ///
>                                                         ae_spc_serious                                  ///
>                                                         ae_drug_all                                             ///
>                                                         ae_drug_serious                                 ///
>                                                         ae_imae_all                                             ///     
>                                                         ae_imae_serious 

. 
. ***************************************************************************************************************************************************************
. ** MAIN ANALYSIS 1 = Treatment group start date = treat date. 
. *                                        Control group start date = delayed by median time between test and treat in treat group          *
. 
. use "$projectdir/output/data/sensitivity_analysis.dta", clear

. tab pre_drug_test drug

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
               0 days |         0         15         16         26 |        57 
               1 days |         0         11         13         17 |        41 
               2 days |         0         23         14         12 |        49 
               3 days |         0         14         17         17 |        48 
               4 days |         0         12          9         13 |        34 
               5 days |         0         11         12         13 |        36 
             6-7 days |         0         19         11         16 |        46 
   >7 days & <21 days |         0        213        217        222 |       652 
treatment >21 day or  |    26,554      9,899      9,902      9,807 |    56,162 
no test date / no tre |         0      1,147      1,107      1,106 |     3,360 
----------------------+--------------------------------------------+----------
                Total |    26,554     11,364     11,318     11,249 |    60,485 

. drop if  covid_test_5d!=1 & drug >0
(33,666 observations deleted)

. tab pre_drug_test drug

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
               0 days |         0         15         16         26 |        57 
               1 days |         0         11         13         17 |        41 
               2 days |         0         23         14         12 |        49 
               3 days |         0         14         17         17 |        48 
               4 days |         0         12          9         13 |        34 
               5 days |         0         11         12         13 |        36 
treatment >21 day or  |    26,554          0          0          0 |    26,554 
----------------------+--------------------------------------------+----------
                Total |    26,554         86         81         98 |    26,819 

. tab drug paxlovid_contraindicated

             | paxlovid_contraindica
             |          ted
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    11,086     15,468 |    26,554 
  sotrovimab |        49         37 |        86 
    paxlovid |        40         41 |        81 
molnupiravir |        39         59 |        98 
-------------+----------------------+----------
       Total |    11,214     15,605 |    26,819 

. 
. ** Start day for treatment group is date treated & start date for control group is date test + 2 days
. count if start_date!=covid_test_positive_date & drug==0
  26,512

. count if start_date!=date_treated & drug>0
  0

. tab median_delay_all

median_dela |
      y_all |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |     26,819      100.00      100.00
------------+-----------------------------------
      Total |     26,819      100.00

. gen start_date_delay = start_date + median_delay_all if drug==0
(2,889 missing values generated)

. replace start_date_delay = start_date if drug>0
(265 real changes made)

. 
. *** Graphs - Schoenfeld Residual & log-log plot
. foreach fail in $ae_combined {
  2.         stset stop_`fail', id(patient_id) origin(time start_date_delay) enter(time start_date_delay) failure(fail_`fail'==1) 
  3.                         stcox i.drug 
  4.                         estat phtest,de
  5.                         estat phtest, plot(1.drug) ytitle("Scaled Schoenfeld Residual, Sotrovimab", size(small)) name(schoenfeld_sot_`fail', replace)
  6.                         estat phtest, plot(2.drug) ytitle("Scaled Schoenfeld Residual, Paxlovid",size(small)) name(schoenfeld_pax_`fail', replace)
  7.                         estat phtest, plot(3.drug) ytitle("Scaled Schoenfeld Residual, Molnupiravir",size(small)) name(schoenfeld_mol_`fail', replace)
  8.                         graph combine schoenfeld_sot_`fail' schoenfeld_pax_`fail' schoenfeld_mol_`fail', title("Schoenfeld Residual `fail'") saving("$projectdir/output/
> figures/schoenfeld_`fail'", replace)
  9.                         graph export "$projectdir/output/figures/schoenfeld_`fail'.svg", as(svg) replace
 10.                         stphplot, by(drug) legend(order(1 "Control" 2 "Sotrovimab" 3 "Paxlovid" 4 "Molnupiravir") size(small)) title ("log-log plot `fail'") saving("$pr
> ojectdir/output/figures/loglog_plot_`fail'", replace)   
 11.                         graph export "$projectdir/output/figures/loglog_plot_`fail'.svg", as(svg) replace
 12. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     22,957  observations end on or before enter()
--------------------------------------------------------------------------
      1,238  observations remaining, representing
      1,238  subjects
        748  failures in single-failure-per-subject data
   22,141.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -5029.7937
Iteration 1:   log likelihood = -5027.2341
Iteration 2:   log likelihood = -5026.8507
Iteration 3:   log likelihood = -5026.8466
Iteration 4:   log likelihood = -5026.8466
Refining estimates:
Iteration 0:   log likelihood = -5026.8466

Cox regression with Breslow method for ties

No. of subjects =    1,238                              Number of obs =  1,238
No. of failures =      748
Time at risk    = 22,141.5
                                                        LR chi2(3)    =   5.89
Log likelihood = -5026.8466                             Prob > chi2   = 0.1169

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.871969    .598288     1.96   0.050     1.000579    3.502238
    paxlovid  |   .5238319   .3068514    -1.10   0.270     .1661778    1.651242
molnupiravir  |   .6568199   .2751337    -1.00   0.316     .2889938    1.492809
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |    0.02340     0.41        1       0.5195
      2.drug |    0.00072     0.00        1       0.9840
      3.drug |    0.03960     1.07        1       0.3008
-------------+------------------------------------------
 Global test |                1.45        3       0.6932
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_all.g
> ph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_all.svg saved as SVG format

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_all.
> gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_all.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all_serious==1
Observed time interval: (stop_ae_all_serious[_n-1], stop_ae_all_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     21,252  observations end on or before enter()
--------------------------------------------------------------------------
      2,943  observations remaining, representing
      2,943  subjects
        868  failures in single-failure-per-subject data
  66,929.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood =   -6785.35
Iteration 1:   log likelihood = -6784.7568
Iteration 2:   log likelihood = -6784.7467
Iteration 3:   log likelihood = -6784.7467
Refining estimates:
Iteration 0:   log likelihood = -6784.7467

Cox regression with Breslow method for ties

No. of subjects =     2,943                             Number of obs =  2,943
No. of failures =       868
Time at risk    = 66,929.75
                                                        LR chi2(3)    =   1.21
Log likelihood = -6784.7467                             Prob > chi2   = 0.7514

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.283793   .4608523     0.70   0.486     .6352328    2.594519
    paxlovid  |   .7707619   .3888105    -0.52   0.606     .2867688    2.071612
molnupiravir  |   1.286729   .4612067     0.70   0.482     .6373648    2.597683
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |   -0.01502     0.20        1       0.6516
      2.drug |    0.06120     2.96        1       0.0855
      3.drug |    0.02785     0.70        1       0.4037
-------------+------------------------------------------
 Global test |                3.86        3       0.2772
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_all_s
> erious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_all_serious.svg saved as SVG format

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_all_
> serious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_all_serious.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_all==1
Observed time interval: (stop_ae_spc_all[_n-1], stop_ae_spc_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     21,907  observations end on or before enter()
--------------------------------------------------------------------------
      2,288  observations remaining, representing
      2,288  subjects
        837  failures in single-failure-per-subject data
   49,619.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -6297.2236
Iteration 1:   log likelihood = -6295.9337
Iteration 2:   log likelihood = -6295.8597
Iteration 3:   log likelihood = -6295.8596
Refining estimates:
Iteration 0:   log likelihood = -6295.8596

Cox regression with Breslow method for ties

No. of subjects =    2,288                              Number of obs =  2,288
No. of failures =      837
Time at risk    = 49,619.5
                                                        LR chi2(3)    =   2.73
Log likelihood = -6295.8596                             Prob > chi2   = 0.4355

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.529515   .4643282     1.40   0.162     .8436206    2.773067
    paxlovid  |   .6325507   .3658783    -0.79   0.428      .203585    1.965373
molnupiravir  |   .8029574   .3601903    -0.49   0.625     .3333195    1.934302
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |    0.01541     0.20        1       0.6557
      2.drug |   -0.07493     4.70        1       0.0302
      3.drug |   -0.00479     0.02        1       0.8897
-------------+------------------------------------------
 Global test |                4.93        3       0.1770
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_spc_a
> ll.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_spc_all.svg saved as SVG format

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_spc_
> all.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_spc_all.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_serious==1
Observed time interval: (stop_ae_spc_serious[_n-1], stop_ae_spc_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     19,149  observations end on or before enter()
--------------------------------------------------------------------------
      5,046  observations remaining, representing
      5,046  subjects
        905  failures in single-failure-per-subject data
 123,483.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -7623.2749
Iteration 1:   log likelihood = -7621.3662
Iteration 2:   log likelihood = -7621.0543
Iteration 3:   log likelihood = -7621.0324
Iteration 4:   log likelihood = -7621.0322
Iteration 5:   log likelihood = -7621.0322
Refining estimates:
Iteration 0:   log likelihood = -7621.0322

Cox regression with Breslow method for ties

No. of subjects =      5,046                            Number of obs =  5,046
No. of failures =        905
Time at risk    = 123,483.75
                                                        LR chi2(3)    =   4.49
Log likelihood = -7621.0322                             Prob > chi2   = 0.2136

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.265052   .4866935     0.61   0.541     .5951577     2.68896
    paxlovid  |   .2223935   .2231354    -1.50   0.134      .031123    1.589144
molnupiravir  |   1.150614   .4152678     0.39   0.697     .5671819    2.334192
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |    0.00602     0.03        1       0.8525
      2.drug |   -0.05858     3.14        1       0.0764
      3.drug |    0.05384     2.46        1       0.1171
-------------+------------------------------------------
 Global test |                5.71        3       0.1265
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_spc_s
> erious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_spc_serious.svg saved as SVG format

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_spc_
> serious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_spc_serious.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_all==1
Observed time interval: (stop_ae_drug_all[_n-1], stop_ae_drug_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     19,095  observations end on or before enter()
--------------------------------------------------------------------------
      5,100  observations remaining, representing
      5,100  subjects
        854  failures in single-failure-per-subject data
    126,076  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -7200.0892
Iteration 1:   log likelihood = -7199.1851
Iteration 2:   log likelihood = -7199.1457
Iteration 3:   log likelihood = -7199.1455
Refining estimates:
Iteration 0:   log likelihood = -7199.1455

Cox regression with Breslow method for ties

No. of subjects =   5,100                               Number of obs =  5,100
No. of failures =     854
Time at risk    = 126,076
                                                        LR chi2(3)    =   1.89
Log likelihood = -7199.1455                             Prob > chi2   = 0.5961

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   .5461893   .2802587    -1.18   0.239     .1997918    1.493168
    paxlovid  |   1.120855   .4396081     0.29   0.771     .5196386    2.417672
molnupiravir  |   .8826216   .3486394    -0.32   0.752     .4069548    1.914269
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |   -0.07479     5.21        1       0.0224
      2.drug |    0.03414     1.12        1       0.2897
      3.drug |    0.06693     2.95        1       0.0857
-------------+------------------------------------------
 Global test |                9.84        3       0.0200
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_drug_
> all.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_drug_all.svg saved as SVG format

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_drug
> _all.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_drug_all.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_serious==1
Observed time interval: (stop_ae_drug_serious[_n-1], stop_ae_drug_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     14,133  observations end on or before enter()
--------------------------------------------------------------------------
     10,062  observations remaining, representing
     10,062  subjects
        627  failures in single-failure-per-subject data
    260,192  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -5746.7385
Iteration 1:   log likelihood =  -5743.442
Iteration 2:   log likelihood = -5742.5374
Iteration 3:   log likelihood = -5742.2371
Iteration 4:   log likelihood = -5742.1278
Iteration 5:   log likelihood = -5742.0877
Iteration 6:   log likelihood =  -5742.073
Iteration 7:   log likelihood = -5742.0676
Iteration 8:   log likelihood = -5742.0656
Iteration 9:   log likelihood = -5742.0649
Iteration 10:  log likelihood = -5742.0646
Iteration 11:  log likelihood = -5742.0645
Iteration 12:  log likelihood = -5742.0645
Iteration 13:  log likelihood = -5742.0645
Iteration 14:  log likelihood = -5742.0645
Iteration 15:  log likelihood = -5742.0645
Iteration 16:  log likelihood = -5742.0645
Iteration 17:  log likelihood = -5742.0645
Iteration 18:  log likelihood = -5742.0645
Iteration 19:  log likelihood = -5742.0645
Iteration 20:  log likelihood = -5742.0645
Iteration 21:  log likelihood = -5742.0645
Iteration 22:  log likelihood = -5742.0645
Iteration 23:  log likelihood = -5742.0645
Iteration 24:  log likelihood = -5742.0645
Iteration 25:  log likelihood = -5742.0645
Iteration 26:  log likelihood = -5742.0645
Iteration 27:  log likelihood = -5742.0645
Iteration 28:  log likelihood = -5742.0645
Iteration 29:  log likelihood = -5742.0645
Refining estimates:
Iteration 0:   log likelihood = -5742.0645
Iteration 1:   log likelihood = -5742.0645
Iteration 2:   log likelihood = -5742.0645

Cox regression with Breslow method for ties

No. of subjects =  10,062                               Number of obs = 10,062
No. of failures =     627
Time at risk    = 260,192
                                                        LR chi2(3)    =   9.35
Log likelihood = -5742.0645                             Prob > chi2   = 0.0250

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   3.13e-14   9.08e-08    -0.00   1.000            0           .
    paxlovid  |   1.502857   .7123011     0.86   0.390     .5935784    3.805021
molnupiravir  |   .4868184   .3535522    -0.99   0.322     .1172684    2.020937
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |   -0.04375     0.00        1       1.0000
      2.drug |    0.07149     2.93        1       0.0871
      3.drug |   -0.01174     0.09        1       0.7580
-------------+------------------------------------------
 Global test |                3.12        3       0.3735
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_drug_
> serious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_drug_serious.svg saved as SVG format

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_drug
> _serious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_drug_serious.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_all==1
Observed time interval: (stop_ae_imae_all[_n-1], stop_ae_imae_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     20,994  observations end on or before enter()
--------------------------------------------------------------------------
      3,201  observations remaining, representing
      3,201  subjects
        842  failures in single-failure-per-subject data
  74,349.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -6668.9303
Iteration 1:   log likelihood = -6668.0053
Iteration 2:   log likelihood = -6667.9452
Iteration 3:   log likelihood = -6667.9447
Iteration 4:   log likelihood = -6667.9447
Refining estimates:
Iteration 0:   log likelihood = -6667.9447

Cox regression with Breslow method for ties

No. of subjects =     3,201                             Number of obs =  3,201
No. of failures =       842
Time at risk    = 74,349.25
                                                        LR chi2(3)    =   1.97
Log likelihood = -6667.9447                             Prob > chi2   = 0.5784

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.032541   .3729164     0.09   0.929      .508726    2.095706
    paxlovid  |   .4905967   .2860266    -1.22   0.222       .15648     1.53812
molnupiravir  |   .8794626   .4455533    -0.25   0.800      .325823    2.373849
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |    0.00444     0.02        1       0.8943
      2.drug |    0.01310     0.15        1       0.6995
      3.drug |    0.01970     0.29        1       0.5890
-------------+------------------------------------------
 Global test |                0.44        3       0.9313
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_imae_
> all.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_imae_all.svg saved as SVG format

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_imae
> _all.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_imae_all.svg saved as SVG format

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_serious==1
Observed time interval: (stop_ae_imae_serious[_n-1], stop_ae_imae_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     16,726  observations end on or before enter()
--------------------------------------------------------------------------
      7,469  observations remaining, representing
      7,469  subjects
        792  failures in single-failure-per-subject data
 189,517.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log likelihood = -7014.8537
Iteration 1:   log likelihood =   -7013.17
Iteration 2:   log likelihood = -7012.7703
Iteration 3:   log likelihood = -7012.7652
Iteration 4:   log likelihood = -7012.7652
Refining estimates:
Iteration 0:   log likelihood = -7012.7652

Cox regression with Breslow method for ties

No. of subjects =      7,469                            Number of obs =  7,469
No. of failures =        792
Time at risk    = 189,517.75
                                                        LR chi2(3)    =   4.18
Log likelihood = -7012.7652                             Prob > chi2   = 0.2430

-------------------------------------------------------------------------------
           _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.965558   .6985158     1.90   0.057     .9794624    3.944428
    paxlovid  |   1.063991    .533369     0.12   0.902     .3983256    2.842088
molnupiravir  |   1.643466   .6735435     1.21   0.225     .7360576    3.669523
-------------------------------------------------------------------------------

Test of proportional-hazards assumption

Time function: Analysis time
--------------------------------------------------------
             |        rho     chi2       df    Prob>chi2
-------------+------------------------------------------
     0b.drug |          .        .        1           .
      1.drug |    0.04035     1.29        1       0.2561
      2.drug |   -0.07309     4.23        1       0.0397
      3.drug |    0.00747     0.04        1       0.8334
-------------+------------------------------------------
 Global test |                5.60        3       0.1328
--------------------------------------------------------
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_imae_
> serious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/schoenfeld_ae_imae_serious.svg saved as SVG format

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_imae
> _serious.gph saved
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/figures/loglog_plot_ae_imae_serious.svg saved as SVG format

. 
. *** Hazard of events                                            
. tempname cox_model_summary

. postfile `cox_model_summary' str20(model) str20(failure) ///
>         hr_sot lc_sot uc_sot hr_pax lc_pax uc_pax hr_mol lc_mol uc_mol ///
>         using "$projectdir/output/tables/cox_model_summary", replace                                                     

. foreach fail in $ae_combined {
  2.         stset stop_`fail', id(patient_id) origin(time start_date_delay) enter(time start_date_delay) failure(fail_`fail'==1) 
  3.         foreach model in crude agesex adj {
  4.                 stcox $`model', vce(robust)
  5.                                         matrix b = r(table)
  6.                                         local hr_sot = b[1,2]
  7.                                         local lc_sot = b[5,2]
  8.                                         local uc_sot = b[6,2]
  9.                                         local hr_pax = b[1,3]
 10.                                         local lc_pax = b[5,3]
 11.                                         local uc_pax = b[6,3]
 12.                                         local hr_mol = b[1,4]
 13.                                         local lc_mol = b[5,4]
 14.                                         local uc_mol = b[6,4]   
 15.                 
.                 post `cox_model_summary' ("`model'") ("`fail'") (`hr_sot') (`lc_sot') (`uc_sot') (`hr_pax') (`lc_pax') (`uc_pax') (`hr_mol') (`lc_mol') (`uc_mol')         
>                      
 16. }
 17. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     22,957  observations end on or before enter()
--------------------------------------------------------------------------
      1,238  observations remaining, representing
      1,238  subjects
        748  failures in single-failure-per-subject data
   22,141.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5029.7937
Iteration 1:   log pseudolikelihood = -5027.2341
Iteration 2:   log pseudolikelihood = -5026.8507
Iteration 3:   log pseudolikelihood = -5026.8466
Iteration 4:   log pseudolikelihood = -5026.8466
Refining estimates:
Iteration 0:   log pseudolikelihood = -5026.8466

Cox regression with Breslow method for ties

No. of subjects =    1,238                              Number of obs =  1,238
No. of failures =      748
Time at risk    = 22,141.5
                                                        Wald chi2(3)  =   7.61
Log pseudolikelihood = -5026.8466                       Prob > chi2   = 0.0547

                          (Std. err. adjusted for 1,238 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.871969    .515221     2.28   0.023     1.091498    3.210512
    paxlovid  |   .5238319   .3076175    -1.10   0.271     .1657022    1.655982
molnupiravir  |   .6568199   .2461566    -1.12   0.262     .3150948    1.369151
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5029.7937
Iteration 1:   log pseudolikelihood = -5026.4379
Iteration 2:   log pseudolikelihood = -5026.0553
Iteration 3:   log pseudolikelihood = -5026.0513
Iteration 4:   log pseudolikelihood = -5026.0513
Refining estimates:
Iteration 0:   log pseudolikelihood = -5026.0513

Cox regression with Breslow method for ties

No. of subjects =    1,238                              Number of obs =  1,238
No. of failures =      748
Time at risk    = 22,141.5
                                                        Wald chi2(5)  =   9.52
Log pseudolikelihood = -5026.0513                       Prob > chi2   = 0.0899

                          (Std. err. adjusted for 1,238 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.917261    .523503     2.38   0.017     1.122698    3.274157
    paxlovid  |   .5257537   .3041007    -1.11   0.266     .1692153    1.633522
molnupiravir  |   .6514205   .2472444    -1.13   0.259     .3095928    1.370667
              |
          age |   .9998062   .0018898    -0.10   0.918     .9961091    1.003517
              |
          sex |
      Female  |   1.096083   .0789675     1.27   0.203     .9517401    1.262317
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1464.3883
Iteration 1:   log pseudolikelihood =   -1452.06
Iteration 2:   log pseudolikelihood = -1451.4371
Iteration 3:   log pseudolikelihood = -1451.4166
Iteration 4:   log pseudolikelihood = -1451.4166
Refining estimates:
Iteration 0:   log pseudolikelihood = -1451.4166

Cox regression with Breslow method for ties

No. of subjects =   422                                 Number of obs =    422
No. of failures =   259
Time at risk    = 7,377
                                                        Wald chi2(36) =  35.06
Log pseudolikelihood = -1451.4166                       Prob > chi2   = 0.5133

                                          (Std. err. adjusted for 422 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.602802   1.065165     2.34   0.019     1.167071    5.804771
                  paxlovid  |   .7679729   .5872327    -0.35   0.730     .1715821    3.437318
              molnupiravir  |   .4740143   .3159362    -1.12   0.263     .1283676    1.750361
                            |
                        age |   1.000793   .0032255     0.25   0.806      .994491    1.007135
                            |
                        sex |
                    Female  |    1.02302   .1338066     0.17   0.862     .7916819    1.321958
                            |
                 region_nhs |
             East Midlands  |   1.217649   .3776134     0.63   0.525     .6630561    2.236114
                    London  |   1.987899   .5286495     2.58   0.010     1.180405    3.347784
                North East  |   1.099188   .3424369     0.30   0.761     .5968867    2.024194
                North West  |   1.463177   .4502928     1.24   0.216     .8004597    2.674571
                South East  |   1.151773   .3491846     0.47   0.641     .6357798     2.08654
                South West  |   1.731121   .5070327     1.87   0.061     .9750271    3.073535
             West Midlands  |    1.53827   .4685206     1.41   0.157     .8467924    2.794399
  Yorkshire and The Humber  |    1.59762   .5166419     1.45   0.147     .8476373    3.011182
                            |
                      imdq5 |
                         2  |   .9921091   .2195079    -0.04   0.971      .643025    1.530703
                         3  |   1.232524   .2971431     0.87   0.386      .768393    1.977003
                         4  |   1.029744   .2342373     0.13   0.897     .6593332    1.608249
           5 most deprived  |   1.115982   .2423806     0.51   0.613     .7290958    1.708166
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.372146   .3358697     1.29   0.196       .84927    2.216945
                            |
         vaccination_status |
           One vaccination  |     .87816   .2275099    -0.50   0.616     .5285037    1.459148
          Two vaccinations  |    .863133   .2629387    -0.48   0.629     .4750877    1.568129
        Three vaccinations  |   .8974868   .1654321    -0.59   0.557     .6253565    1.288037
 Four or more vaccinations  |   .7808079   .1855093    -1.04   0.298     .4901289    1.243879
                            |
                   diabetes |   .8364386   .2296952    -0.65   0.515     .4882979    1.432793
    chronic_cardiac_disease |   .9747306   .2359871    -0.11   0.916     .6064633    1.566624
chronic_respiratory_disease |   .9389632   .1953736    -0.30   0.762     .6245049    1.411761
               hypertension |   1.048701   .2148526     0.23   0.816     .7018783    1.566901
             downs_syndrome |   .9647979   .1512039    -0.23   0.819     .7096355    1.311709
               solid_cancer |   .7748771    .170797    -1.16   0.247     .5030517    1.193584
               haem_disease |   1.020825   .1355592     0.16   0.877     .7868953    1.324297
              renal_disease |   .9765504    .142755    -0.16   0.871     .7332694    1.300546
              liver_disease |   .6723651   .1522945    -1.75   0.080     .4313236    1.048111
               imid_on_drug |   1.011515   .1589623     0.07   0.942     .7433675    1.376388
          immunosuppression |   .8925531   .1878151    -0.54   0.589     .5909086     1.34818
                   hiv_aids |   .9186465   .1506876    -0.52   0.605     .6660763    1.266989
           organ_transplant |   .8544255    .193153    -0.70   0.486     .5485928    1.330756
                 rare_neuro |   .9294256   .1224431    -0.56   0.579     .7179211    1.203241
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all_serious==1
Observed time interval: (stop_ae_all_serious[_n-1], stop_ae_all_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     21,252  observations end on or before enter()
--------------------------------------------------------------------------
      2,943  observations remaining, representing
      2,943  subjects
        868  failures in single-failure-per-subject data
  66,929.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood =   -6785.35
Iteration 1:   log pseudolikelihood = -6784.7568
Iteration 2:   log pseudolikelihood = -6784.7467
Iteration 3:   log pseudolikelihood = -6784.7467
Refining estimates:
Iteration 0:   log pseudolikelihood = -6784.7467

Cox regression with Breslow method for ties

No. of subjects =     2,943                             Number of obs =  2,943
No. of failures =       868
Time at risk    = 66,929.75
                                                        Wald chi2(3)  =   1.26
Log pseudolikelihood = -6784.7467                       Prob > chi2   = 0.7376

                          (Std. err. adjusted for 2,943 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.283793   .4736818     0.68   0.498     .6229117    2.645838
    paxlovid  |   .7707619   .3460638    -0.58   0.562      .319698    1.858235
molnupiravir  |   1.286729   .4446757     0.73   0.466     .6536175     2.53309
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood =   -6785.35
Iteration 1:   log pseudolikelihood = -6784.7198
Iteration 2:   log pseudolikelihood = -6784.7096
Iteration 3:   log pseudolikelihood = -6784.7096
Refining estimates:
Iteration 0:   log pseudolikelihood = -6784.7096

Cox regression with Breslow method for ties

No. of subjects =     2,943                             Number of obs =  2,943
No. of failures =       868
Time at risk    = 66,929.75
                                                        Wald chi2(5)  =   1.32
Log pseudolikelihood = -6784.7096                       Prob > chi2   = 0.9324

                          (Std. err. adjusted for 2,943 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.283522   .4732914     0.68   0.498     .6230569    2.644107
    paxlovid  |   .7702996   .3464999    -0.58   0.562     .3189834    1.860164
molnupiravir  |   1.286764   .4448209     0.73   0.466     .6535026    2.533672
              |
          age |   .9996796   .0018137    -0.18   0.860     .9961312    1.003241
              |
          sex |
      Female  |   .9858905    .066558    -0.21   0.833     .8637013    1.125366
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1997.7158
Iteration 1:   log pseudolikelihood = -1979.4563
Iteration 2:   log pseudolikelihood = -1978.9418
Iteration 3:   log pseudolikelihood = -1978.9333
Iteration 4:   log pseudolikelihood = -1978.9333
Refining estimates:
Iteration 0:   log pseudolikelihood = -1978.9333

Cox regression with Breslow method for ties

No. of subjects =    984                                Number of obs =    984
No. of failures =    297
Time at risk    = 22,257
                                                        Wald chi2(36) =  40.64
Log pseudolikelihood = -1978.9333                       Prob > chi2   = 0.2732

                                          (Std. err. adjusted for 984 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.086571   1.025584     1.50   0.135     .7962574    5.467802
                  paxlovid  |   1.571554   1.155718     0.61   0.539     .3718413    6.642035
              molnupiravir  |   1.411713   .6807871     0.72   0.475     .5486074    3.632716
                            |
                        age |   1.002003   .0030187     0.66   0.506     .9961044    1.007937
                            |
                        sex |
                    Female  |   .9853076   .1189073    -0.12   0.902     .7777652    1.248232
                            |
                 region_nhs |
             East Midlands  |   .8838768   .2154306    -0.51   0.613     .5481826    1.425142
                    London  |    .661259   .1455576    -1.88   0.060     .4295398    1.017981
                North East  |   .6184542   .1619933    -1.83   0.067     .3701264    1.033392
                North West  |   .7988456   .1847545    -0.97   0.332     .5076912    1.256973
                South East  |   .6030799    .151806    -2.01   0.045     .3682241    .9877283
                South West  |   .5661778   .1562692    -2.06   0.039     .3296211    .9725024
             West Midlands  |   .4807868   .1363129    -2.58   0.010      .275816    .8380804
  Yorkshire and The Humber  |   .6931846   .1711927    -1.48   0.138     .4272003    1.124777
                            |
                      imdq5 |
                         2  |   1.088142   .2106956     0.44   0.663      .744506    1.590386
                         3  |   1.201566   .2356693     0.94   0.349     .8180825    1.764811
                         4  |    1.04029   .2113109     0.19   0.846     .6986388    1.549018
           5 most deprived  |   1.153746   .2124281     0.78   0.437      .804242    1.655136
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .7825341   .1674911    -1.15   0.252     .5144165    1.190397
                            |
         vaccination_status |
           One vaccination  |   1.292839   .2944848     1.13   0.259     .8272875    2.020377
          Two vaccinations  |   1.245385   .3029181     0.90   0.367     .7731496    2.006058
        Three vaccinations  |   1.140486   .1936082     0.77   0.439     .8176933    1.590704
 Four or more vaccinations  |    1.01949   .2559135     0.08   0.939     .6233237    1.667449
                            |
                   diabetes |   1.045369   .2109866     0.22   0.826     .7038369    1.552629
    chronic_cardiac_disease |   1.011434   .2109584     0.05   0.957     .6720469    1.522214
chronic_respiratory_disease |   1.352098   .2471093     1.65   0.099     .9450234    1.934522
               hypertension |    .731992   .1497258    -1.53   0.127     .4902264     1.09299
             downs_syndrome |   .9663518    .145063    -0.23   0.820     .7200421    1.296918
               solid_cancer |   1.026845   .1904534     0.14   0.886     .7138859    1.477001
               haem_disease |    1.05749   .1246329     0.47   0.635     .8393754    1.332284
              renal_disease |   .9597947   .1249316    -0.32   0.753     .7436726    1.238725
              liver_disease |   1.378198   .2573239     1.72   0.086     .9558358    1.987192
               imid_on_drug |   1.548812   .2110424     3.21   0.001     1.185805    2.022945
          immunosuppression |   .9295005   .1742567    -0.39   0.697     .6436828    1.342231
                   hiv_aids |   .8922847   .1315696    -0.77   0.440     .6683311    1.191284
           organ_transplant |   1.064419   .2031628     0.33   0.744     .7322274    1.547317
                 rare_neuro |   .8308082   .1003288    -1.53   0.125     .6557062     1.05267
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_all==1
Observed time interval: (stop_ae_spc_all[_n-1], stop_ae_spc_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     21,907  observations end on or before enter()
--------------------------------------------------------------------------
      2,288  observations remaining, representing
      2,288  subjects
        837  failures in single-failure-per-subject data
   49,619.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -6297.2236
Iteration 1:   log pseudolikelihood = -6295.9337
Iteration 2:   log pseudolikelihood = -6295.8597
Iteration 3:   log pseudolikelihood = -6295.8596
Refining estimates:
Iteration 0:   log pseudolikelihood = -6295.8596

Cox regression with Breslow method for ties

No. of subjects =    2,288                              Number of obs =  2,288
No. of failures =      837
Time at risk    = 49,619.5
                                                        Wald chi2(3)  =   2.91
Log pseudolikelihood = -6295.8596                       Prob > chi2   = 0.4056

                          (Std. err. adjusted for 2,288 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.529515    .445669     1.46   0.145      .864035    2.707549
    paxlovid  |   .6325507   .4010539    -0.72   0.470     .1825623    2.191693
molnupiravir  |   .8029574    .359655    -0.49   0.624     .3337554    1.931775
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -6297.2236
Iteration 1:   log pseudolikelihood = -6295.0663
Iteration 2:   log pseudolikelihood = -6294.9927
Iteration 3:   log pseudolikelihood = -6294.9925
Refining estimates:
Iteration 0:   log pseudolikelihood = -6294.9925

Cox regression with Breslow method for ties

No. of subjects =    2,288                              Number of obs =  2,288
No. of failures =      837
Time at risk    = 49,619.5
                                                        Wald chi2(5)  =   4.72
Log pseudolikelihood = -6294.9925                       Prob > chi2   = 0.4509

                          (Std. err. adjusted for 2,288 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.528482   .4471726     1.45   0.147     .8614557    2.711988
    paxlovid  |   .6300457   .4000263    -0.73   0.467     .1815224    2.186824
molnupiravir  |   .7950984   .3552412    -0.51   0.608     .3312177    1.908659
              |
          age |   1.002138   .0018541     1.15   0.248     .9985108    1.005779
              |
          sex |
      Female  |    1.04782   .0719915     0.68   0.497      .915807    1.198862
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1792.9618
Iteration 1:   log pseudolikelihood = -1782.6022
Iteration 2:   log pseudolikelihood = -1777.8456
Iteration 3:   log pseudolikelihood = -1777.2768
Iteration 4:   log pseudolikelihood = -1777.2588
Iteration 5:   log pseudolikelihood = -1777.2588
Refining estimates:
Iteration 0:   log pseudolikelihood = -1777.2588

Cox regression with Breslow method for ties

No. of subjects =      747                              Number of obs =    747
No. of failures =      280
Time at risk    = 15,952.5
                                                        Wald chi2(36) =  37.31
Log pseudolikelihood = -1777.2588                       Prob > chi2   = 0.4085

                                          (Std. err. adjusted for 747 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   3.921227   1.566797     3.42   0.001      1.79188    8.580939
                  paxlovid  |   2.115212   1.618577     0.98   0.328     .4720717    9.477637
              molnupiravir  |   .7780799    .408949    -0.48   0.633     .2777432    2.179741
                            |
                        age |   1.004697   .0031637     1.49   0.137     .9985152    1.010917
                            |
                        sex |
                    Female  |   .9222317    .111559    -0.67   0.503     .7275675    1.168979
                            |
                 region_nhs |
             East Midlands  |   .9565379   .2582322    -0.16   0.869     .5635172    1.623668
                    London  |   .8228355   .2000385    -0.80   0.422     .5109502    1.325097
                North East  |   .7189771   .2041984    -1.16   0.245     .4120627    1.254489
                North West  |   1.221261   .3263061     0.75   0.454     .7233984    2.061765
                South East  |   .6973598   .1923817    -1.31   0.191     .4061016     1.19751
                South West  |   .7951577   .2389319    -0.76   0.446     .4412463    1.432931
             West Midlands  |   1.187223   .3101323     0.66   0.511     .7115038    1.981014
  Yorkshire and The Humber  |   .9221137   .2518838    -0.30   0.767     .5398473    1.575063
                            |
                      imdq5 |
                         2  |   1.184901   .2470441     0.81   0.416     .7874305    1.783003
                         3  |   1.306438   .2824574     1.24   0.216     .8551758    1.995824
                         4  |   1.094341   .2301668     0.43   0.668     .7246431    1.652652
           5 most deprived  |   1.213423   .2521456     0.93   0.352     .8074861    1.823431
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.077428   .2280312     0.35   0.725     .7116009    1.631323
                            |
         vaccination_status |
           One vaccination  |    1.05778   .2602449     0.23   0.819     .6530931    1.713231
          Two vaccinations  |   1.281945   .2982362     1.07   0.286     .8125368    2.022535
        Three vaccinations  |   .9296943   .1583131    -0.43   0.669     .6658757    1.298037
 Four or more vaccinations  |   .7665229   .1926361    -1.06   0.290     .4683907    1.254417
                            |
                   diabetes |   .8935721   .2176325    -0.46   0.644     .5543915    1.440266
    chronic_cardiac_disease |     .85358    .182471    -0.74   0.459      .561412    1.297797
chronic_respiratory_disease |    .935766   .1959836    -0.32   0.751     .6207184    1.410717
               hypertension |   .8905699   .1929729    -0.53   0.593     .5824058    1.361791
             downs_syndrome |   1.026973   .1520359     0.18   0.857     .7683245    1.372692
               solid_cancer |   .8366389   .1838199    -0.81   0.417     .5438994    1.286938
               haem_disease |   .8517126   .1064086    -1.28   0.199     .6667275    1.088022
              renal_disease |   .7781481   .1093424    -1.79   0.074     .5908193    1.024872
              liver_disease |   .9663676   .1917847    -0.17   0.863      .654958    1.425842
               imid_on_drug |   .9495432   .1454122    -0.34   0.735     .7033354    1.281938
          immunosuppression |    .990396    .186091    -0.05   0.959     .6852861     1.43135
                   hiv_aids |   .9414506    .147632    -0.38   0.700     .6923374    1.280198
           organ_transplant |   .9866471   .1965252    -0.07   0.946     .6677522    1.457835
                 rare_neuro |    .949638   .1191612    -0.41   0.680     .7425893    1.214416
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_serious==1
Observed time interval: (stop_ae_spc_serious[_n-1], stop_ae_spc_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     19,149  observations end on or before enter()
--------------------------------------------------------------------------
      5,046  observations remaining, representing
      5,046  subjects
        905  failures in single-failure-per-subject data
 123,483.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7623.2749
Iteration 1:   log pseudolikelihood = -7621.3662
Iteration 2:   log pseudolikelihood = -7621.0543
Iteration 3:   log pseudolikelihood = -7621.0324
Iteration 4:   log pseudolikelihood = -7621.0322
Iteration 5:   log pseudolikelihood = -7621.0322
Refining estimates:
Iteration 0:   log pseudolikelihood = -7621.0322

Cox regression with Breslow method for ties

No. of subjects =      5,046                            Number of obs =  5,046
No. of failures =        905
Time at risk    = 123,483.75
                                                        Wald chi2(3)  =   2.74
Log pseudolikelihood = -7621.0322                       Prob > chi2   = 0.4340

                          (Std. err. adjusted for 5,046 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.265052   .4928532     0.60   0.546     .5895049    2.714745
    paxlovid  |   .2223935   .2290616    -1.46   0.144     .0295392    1.674347
molnupiravir  |   1.150614   .3865601     0.42   0.676      .595607    2.222794
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7623.2749
Iteration 1:   log pseudolikelihood = -7620.1674
Iteration 2:   log pseudolikelihood = -7619.8557
Iteration 3:   log pseudolikelihood = -7619.8338
Iteration 4:   log pseudolikelihood = -7619.8337
Iteration 5:   log pseudolikelihood = -7619.8337
Refining estimates:
Iteration 0:   log pseudolikelihood = -7619.8337

Cox regression with Breslow method for ties

No. of subjects =      5,046                            Number of obs =  5,046
No. of failures =        905
Time at risk    = 123,483.75
                                                        Wald chi2(5)  =   4.98
Log pseudolikelihood = -7619.8337                       Prob > chi2   = 0.4178

                          (Std. err. adjusted for 5,046 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.281453   .4969511     0.64   0.523     .5992451    2.740319
    paxlovid  |   .2255338   .2323163    -1.45   0.148      .029951    1.698289
molnupiravir  |   1.136874   .3833354     0.38   0.704     .5870847    2.201525
              |
          age |   .9973153   .0018094    -1.48   0.138     .9937753    1.000868
              |
          sex |
      Female  |   1.018245   .0675327     0.27   0.785     .8941255    1.159595
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2224.8372
Iteration 1:   log pseudolikelihood = -2205.0769
Iteration 2:   log pseudolikelihood = -2203.2417
Iteration 3:   log pseudolikelihood = -2203.1002
Iteration 4:   log pseudolikelihood = -2203.0985
Iteration 5:   log pseudolikelihood = -2203.0985
Refining estimates:
Iteration 0:   log pseudolikelihood = -2203.0985

Cox regression with Breslow method for ties

No. of subjects =     1,661                             Number of obs =  1,661
No. of failures =       304
Time at risk    = 40,672.75
                                                        Wald chi2(36) =  46.28
Log pseudolikelihood = -2203.0985                       Prob > chi2   = 0.1171

                                        (Std. err. adjusted for 1,661 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.954846   1.604666     2.00   0.046     1.019246    8.566246
                  paxlovid  |   .9640074    1.06736    -0.03   0.974     .1100576    8.443852
              molnupiravir  |   1.545927   .7963908     0.85   0.398     .5632343    4.243156
                            |
                        age |   1.000827   .0031933     0.26   0.796     .9945874    1.007105
                            |
                        sex |
                    Female  |   1.098063   .1295806     0.79   0.428     .8713213    1.383809
                            |
                 region_nhs |
             East Midlands  |   .9928564   .2369593    -0.03   0.976     .6219208    1.585031
                    London  |   .5108239   .1178146    -2.91   0.004     .3250522    .8027666
                North East  |   .8389371   .2032281    -0.72   0.468     .5218316    1.348741
                North West  |   .8229398   .2019157    -0.79   0.427     .5087659    1.331123
                South East  |   .6386701    .159879    -1.79   0.073     .3910158    1.043179
                South West  |   .5445637   .1563579    -2.12   0.034     .3102039    .9559827
             West Midlands  |   .6092754   .1585532    -1.90   0.057     .3658503    1.014668
  Yorkshire and The Humber  |   .9240574   .2144645    -0.34   0.734     .5863321    1.456312
                            |
                      imdq5 |
                         2  |   1.230053   .2401381     1.06   0.289     .8389713    1.803434
                         3  |   1.256439   .2452089     1.17   0.242     .8570764    1.841889
                         4  |   1.073647   .2145505     0.36   0.722     .7257098    1.588401
           5 most deprived  |   1.196891   .2292019     0.94   0.348     .8223396    1.742038
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .9331076     .20011    -0.32   0.747     .6128962    1.420615
                            |
         vaccination_status |
           One vaccination  |   1.306776    .297147     1.18   0.239     .8368489    2.040588
          Two vaccinations  |   1.098678     .25519     0.41   0.685     .6968864    1.732125
        Three vaccinations  |   1.081295   .1760013     0.48   0.631     .7859497    1.487624
 Four or more vaccinations  |   1.105837   .2471106     0.45   0.653      .713644    1.713566
                            |
                   diabetes |   .9915908   .2077556    -0.04   0.968      .657644    1.495113
    chronic_cardiac_disease |   .8867317    .184226    -0.58   0.563     .5901303    1.332406
chronic_respiratory_disease |   1.115897   .2183549     0.56   0.575     .7604387    1.637512
               hypertension |   .7281007   .1550737    -1.49   0.136     .4796222    1.105309
             downs_syndrome |    .998472   .1457384    -0.01   0.992     .7500553    1.329164
               solid_cancer |   1.003107   .1895315     0.02   0.987     .6926557    1.452704
               haem_disease |    1.03747   .1215473     0.31   0.754     .8246141    1.305269
              renal_disease |   .7386803   .0992965    -2.25   0.024     .5675897    .9613435
              liver_disease |   1.183529   .2297932     0.87   0.385     .8089289      1.7316
               imid_on_drug |   1.281345   .1738223     1.83   0.068     .9821897    1.671617
          immunosuppression |   1.099575   .1871881     0.56   0.577     .7876242    1.535079
                   hiv_aids |   1.050287   .1496515     0.34   0.731     .7943714    1.388649
           organ_transplant |   1.032434   .2050186     0.16   0.872     .6995725    1.523674
                 rare_neuro |   .7962788   .0934331    -1.94   0.052     .6326851    1.002173
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_all==1
Observed time interval: (stop_ae_drug_all[_n-1], stop_ae_drug_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     19,095  observations end on or before enter()
--------------------------------------------------------------------------
      5,100  observations remaining, representing
      5,100  subjects
        854  failures in single-failure-per-subject data
    126,076  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7200.0892
Iteration 1:   log pseudolikelihood = -7199.1851
Iteration 2:   log pseudolikelihood = -7199.1457
Iteration 3:   log pseudolikelihood = -7199.1455
Refining estimates:
Iteration 0:   log pseudolikelihood = -7199.1455

Cox regression with Breslow method for ties

No. of subjects =   5,100                               Number of obs =  5,100
No. of failures =     854
Time at risk    = 126,076
                                                        Wald chi2(3)  =   1.51
Log pseudolikelihood = -7199.1455                       Prob > chi2   = 0.6810

                          (Std. err. adjusted for 5,100 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   .5461893   .3006917    -1.10   0.272     .1856668    1.606764
    paxlovid  |   1.120855    .448078     0.29   0.775     .5119991    2.453745
molnupiravir  |   .8826216   .2994996    -0.37   0.713     .4538755    1.716376
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7200.0892
Iteration 1:   log pseudolikelihood = -7197.7389
Iteration 2:   log pseudolikelihood = -7197.6995
Iteration 3:   log pseudolikelihood = -7197.6993
Refining estimates:
Iteration 0:   log pseudolikelihood = -7197.6993

Cox regression with Breslow method for ties

No. of subjects =   5,100                               Number of obs =  5,100
No. of failures =     854
Time at risk    = 126,076
                                                        Wald chi2(5)  =   4.76
Log pseudolikelihood = -7197.6993                       Prob > chi2   = 0.4464

                          (Std. err. adjusted for 5,100 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   .5444796   .2993979    -1.11   0.269     .1853206    1.599703
    paxlovid  |   1.104902   .4445494     0.25   0.804     .5021681    2.431077
molnupiravir  |   .8909404     .30244    -0.34   0.734     .4580348    1.733001
              |
          age |   .9995564   .0018302    -0.24   0.809     .9959757     1.00315
              |
          sex |
      Female  |   .8907371    .060819    -1.69   0.090     .7791661    1.018284
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2105.6524
Iteration 1:   log pseudolikelihood =   -2085.27
Iteration 2:   log pseudolikelihood = -2084.7991
Iteration 3:   log pseudolikelihood = -2084.7961
Iteration 4:   log pseudolikelihood = -2084.7961
Refining estimates:
Iteration 0:   log pseudolikelihood = -2084.7961

Cox regression with Breslow method for ties

No. of subjects =  1,703                                Number of obs =  1,703
No. of failures =    287
Time at risk    = 42,010
                                                        Wald chi2(36) =  39.81
Log pseudolikelihood = -2084.7961                       Prob > chi2   = 0.3042

                                        (Std. err. adjusted for 1,703 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |    .948036   .7700266    -0.07   0.948     .1929525    4.657998
                  paxlovid  |   2.265494   1.462974     1.27   0.205      .638981    8.032265
              molnupiravir  |   .3338151   .2736986    -1.34   0.181     .0669263    1.665004
                            |
                        age |   .9993968   .0032145    -0.19   0.851     .9931163    1.005717
                            |
                        sex |
                    Female  |   .9472159   .1140768    -0.45   0.653     .7480586    1.199395
                            |
                 region_nhs |
             East Midlands  |   .7715843   .2158645    -0.93   0.354     .4459072    1.335126
                    London  |   .9453245   .2163202    -0.25   0.806     .6036693    1.480344
                North East  |   .4565979   .1470242    -2.43   0.015     .2429112    .8582628
                North West  |   .8829109   .2436874    -0.45   0.652     .5140216    1.516535
                South East  |   .9074292   .2266218    -0.39   0.697     .5562029    1.480445
                South West  |    1.06105   .2723928     0.23   0.817      .641528    1.754917
             West Midlands  |   .6514372   .1803642    -1.55   0.122     .3786163    1.120845
  Yorkshire and The Humber  |    .953454   .2443053    -0.19   0.852     .5770252     1.57545
                            |
                      imdq5 |
                         2  |   1.394904   .2802465     1.66   0.098     .9408742    2.068031
                         3  |   1.542888   .3048019     2.20   0.028     1.047556    2.272436
                         4  |   .9158602   .1951843    -0.41   0.680     .6031491    1.390701
           5 most deprived  |     1.2225   .2453107     1.00   0.317     .8249814    1.811564
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.243879   .2404957     1.13   0.259     .8515381    1.816989
                            |
         vaccination_status |
           One vaccination  |   .8108824   .1903613    -0.89   0.372     .5118366    1.284649
          Two vaccinations  |   1.053815   .2326956     0.24   0.812     .6836097    1.624502
        Three vaccinations  |   .9070595    .138311    -0.64   0.522     .6727322    1.223008
 Four or more vaccinations  |   .6279707   .1725831    -1.69   0.090      .366443    1.076149
                            |
                   diabetes |   .6207712   .1562217    -1.89   0.058     .3790708    1.016583
    chronic_cardiac_disease |   1.170875   .2089151     0.88   0.377     .8253415    1.661068
chronic_respiratory_disease |   .8970738   .1840091    -0.53   0.596     .6001067    1.340997
               hypertension |   .9392188   .2027791    -0.29   0.771     .6151638    1.433979
             downs_syndrome |   1.138217    .158935     0.93   0.354     .8656999     1.49652
               solid_cancer |   .8002714   .1675777    -1.06   0.287      .530878    1.206368
               haem_disease |   .9892224   .1175386    -0.09   0.927     .7837091    1.248628
              renal_disease |   1.089321   .1412371     0.66   0.509     .8448752    1.404492
              liver_disease |   .7803968   .1493917    -1.30   0.195     .5362528    1.135694
               imid_on_drug |   1.048987   .1473121     0.34   0.733     .7965874    1.381359
          immunosuppression |   1.076683   .1911728     0.42   0.677     .7602405    1.524842
                   hiv_aids |   .9562292   .1492086    -0.29   0.774     .7042742    1.298321
           organ_transplant |   .8618441   .1588446    -0.81   0.420      .600545    1.236835
                 rare_neuro |   .9421455    .114892    -0.49   0.625     .7418504    1.196519
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_serious==1
Observed time interval: (stop_ae_drug_serious[_n-1], stop_ae_drug_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     14,133  observations end on or before enter()
--------------------------------------------------------------------------
     10,062  observations remaining, representing
     10,062  subjects
        627  failures in single-failure-per-subject data
    260,192  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5746.7385
Iteration 1:   log pseudolikelihood =  -5743.442
Iteration 2:   log pseudolikelihood = -5742.5374
Iteration 3:   log pseudolikelihood = -5742.2371
Iteration 4:   log pseudolikelihood = -5742.1278
Iteration 5:   log pseudolikelihood = -5742.0877
Iteration 6:   log pseudolikelihood =  -5742.073
Iteration 7:   log pseudolikelihood = -5742.0676
Iteration 8:   log pseudolikelihood = -5742.0656
Iteration 9:   log pseudolikelihood = -5742.0649
Iteration 10:  log pseudolikelihood = -5742.0646
Iteration 11:  log pseudolikelihood = -5742.0645
Iteration 12:  log pseudolikelihood = -5742.0645
Iteration 13:  log pseudolikelihood = -5742.0645
Iteration 14:  log pseudolikelihood = -5742.0645
Iteration 15:  log pseudolikelihood = -5742.0645
Iteration 16:  log pseudolikelihood = -5742.0645
Iteration 17:  log pseudolikelihood = -5742.0645
Iteration 18:  log pseudolikelihood = -5742.0645
Iteration 19:  log pseudolikelihood = -5742.0645
Iteration 20:  log pseudolikelihood = -5742.0645
Iteration 21:  log pseudolikelihood = -5742.0645
Iteration 22:  log pseudolikelihood = -5742.0645
Iteration 23:  log pseudolikelihood = -5742.0645
Iteration 24:  log pseudolikelihood = -5742.0645
Iteration 25:  log pseudolikelihood = -5742.0645
Iteration 26:  log pseudolikelihood = -5742.0645
Iteration 27:  log pseudolikelihood = -5742.0645
Iteration 28:  log pseudolikelihood = -5742.0645
Iteration 29:  log pseudolikelihood = -5742.0645
Refining estimates:
Iteration 0:   log pseudolikelihood = -5742.0645
Iteration 1:   log pseudolikelihood = -5742.0645
Iteration 2:   log pseudolikelihood = -5742.0645

Cox regression with Breslow method for ties

No. of subjects =  10,062                             Number of obs =   10,062
No. of failures =     627
Time at risk    = 260,192
                                                      Wald chi2(3)  = 23225.24
Log pseudolikelihood = -5742.0645                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 10,062 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   3.13e-14   6.78e-15  -143.44   0.000     2.05e-14    4.79e-14
    paxlovid  |   1.502857   .6652893     0.92   0.357     .6311099     3.57874
molnupiravir  |   .4868184   .3707326    -0.95   0.345     .1094312    2.165672
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5746.7385
Iteration 1:   log pseudolikelihood = -5743.4085
Iteration 2:   log pseudolikelihood =  -5742.504
Iteration 3:   log pseudolikelihood = -5742.2036
Iteration 4:   log pseudolikelihood = -5742.0943
Iteration 5:   log pseudolikelihood = -5742.0543
Iteration 6:   log pseudolikelihood = -5742.0395
Iteration 7:   log pseudolikelihood = -5742.0341
Iteration 8:   log pseudolikelihood = -5742.0321
Iteration 9:   log pseudolikelihood = -5742.0314
Iteration 10:  log pseudolikelihood = -5742.0311
Iteration 11:  log pseudolikelihood =  -5742.031
Iteration 12:  log pseudolikelihood =  -5742.031
Iteration 13:  log pseudolikelihood =  -5742.031
Iteration 14:  log pseudolikelihood =  -5742.031
Iteration 15:  log pseudolikelihood =  -5742.031
Iteration 16:  log pseudolikelihood =  -5742.031
Iteration 17:  log pseudolikelihood =  -5742.031
Iteration 18:  log pseudolikelihood =  -5742.031
Iteration 19:  log pseudolikelihood =  -5742.031
Iteration 20:  log pseudolikelihood =  -5742.031
Iteration 21:  log pseudolikelihood =  -5742.031
Iteration 22:  log pseudolikelihood =  -5742.031
Iteration 23:  log pseudolikelihood =  -5742.031
Iteration 24:  log pseudolikelihood =  -5742.031
Iteration 25:  log pseudolikelihood =  -5742.031
Iteration 26:  log pseudolikelihood =  -5742.031
Iteration 27:  log pseudolikelihood =  -5742.031
Iteration 28:  log pseudolikelihood =  -5742.031
Iteration 29:  log pseudolikelihood =  -5742.031
Iteration 30:  log pseudolikelihood =  -5742.031
Iteration 31:  log pseudolikelihood =  -5742.031
Iteration 32:  log pseudolikelihood =  -5742.031
Iteration 33:  log pseudolikelihood =  -5742.031
Iteration 34:  log pseudolikelihood =  -5742.031
Iteration 35:  log pseudolikelihood =  -5742.031
Iteration 36:  log pseudolikelihood =  -5742.031
Refining estimates:
Iteration 0:   log pseudolikelihood =  -5742.031
Iteration 1:   log pseudolikelihood =  -5742.031
Iteration 2:   log pseudolikelihood =  -5742.031

Cox regression with Breslow method for ties

No. of subjects =  10,062                             Number of obs =   10,062
No. of failures =     627
Time at risk    = 260,192
                                                      Wald chi2(5)  = 34910.98
Log pseudolikelihood = -5742.031                      Prob > chi2   =   0.0000

                         (Std. err. adjusted for 10,062 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   2.85e-17   6.19e-18  -175.39   0.000     1.86e-17    4.36e-17
    paxlovid  |   1.501082   .6652933     0.92   0.359     .6297147    3.578201
molnupiravir  |   .4858811   .3703309    -0.95   0.344     .1090831    2.164224
              |
          age |   1.000456   .0021413     0.21   0.831     .9962682    1.004662
              |
          sex |
      Female  |   1.011466   .0807494     0.14   0.886     .8649608    1.182786
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1686.2976
Iteration 1:   log pseudolikelihood = -1669.8398
Iteration 2:   log pseudolikelihood = -1669.0696
Iteration 3:   log pseudolikelihood = -1668.8799
Iteration 4:   log pseudolikelihood = -1668.8107
Iteration 5:   log pseudolikelihood = -1668.7852
Iteration 6:   log pseudolikelihood = -1668.7758
Iteration 7:   log pseudolikelihood = -1668.7724
Iteration 8:   log pseudolikelihood = -1668.7711
Iteration 9:   log pseudolikelihood = -1668.7707
Iteration 10:  log pseudolikelihood = -1668.7705
Iteration 11:  log pseudolikelihood = -1668.7704
Iteration 12:  log pseudolikelihood = -1668.7704
Iteration 13:  log pseudolikelihood = -1668.7704
Iteration 14:  log pseudolikelihood = -1668.7704
Iteration 15:  log pseudolikelihood = -1668.7704
Iteration 16:  log pseudolikelihood = -1668.7704
Iteration 17:  log pseudolikelihood = -1668.7704
Iteration 18:  log pseudolikelihood = -1668.7704
Iteration 19:  log pseudolikelihood = -1668.7704
Iteration 20:  log pseudolikelihood = -1668.7704
Iteration 21:  log pseudolikelihood = -1668.7704
Iteration 22:  log pseudolikelihood = -1668.7704
Iteration 23:  log pseudolikelihood = -1668.7704
Iteration 24:  log pseudolikelihood = -1668.7704
Iteration 25:  log pseudolikelihood = -1668.7704
Iteration 26:  log pseudolikelihood = -1668.7704
Iteration 27:  log pseudolikelihood = -1668.7704
Iteration 28:  log pseudolikelihood = -1668.7704
Iteration 29:  log pseudolikelihood = -1668.7704
Iteration 30:  log pseudolikelihood = -1668.7704
Iteration 31:  log pseudolikelihood = -1668.7704
Iteration 32:  log pseudolikelihood = -1668.7704
Iteration 33:  log pseudolikelihood = -1668.7704
Refining estimates:
Iteration 0:   log pseudolikelihood = -1668.7704
Iteration 1:   log pseudolikelihood = -1668.7704

Cox regression with Breslow method for ties

No. of subjects =  3,327                              Number of obs =    3,327
No. of failures =    209
Time at risk    = 86,118
                                                      Wald chi2(36) = 31216.85
Log pseudolikelihood = -1668.7704                     Prob > chi2   =   0.0000

                                        (Std. err. adjusted for 3,327 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   1.34e-15   3.89e-16  -118.20   0.000     7.60e-16    2.37e-15
                  paxlovid  |   1.787473   1.283651     0.81   0.419     .4374818    7.303296
              molnupiravir  |   1.47e-15   4.12e-16  -121.98   0.000     8.50e-16    2.55e-15
                            |
                        age |     1.0004   .0037195     0.11   0.914     .9931363    1.007717
                            |
                        sex |
                    Female  |   .8459098     .11868    -1.19   0.233     .6425421    1.113644
                            |
                 region_nhs |
             East Midlands  |   .7271487   .2195798    -1.06   0.291     .4023303    1.314207
                    London  |   .6287876   .1632834    -1.79   0.074      .377976    1.046029
                North East  |   .6319388   .1896664    -1.53   0.126     .3509138    1.138019
                North West  |   .7833306   .2283457    -0.84   0.402     .4423994    1.386997
                South East  |   .8366957   .2265228    -0.66   0.510     .4921726    1.422386
                South West  |   .6926662   .2058331    -1.24   0.217     .3868837    1.240131
             West Midlands  |   .6965339   .2027879    -1.24   0.214      .393663    1.232423
  Yorkshire and The Humber  |   .5070862   .1640183    -2.10   0.036     .2690039    .9558836
                            |
                      imdq5 |
                         2  |   .9249484   .2088226    -0.35   0.730     .5942162    1.439761
                         3  |    1.28561   .2737329     1.18   0.238     .8469756    1.951406
                         4  |   .8176547    .189281    -0.87   0.384     .5194253    1.287113
           5 most deprived  |   .9726336   .2152673    -0.13   0.900     .6303152    1.500862
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8196777   .1979161    -0.82   0.410     .5106407    1.315742
                            |
         vaccination_status |
           One vaccination  |   .8956332   .2399092    -0.41   0.681     .5298131    1.514041
          Two vaccinations  |   1.430817   .3565042     1.44   0.150     .8780065    2.331689
        Three vaccinations  |   .8693269   .1629671    -0.75   0.455      .602024    1.255314
 Four or more vaccinations  |   .8756218   .2477112    -0.47   0.639     .5029373    1.524471
                            |
                   diabetes |   .6847045   .1910693    -1.36   0.175     .3962527    1.183135
    chronic_cardiac_disease |   .9707177   .2233791    -0.13   0.897     .6183247    1.523945
chronic_respiratory_disease |   .9619298   .2274332    -0.16   0.870     .6051878    1.528962
               hypertension |   .7303249   .1948464    -1.18   0.239     .4329328    1.232003
             downs_syndrome |   .9319935   .1656154    -0.40   0.692     .6578914    1.320297
               solid_cancer |   1.167023   .2476603     0.73   0.467     .7699127    1.768958
               haem_disease |   1.286988   .1809718     1.79   0.073     .9769702    1.695381
              renal_disease |   1.303384   .1941338     1.78   0.075     .9733954    1.745241
              liver_disease |   1.164925   .2530834     0.70   0.482     .7609773    1.783298
               imid_on_drug |   1.072684   .1785339     0.42   0.673     .7741064    1.486425
          immunosuppression |    .785316   .1887113    -1.01   0.315      .490344    1.257732
                   hiv_aids |   .8756563   .1602275    -0.73   0.468     .6117598    1.253391
           organ_transplant |   1.078482   .2383726     0.34   0.732      .699319    1.663224
                 rare_neuro |   1.029237    .148038     0.20   0.841     .7763989    1.364414
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_all==1
Observed time interval: (stop_ae_imae_all[_n-1], stop_ae_imae_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     20,994  observations end on or before enter()
--------------------------------------------------------------------------
      3,201  observations remaining, representing
      3,201  subjects
        842  failures in single-failure-per-subject data
  74,349.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -6668.9303
Iteration 1:   log pseudolikelihood = -6668.0053
Iteration 2:   log pseudolikelihood = -6667.9452
Iteration 3:   log pseudolikelihood = -6667.9447
Iteration 4:   log pseudolikelihood = -6667.9447
Refining estimates:
Iteration 0:   log pseudolikelihood = -6667.9447

Cox regression with Breslow method for ties

No. of subjects =     3,201                             Number of obs =  3,201
No. of failures =       842
Time at risk    = 74,349.25
                                                        Wald chi2(3)  =   1.58
Log pseudolikelihood = -6667.9447                       Prob > chi2   = 0.6634

                          (Std. err. adjusted for 3,201 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.032541    .377996     0.09   0.930     .5038444    2.116011
    paxlovid  |   .4905967   .2866366    -1.22   0.223     .1560992    1.541873
molnupiravir  |   .8794626   .4155444    -0.27   0.786     .3483584    2.220284
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -6668.9303
Iteration 1:   log pseudolikelihood = -6667.5127
Iteration 2:   log pseudolikelihood = -6667.4527
Iteration 3:   log pseudolikelihood = -6667.4522
Iteration 4:   log pseudolikelihood = -6667.4522
Refining estimates:
Iteration 0:   log pseudolikelihood = -6667.4522

Cox regression with Breslow method for ties

No. of subjects =     3,201                             Number of obs =  3,201
No. of failures =       842
Time at risk    = 74,349.25
                                                        Wald chi2(5)  =   2.64
Log pseudolikelihood = -6667.4522                       Prob > chi2   = 0.7545

                          (Std. err. adjusted for 3,201 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |    1.04211   .3822424     0.11   0.910     .5078036    2.138609
    paxlovid  |   .4990721   .2917323    -1.19   0.234     .1587062    1.569396
molnupiravir  |   .8789752   .4154309    -0.27   0.785     .3480747    2.219631
              |
          age |   .9988916   .0017797    -0.62   0.534     .9954096    1.002386
              |
          sex |
      Female  |   1.055955   .0724676     0.79   0.428     .9230589    1.207984
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1963.9546
Iteration 1:   log pseudolikelihood = -1950.1805
Iteration 2:   log pseudolikelihood = -1949.5743
Iteration 3:   log pseudolikelihood = -1949.3866
Iteration 4:   log pseudolikelihood = -1949.3176
Iteration 5:   log pseudolikelihood = -1949.2922
Iteration 6:   log pseudolikelihood = -1949.2829
Iteration 7:   log pseudolikelihood = -1949.2795
Iteration 8:   log pseudolikelihood = -1949.2782
Iteration 9:   log pseudolikelihood = -1949.2777
Iteration 10:  log pseudolikelihood = -1949.2776
Iteration 11:  log pseudolikelihood = -1949.2775
Iteration 12:  log pseudolikelihood = -1949.2775
Iteration 13:  log pseudolikelihood = -1949.2775
Iteration 14:  log pseudolikelihood = -1949.2775
Iteration 15:  log pseudolikelihood = -1949.2775
Iteration 16:  log pseudolikelihood = -1949.2775
Iteration 17:  log pseudolikelihood = -1949.2775
Iteration 18:  log pseudolikelihood = -1949.2775
Iteration 19:  log pseudolikelihood = -1949.2775
Iteration 20:  log pseudolikelihood = -1949.2775
Iteration 21:  log pseudolikelihood = -1949.2775
Iteration 22:  log pseudolikelihood = -1949.2775
Iteration 23:  log pseudolikelihood = -1949.2775
Iteration 24:  log pseudolikelihood = -1949.2775
Iteration 25:  log pseudolikelihood = -1949.2775
Iteration 26:  log pseudolikelihood = -1949.2775
Iteration 27:  log pseudolikelihood = -1949.2775
Iteration 28:  log pseudolikelihood = -1949.2775
Iteration 29:  log pseudolikelihood = -1949.2775
Iteration 30:  log pseudolikelihood = -1949.2775
Refining estimates:
Iteration 0:   log pseudolikelihood = -1949.2775
Iteration 1:   log pseudolikelihood = -1949.2775

Cox regression with Breslow method for ties

No. of subjects =  1,082                               Number of obs =   1,082
No. of failures =    287
Time at risk    = 25,137
                                                       Wald chi2(36) = 6851.81
Log pseudolikelihood = -1949.2775                      Prob > chi2   =  0.0000

                                        (Std. err. adjusted for 1,082 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   1.187993   .6539069     0.31   0.754     .4039121    3.494143
                  paxlovid  |   3.15e-14   1.98e-14   -49.63   0.000     9.24e-15    1.08e-13
              molnupiravir  |   2.96e-14   1.51e-14   -61.34   0.000     1.10e-14    8.02e-14
                            |
                        age |   1.000494   .0030838     0.16   0.873     .9944682    1.006557
                            |
                        sex |
                    Female  |    1.06578   .1299196     0.52   0.601     .8392765    1.353411
                            |
                 region_nhs |
             East Midlands  |   1.341907   .4064132     0.97   0.332     .7411831    2.429514
                    London  |   1.565883   .4288527     1.64   0.102     .9154577    2.678429
                North East  |   1.616042     .47919     1.62   0.106     .9037615    2.889692
                North West  |   1.129305   .3604993     0.38   0.703     .6040724    2.111221
                South East  |   1.813966   .5376898     2.01   0.045     1.014656    3.242944
                South West  |   1.897076   .5677125     2.14   0.032     1.055255    3.410456
             West Midlands  |   1.049355   .3418326     0.15   0.882     .5541657    1.987035
  Yorkshire and The Humber  |   1.467705   .4390213     1.28   0.200     .8166326    2.637856
                            |
                      imdq5 |
                         2  |     1.1825    .240316     0.82   0.409     .7939884    1.761118
                         3  |   1.354745    .268414     1.53   0.125     .9187769    1.997584
                         4  |   1.235663   .2449136     1.07   0.286     .8378929    1.822267
           5 most deprived  |   1.177713   .2300824     0.84   0.402     .8030556    1.727163
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .9918213    .210343    -0.04   0.969     .6545046    1.502983
                            |
         vaccination_status |
           One vaccination  |   1.265071   .2878746     1.03   0.301     .8098761    1.976109
          Two vaccinations  |   1.204514   .2853386     0.79   0.432     .7571291    1.916258
        Three vaccinations  |   1.097548   .1913155     0.53   0.593     .7799184    1.544536
 Four or more vaccinations  |   1.243346   .2955582     0.92   0.360     .7802817     1.98122
                            |
                   diabetes |   .9676824   .1920326    -0.17   0.869     .6558664    1.427744
    chronic_cardiac_disease |   .9781883   .1941824    -0.11   0.912     .6629007    1.443433
chronic_respiratory_disease |    .822658   .1648496    -0.97   0.330     .5554565    1.218397
               hypertension |   .8136634    .178808    -0.94   0.348     .5289169    1.251705
             downs_syndrome |   1.229433   .1768108     1.44   0.151      .927448    1.629748
               solid_cancer |   1.053215   .2123806     0.26   0.797     .7093695     1.56373
               haem_disease |   1.073608   .1286326     0.59   0.553     .8489076    1.357785
              renal_disease |   1.201193    .156417     1.41   0.159     .9306169    1.550439
              liver_disease |   1.016226   .2002263     0.08   0.935      .690683    1.495209
               imid_on_drug |   1.105475   .1609573     0.69   0.491     .8310248    1.470564
          immunosuppression |   .8462498   .1664415    -0.85   0.396     .5755501    1.244268
                   hiv_aids |   1.090786   .1611119     0.59   0.556     .8166103    1.457016
           organ_transplant |   .9498832   .1852755    -0.26   0.792      .648101    1.392188
                 rare_neuro |   1.087026   .1370961     0.66   0.508     .8489575    1.391854
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_serious==1
Observed time interval: (stop_ae_imae_serious[_n-1], stop_ae_imae_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     16,726  observations end on or before enter()
--------------------------------------------------------------------------
      7,469  observations remaining, representing
      7,469  subjects
        792  failures in single-failure-per-subject data
 189,517.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7014.8537
Iteration 1:   log pseudolikelihood =   -7013.17
Iteration 2:   log pseudolikelihood = -7012.7703
Iteration 3:   log pseudolikelihood = -7012.7652
Iteration 4:   log pseudolikelihood = -7012.7652
Refining estimates:
Iteration 0:   log pseudolikelihood = -7012.7652

Cox regression with Breslow method for ties

No. of subjects =      7,469                            Number of obs =  7,469
No. of failures =        792
Time at risk    = 189,517.75
                                                        Wald chi2(3)  =   5.29
Log pseudolikelihood = -7012.7652                       Prob > chi2   = 0.1516

                          (Std. err. adjusted for 7,469 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.965558   .6783645     1.96   0.050     .9993427     3.86596
    paxlovid  |   1.063991   .5505284     0.12   0.905     .3859317    2.933359
molnupiravir  |   1.643466   .6683543     1.22   0.222     .7406269    3.646884
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7014.8537
Iteration 1:   log pseudolikelihood = -7012.4453
Iteration 2:   log pseudolikelihood = -7012.0452
Iteration 3:   log pseudolikelihood = -7012.0401
Iteration 4:   log pseudolikelihood = -7012.0401
Refining estimates:
Iteration 0:   log pseudolikelihood = -7012.0401

Cox regression with Breslow method for ties

No. of subjects =      7,469                            Number of obs =  7,469
No. of failures =        792
Time at risk    = 189,517.75
                                                        Wald chi2(5)  =   6.83
Log pseudolikelihood = -7012.0401                       Prob > chi2   = 0.2340

                          (Std. err. adjusted for 7,469 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.982246   .6838471     1.98   0.047     1.008103    3.897716
    paxlovid  |    1.07017   .5538346     0.13   0.896     .3880954    2.950984
molnupiravir  |   1.625686   .6614531     1.19   0.232     .7323232    3.608863
              |
          age |   .9978432   .0018494    -1.17   0.244     .9942251    1.001474
              |
          sex |
      Female  |   .9732678   .0689837    -0.38   0.702     .8470334    1.118315
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2149.1902
Iteration 1:   log pseudolikelihood = -2133.2578
Iteration 2:   log pseudolikelihood = -2132.5498
Iteration 3:   log pseudolikelihood = -2132.5349
Iteration 4:   log pseudolikelihood = -2132.5349
Refining estimates:
Iteration 0:   log pseudolikelihood = -2132.5349

Cox regression with Breslow method for ties

No. of subjects =  2,490                                Number of obs =  2,490
No. of failures =    277
Time at risk    = 63,092
                                                        Wald chi2(36) =  35.78
Log pseudolikelihood = -2132.5349                       Prob > chi2   = 0.4792

                                        (Std. err. adjusted for 2,490 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.313235   1.289116     1.50   0.132     .7760032    6.895661
                  paxlovid  |   .8215939   .8444583    -0.19   0.848     .1095891    6.159523
              molnupiravir  |   2.235342   1.658127     1.08   0.278     .5223258    9.566355
                            |
                        age |   .9997399    .003051    -0.09   0.932     .9937779    1.005738
                            |
                        sex |
                    Female  |   1.076429   .1327675     0.60   0.550     .8452737    1.370797
                            |
                 region_nhs |
             East Midlands  |   1.268589   .3647632     0.83   0.408     .7220559    2.228798
                    London  |   1.447339   .3620558     1.48   0.139     .8864208    2.363201
                North East  |    1.20202   .3512471     0.63   0.529     .6779199    2.131301
                North West  |   1.015266   .3022065     0.05   0.959     .5665118    1.819494
                South East  |   1.165798   .3361085     0.53   0.595     .6625451     2.05131
                South West  |   1.482148   .4137807     1.41   0.159     .8575435    2.561692
             West Midlands  |   .6638929   .2228786    -1.22   0.222     .3438248    1.281914
  Yorkshire and The Humber  |   1.081193   .3169799     0.27   0.790     .6086271     1.92068
                            |
                      imdq5 |
                         2  |   1.322807   .2528043     1.46   0.143     .9095398     1.92385
                         3  |   1.062909   .2212724     0.29   0.769     .7067994    1.598439
                         4  |   1.327371   .2612374     1.44   0.150     .9025448    1.952161
           5 most deprived  |    1.09914   .2181417     0.48   0.634     .7449355    1.621763
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8320072   .1820987    -0.84   0.401     .5417855    1.277694
                            |
         vaccination_status |
           One vaccination  |   1.183968    .275101     0.73   0.467     .7508602      1.8669
          Two vaccinations  |   1.206907   .2885528     0.79   0.432     .7553789    1.928337
        Three vaccinations  |   1.140844   .1925183     0.78   0.435     .8195682    1.588061
 Four or more vaccinations  |   .9764774   .2511769    -0.09   0.926     .5898068    1.616645
                            |
                   diabetes |   .9447275   .2039335    -0.26   0.792     .6188167    1.442285
    chronic_cardiac_disease |   1.013596   .1967207     0.07   0.945     .6928862    1.482749
chronic_respiratory_disease |   1.079419   .2115487     0.39   0.697     .7351369    1.584936
               hypertension |   .7768836   .1812326    -1.08   0.279     .4917975    1.227229
             downs_syndrome |   1.191328   .1708182     1.22   0.222     .8994603    1.577904
               solid_cancer |   1.052445   .2032519     0.26   0.791      .720796    1.536691
               haem_disease |   .9595952   .1169019    -0.34   0.735     .7557726    1.218386
              renal_disease |   .9500885   .1241029    -0.39   0.695     .7354921    1.227298
              liver_disease |   1.255659    .253782     1.13   0.260     .8449573    1.865987
               imid_on_drug |   1.228389   .1782063     1.42   0.156     .9243772    1.632384
          immunosuppression |   1.206211   .2231309     1.01   0.311     .8393903    1.733337
                   hiv_aids |   .7091291   .1232436    -1.98   0.048     .5044175    .9969206
           organ_transplant |   1.159603   .2389624     0.72   0.472     .7742839    1.736676
                 rare_neuro |   1.071516   .1342047     0.55   0.581     .8382771    1.369649
---------------------------------------------------------------------------------------------

. postclose `cox_model_summary'

. 
. tempname cox_model_disease

. postfile `cox_model_disease' str20(model) str20(failure) ///
>         hr_sot lc_sot uc_sot hr_pax lc_pax uc_pax hr_mol lc_mol uc_mol ///
>         using "$projectdir/output/tables/cox_model_disease", replace                                                     

. foreach fail in $ae_diseaseae_ $ae_disease_serious {
  2.         stset stop_`fail', id(patient_id) origin(time start_date_delay) enter(time start_date_delay) failure(fail_`fail'==1) 
  3.         foreach model in crude agesex adj {
  4.                 stcox $`model', vce(robust)
  5.                                         matrix b = r(table)
  6.                                         local hr_sot = b[1,2]
  7.                                         local lc_sot = b[5,2]
  8.                                         local uc_sot = b[6,2]
  9.                                         local hr_pax = b[1,3]
 10.                                         local lc_pax = b[5,3]
 11.                                         local uc_pax = b[6,3]
 12.                                         local hr_mol = b[1,4]
 13.                                         local lc_mol = b[5,4]
 14.                                         local uc_mol = b[6,4]                   
 15.                 post `cox_model_disease' ("`model'") ("`fail'") (`hr_sot') (`lc_sot') (`uc_sot') (`hr_pax') (`lc_pax') (`uc_pax') (`hr_mol') (`lc_mol') (`uc_mol')      
>                         
 16. }
 17. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_diverticulitis_serious==1
Observed time interval: (stop_ae_diverticulitis_serious[_n-1], stop_ae_diverticulitis_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     10,373  observations end on or before enter()
--------------------------------------------------------------------------
     13,822  observations remaining, representing
     13,822  subjects
        318  failures in single-failure-per-subject data
    362,499  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3022.1304
Iteration 1:   log pseudolikelihood = -3020.7913
Iteration 2:   log pseudolikelihood = -3020.4156
Iteration 3:   log pseudolikelihood = -3020.2973
Iteration 4:   log pseudolikelihood = -3020.2539
Iteration 5:   log pseudolikelihood = -3020.2379
Iteration 6:   log pseudolikelihood =  -3020.232
Iteration 7:   log pseudolikelihood = -3020.2299
Iteration 8:   log pseudolikelihood = -3020.2291
Iteration 9:   log pseudolikelihood = -3020.2288
Iteration 10:  log pseudolikelihood = -3020.2287
Iteration 11:  log pseudolikelihood = -3020.2286
Iteration 12:  log pseudolikelihood = -3020.2286
Iteration 13:  log pseudolikelihood = -3020.2286
Iteration 14:  log pseudolikelihood = -3020.2286
Iteration 15:  log pseudolikelihood = -3020.2286
Iteration 16:  log pseudolikelihood = -3020.2286
Iteration 17:  log pseudolikelihood = -3020.2286
Iteration 18:  log pseudolikelihood = -3020.2286
Iteration 19:  log pseudolikelihood = -3020.2286
Iteration 20:  log pseudolikelihood = -3020.2286
Iteration 21:  log pseudolikelihood = -3020.2286
Iteration 22:  log pseudolikelihood = -3020.2286
Iteration 23:  log pseudolikelihood = -3020.2286
Iteration 24:  log pseudolikelihood = -3020.2286
Iteration 25:  log pseudolikelihood = -3020.2286
Iteration 26:  log pseudolikelihood = -3020.2286
Iteration 27:  log pseudolikelihood = -3020.2286
Iteration 28:  log pseudolikelihood = -3020.2286
Iteration 29:  log pseudolikelihood = -3020.2286
Refining estimates:
Iteration 0:   log pseudolikelihood = -3020.2286
Iteration 1:   log pseudolikelihood = -3020.2286

Cox regression with Breslow method for ties

No. of subjects =  13,822                             Number of obs =   13,822
No. of failures =     318
Time at risk    = 362,499
                                                      Wald chi2(3)  = 44947.57
Log pseudolikelihood = -3020.2286                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 13,822 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   9.33e-14   1.32e-14  -211.69   0.000     7.06e-14    1.23e-13
    paxlovid  |   1.565969   1.109123     0.63   0.527     .3907562    6.275674
molnupiravir  |   1.683022   .9752732     0.90   0.369     .5405523    5.240128
-------------------------------------------------------------------------------

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3022.1304
Iteration 1:   log pseudolikelihood = -3020.3591
Iteration 2:   log pseudolikelihood = -3019.9834
Iteration 3:   log pseudolikelihood = -3019.8651
Iteration 4:   log pseudolikelihood = -3019.8217
Iteration 5:   log pseudolikelihood = -3019.8057
Iteration 6:   log pseudolikelihood = -3019.7999
Iteration 7:   log pseudolikelihood = -3019.7977
Iteration 8:   log pseudolikelihood = -3019.7969
Iteration 9:   log pseudolikelihood = -3019.7966
Iteration 10:  log pseudolikelihood = -3019.7965
Iteration 11:  log pseudolikelihood = -3019.7965
Iteration 12:  log pseudolikelihood = -3019.7965
Iteration 13:  log pseudolikelihood = -3019.7964
Iteration 14:  log pseudolikelihood = -3019.7964
Iteration 15:  log pseudolikelihood = -3019.7964
Iteration 16:  log pseudolikelihood = -3019.7964
Iteration 17:  log pseudolikelihood = -3019.7964
Iteration 18:  log pseudolikelihood = -3019.7964
Iteration 19:  log pseudolikelihood = -3019.7964
Iteration 20:  log pseudolikelihood = -3019.7964
Iteration 21:  log pseudolikelihood = -3019.7964
Iteration 22:  log pseudolikelihood = -3019.7964
Iteration 23:  log pseudolikelihood = -3019.7964
Iteration 24:  log pseudolikelihood = -3019.7964
Iteration 25:  log pseudolikelihood = -3019.7964
Iteration 26:  log pseudolikelihood = -3019.7964
Iteration 27:  log pseudolikelihood = -3019.7964
Iteration 28:  log pseudolikelihood = -3019.7964
Iteration 29:  log pseudolikelihood = -3019.7964
Iteration 30:  log pseudolikelihood = -3019.7964
Iteration 31:  log pseudolikelihood = -3019.7964
Iteration 32:  log pseudolikelihood = -3019.7964
Iteration 33:  log pseudolikelihood = -3019.7964
Iteration 34:  log pseudolikelihood = -3019.7964
Iteration 35:  log pseudolikelihood = -3019.7964
Iteration 36:  log pseudolikelihood = -3019.7964
Iteration 37:  log pseudolikelihood = -3019.7964
Iteration 38:  log pseudolikelihood = -3019.7964
Iteration 39:  log pseudolikelihood = -3019.7964
Iteration 40:  log pseudolikelihood = -3019.7964
Iteration 41:  log pseudolikelihood = -3019.7964
Iteration 42:  log pseudolikelihood = -3019.7964
Iteration 43:  log pseudolikelihood = -3019.7964
Iteration 44:  log pseudolikelihood = -3019.7964
Iteration 45:  log pseudolikelihood = -3019.7964
Refining estimates:
Iteration 0:   log pseudolikelihood = -3019.7964

Cox regression with Breslow method for ties

No. of subjects =  13,822                               Number of obs = 13,822
No. of failures =     318
Time at risk    = 362,499
                                                        Wald chi2(4)  =   1.92
Log pseudolikelihood = -3019.7964                       Prob > chi2   = 0.7513

                         (Std. err. adjusted for 13,822 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   2.84e-20          .        .       .            .           .
    paxlovid  |   1.566028   1.111111     0.63   0.527     .3898203    6.291219
molnupiravir  |   1.685189   .9750563     0.90   0.367     .5421763    5.237895
              |
          age |   .9987673   .0030135    -0.41   0.683     .9928783    1.004691
              |
          sex |
      Female  |   .9107664   .1022382    -0.83   0.405     .7308955    1.134903
-------------------------------------------------------------------------------

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -873.60064
Iteration 1:   log pseudolikelihood = -859.32025
Iteration 2:   log pseudolikelihood = -858.58247
Iteration 3:   log pseudolikelihood =  -858.5261
Iteration 4:   log pseudolikelihood = -858.51315
Iteration 5:   log pseudolikelihood = -858.50845
Iteration 6:   log pseudolikelihood = -858.50672
Iteration 7:   log pseudolikelihood = -858.50608
Iteration 8:   log pseudolikelihood = -858.50585
Iteration 9:   log pseudolikelihood = -858.50576
Iteration 10:  log pseudolikelihood = -858.50573
Iteration 11:  log pseudolikelihood = -858.50572
Iteration 12:  log pseudolikelihood = -858.50571
Iteration 13:  log pseudolikelihood = -858.50571
Iteration 14:  log pseudolikelihood = -858.50571
Iteration 15:  log pseudolikelihood = -858.50571
Iteration 16:  log pseudolikelihood = -858.50571
Iteration 17:  log pseudolikelihood = -858.50571
Iteration 18:  log pseudolikelihood = -858.50571
Iteration 19:  log pseudolikelihood = -858.50571
Iteration 20:  log pseudolikelihood = -858.50571
Iteration 21:  log pseudolikelihood = -858.50571
Iteration 22:  log pseudolikelihood = -858.50571
Iteration 23:  log pseudolikelihood = -858.50571
Iteration 24:  log pseudolikelihood = -858.50571
Iteration 25:  log pseudolikelihood = -858.50571
Iteration 26:  log pseudolikelihood = -858.50571
Iteration 27:  log pseudolikelihood = -858.50571
Iteration 28:  log pseudolikelihood = -858.50571
Iteration 29:  log pseudolikelihood = -858.50571
Iteration 30:  log pseudolikelihood = -858.50571
Iteration 31:  log pseudolikelihood = -858.50571
Iteration 32:  log pseudolikelihood = -858.50571
Iteration 33:  log pseudolikelihood = -858.50571
Refining estimates:
Iteration 0:   log pseudolikelihood = -858.50571
Iteration 1:   log pseudolikelihood = -858.50571
Iteration 2:   log pseudolikelihood = -858.50571

Cox regression with Breslow method for ties

No. of subjects =   4,573                             Number of obs =    4,573
No. of failures =     104
Time at risk    = 120,065
                                                      Wald chi2(36) = 16045.19
Log pseudolikelihood = -858.50571                     Prob > chi2   =   0.0000

                                        (Std. err. adjusted for 4,573 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   5.15e-16   1.64e-16  -110.87   0.000     2.76e-16    9.60e-16
                  paxlovid  |   2.429295   2.361062     0.91   0.361     .3615654    16.32201
              molnupiravir  |   1.910353   1.976369     0.63   0.532     .2514763    14.51209
                            |
                        age |   1.001292   .0053915     0.24   0.810     .9907808    1.011916
                            |
                        sex |
                    Female  |    1.10597   .2180902     0.51   0.610     .7514355    1.627776
                            |
                 region_nhs |
             East Midlands  |   .7647082   .3021726    -0.68   0.497      .352489    1.658998
                    London  |   .5808267   .2069521    -1.52   0.127     .2889071     1.16771
                North East  |   .7101194   .2782795    -0.87   0.382     .3294314    1.530727
                North West  |     .70138   .2769714    -0.90   0.369     .3234583    1.520858
                South East  |   .7370686   .2799837    -0.80   0.422     .3500819    1.551837
                South West  |   .5000658    .220929    -1.57   0.117     .2103615    1.188743
             West Midlands  |   .3988215   .1825076    -2.01   0.045     .1626501    .9779192
  Yorkshire and The Humber  |   .3282745   .1594823    -2.29   0.022     .1266795     .850683
                            |
                      imdq5 |
                         2  |   1.128949   .3456561     0.40   0.692     .6195231    2.057269
                         3  |   .9185287   .3038642    -0.26   0.797     .4802877    1.756645
                         4  |   .8606381   .2771553    -0.47   0.641     .4578299    1.617845
           5 most deprived  |   1.208343    .365287     0.63   0.531      .668142    2.185305
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8572487    .319939    -0.41   0.680     .4125007    1.781513
                            |
         vaccination_status |
           One vaccination  |   1.255373   .4159314     0.69   0.492     .6557703    2.403221
          Two vaccinations  |   .5847753   .2557027    -1.23   0.220     .2481915    1.377816
        Three vaccinations  |   .7751207   .1956724    -1.01   0.313      .472597    1.271299
 Four or more vaccinations  |   .6633952   .2715323    -1.00   0.316     .2974196    1.479705
                            |
                   diabetes |   .5526397   .2328504    -1.41   0.159     .2419887    1.262087
    chronic_cardiac_disease |   1.097358   .3441937     0.30   0.767     .5934213     2.02924
chronic_respiratory_disease |   .9151232   .3086298    -0.26   0.793     .4725063    1.772358
               hypertension |   .6840888   .2697659    -0.96   0.336     .3158252    1.481761
             downs_syndrome |   .6527203   .1823449    -1.53   0.127      .377515    1.128548
               solid_cancer |   .9489456   .3251086    -0.15   0.878     .4848639    1.857218
               haem_disease |   1.273134     .25432     1.21   0.227     .8606741    1.883255
              renal_disease |   .8849845   .1872401    -0.58   0.564      .584579    1.339763
              liver_disease |   1.488481   .4898733     1.21   0.227     .7809166    2.837147
               imid_on_drug |   1.045123   .2445017     0.19   0.850     .6607436    1.653112
          immunosuppression |   1.298197   .3642542     0.93   0.352     .7490425     2.24996
                   hiv_aids |   1.012926   .2499909     0.05   0.958     .6244542    1.643066
           organ_transplant |   1.408806   .4670164     1.03   0.301     .7356637    2.697881
                 rare_neuro |   1.048466   .2114448     0.23   0.814     .7061417    1.556742
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_diarrhoea_serious==1
Observed time interval: (stop_ae_diarrhoea_serious[_n-1], stop_ae_diarrhoea_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     12,477  observations end on or before enter()
--------------------------------------------------------------------------
     11,718  observations remaining, representing
     11,718  subjects
        578  failures in single-failure-per-subject data
    303,881  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5387.4512
Iteration 1:   log pseudolikelihood = -5386.2292
Iteration 2:   log pseudolikelihood = -5386.0552
Iteration 3:   log pseudolikelihood = -5386.0531
Iteration 4:   log pseudolikelihood = -5386.0531
Refining estimates:
Iteration 0:   log pseudolikelihood = -5386.0531

Cox regression with Breslow method for ties

No. of subjects =  11,718                               Number of obs = 11,718
No. of failures =     578
Time at risk    = 303,881
                                                        Wald chi2(3)  =   2.64
Log pseudolikelihood = -5386.0531                       Prob > chi2   = 0.4507

                         (Std. err. adjusted for 11,718 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.825757   .8976007     1.22   0.221     .6965706     4.78543
    paxlovid  |   .3932433   .3999883    -0.92   0.359     .0535624    2.887107
molnupiravir  |   .8528178   .4544364    -0.30   0.765     .3001104    2.423435
-------------------------------------------------------------------------------

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5387.4512
Iteration 1:   log pseudolikelihood = -5386.0384
Iteration 2:   log pseudolikelihood = -5385.8643
Iteration 3:   log pseudolikelihood = -5385.8622
Iteration 4:   log pseudolikelihood = -5385.8622
Refining estimates:
Iteration 0:   log pseudolikelihood = -5385.8622

Cox regression with Breslow method for ties

No. of subjects =  11,718                               Number of obs = 11,718
No. of failures =     578
Time at risk    = 303,881
                                                        Wald chi2(5)  =   3.03
Log pseudolikelihood = -5385.8622                       Prob > chi2   = 0.6959

                         (Std. err. adjusted for 11,718 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.834471   .9019947     1.23   0.217     .6998126    4.808834
    paxlovid  |   .3953172     .40209    -0.91   0.362     .0538469    2.902222
molnupiravir  |   .8510675   .4534763    -0.30   0.762     .2995134    2.418309
              |
          age |   .9986473   .0021667    -0.62   0.533     .9944096    1.002903
              |
          sex |
      Female  |   1.004271   .0834726     0.05   0.959     .8532991    1.181955
-------------------------------------------------------------------------------

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1416.0613
Iteration 1:   log pseudolikelihood = -1394.9223
Iteration 2:   log pseudolikelihood = -1393.6845
Iteration 3:   log pseudolikelihood = -1393.5694
Iteration 4:   log pseudolikelihood = -1393.5493
Iteration 5:   log pseudolikelihood = -1393.5421
Iteration 6:   log pseudolikelihood = -1393.5395
Iteration 7:   log pseudolikelihood = -1393.5385
Iteration 8:   log pseudolikelihood = -1393.5382
Iteration 9:   log pseudolikelihood =  -1393.538
Iteration 10:  log pseudolikelihood =  -1393.538
Iteration 11:  log pseudolikelihood =  -1393.538
Iteration 12:  log pseudolikelihood =  -1393.538
Iteration 13:  log pseudolikelihood = -1393.5379
Iteration 14:  log pseudolikelihood = -1393.5379
Iteration 15:  log pseudolikelihood = -1393.5379
Iteration 16:  log pseudolikelihood = -1393.5379
Iteration 17:  log pseudolikelihood = -1393.5379
Iteration 18:  log pseudolikelihood = -1393.5379
Iteration 19:  log pseudolikelihood = -1393.5379
Iteration 20:  log pseudolikelihood = -1393.5379
Iteration 21:  log pseudolikelihood = -1393.5379
Iteration 22:  log pseudolikelihood = -1393.5379
Iteration 23:  log pseudolikelihood = -1393.5379
Iteration 24:  log pseudolikelihood = -1393.5379
Iteration 25:  log pseudolikelihood = -1393.5379
Iteration 26:  log pseudolikelihood = -1393.5379
Iteration 27:  log pseudolikelihood = -1393.5379
Iteration 28:  log pseudolikelihood = -1393.5379
Iteration 29:  log pseudolikelihood = -1393.5379
Refining estimates:
Iteration 0:   log pseudolikelihood = -1393.5379
Iteration 1:   log pseudolikelihood = -1393.5379
Iteration 2:   log pseudolikelihood = -1393.5379

Cox regression with Breslow method for ties

No. of subjects =   3,898                             Number of obs =    3,898
No. of failures =     172
Time at risk    = 101,416
                                                      Wald chi2(36) = 12630.09
Log pseudolikelihood = -1393.5379                     Prob > chi2   =   0.0000

                                        (Std. err. adjusted for 3,898 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   3.198721   2.286315     1.63   0.104     .7880839    12.98316
                  paxlovid  |   3.64e-14   1.10e-14  -102.74   0.000     2.01e-14    6.56e-14
              molnupiravir  |   .8007456   .8205712    -0.22   0.828     .1074529    5.967204
                            |
                        age |    1.00346   .0037714     0.92   0.358     .9960949    1.010879
                            |
                        sex |
                    Female  |   1.005309   .1536655     0.03   0.972     .7450579    1.356467
                            |
                 region_nhs |
             East Midlands  |   1.921275   .7127405     1.76   0.078     .9285753    3.975228
                    London  |   .9055811   .3327337    -0.27   0.787     .4407316    1.860718
                North East  |   1.617928   .6094495     1.28   0.201     .7732578    3.385277
                North West  |   2.158145   .7814773     2.12   0.034     1.061342    4.388396
                South East  |   1.404635   .5311246     0.90   0.369      .669429    2.947286
                South West  |    1.08816   .4473613     0.21   0.837     .4861266    2.435771
             West Midlands  |   1.065833   .4288341     0.16   0.874      .484408    2.345131
  Yorkshire and The Humber  |   2.003294   .7261427     1.92   0.055     .9844776    4.076462
                            |
                      imdq5 |
                         2  |   .9226039   .2384758    -0.31   0.755     .5558986    1.531211
                         3  |   1.054935   .2596375     0.22   0.828     .6512241    1.708917
                         4  |   1.090072   .2686785     0.35   0.726     .6724389    1.767085
           5 most deprived  |   1.169357   .2806188     0.65   0.514     .7305973    1.871612
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8066956   .2223437    -0.78   0.436     .4700014    1.384587
                            |
         vaccination_status |
           One vaccination  |   1.107261   .3332094     0.34   0.735     .6138992    1.997116
          Two vaccinations  |   1.246554   .3699812     0.74   0.458     .6967419    2.230234
        Three vaccinations  |   1.132196   .2406973     0.58   0.559     .7463831    1.717439
 Four or more vaccinations  |   1.345673    .396595     1.01   0.314      .755222    2.397754
                            |
                   diabetes |    .674046   .2087605    -1.27   0.203     .3673345    1.236851
    chronic_cardiac_disease |   1.670726   .3687639     2.33   0.020     1.083995    2.575035
chronic_respiratory_disease |   1.345445   .3162675     1.26   0.207     .8487465    2.132819
               hypertension |   1.224065   .2965399     0.83   0.404     .7613668    1.967955
             downs_syndrome |   .7029707   .1527562    -1.62   0.105     .4591666    1.076228
               solid_cancer |   .5677799    .179176    -1.79   0.073     .3058889    1.053892
               haem_disease |   1.047587   .1605195     0.30   0.762     .7758225    1.414549
              renal_disease |   .8676608   .1484821    -0.83   0.407     .6204182    1.213432
              liver_disease |   .9458663   .2444321    -0.22   0.829     .5699819    1.569634
               imid_on_drug |   1.095388   .1951022     0.51   0.609     .7726061    1.553021
          immunosuppression |   1.049604   .2405331     0.21   0.833     .6698218    1.644718
                   hiv_aids |   1.169724   .2179892     0.84   0.400     .8118095    1.685439
           organ_transplant |   1.007542   .2660616     0.03   0.977     .6004629    1.690596
                 rare_neuro |   .8919734    .138184    -0.74   0.461     .6583916    1.208424
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_taste_serious==1
Observed time interval: (stop_ae_taste_serious[_n-1], stop_ae_taste_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     10,322  observations end on or before enter()
--------------------------------------------------------------------------
     13,873  observations remaining, representing
     13,873  subjects
        347  failures in single-failure-per-subject data
 362,840.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3299.0911
Iteration 1:   log pseudolikelihood = -3296.5163
Iteration 2:   log pseudolikelihood = -3296.4367
Iteration 3:   log pseudolikelihood = -3296.4362
Iteration 4:   log pseudolikelihood = -3296.4362
Refining estimates:
Iteration 0:   log pseudolikelihood = -3296.4362

Cox regression with Breslow method for ties

No. of subjects =     13,873                            Number of obs = 13,873
No. of failures =        347
Time at risk    = 362,840.25
                                                        Wald chi2(3)  =   7.27
Log pseudolikelihood = -3296.4362                       Prob > chi2   = 0.0636

                         (Std. err. adjusted for 13,873 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   3.146498    1.41212     2.55   0.011     1.305617    7.582965
    paxlovid  |   .7223372   .7291308    -0.32   0.747     .0998925    5.223325
molnupiravir  |   1.622204   .9525194     0.82   0.410     .5132163    5.127559
-------------------------------------------------------------------------------

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3299.0911
Iteration 1:   log pseudolikelihood = -3298.4265
Iteration 2:   log pseudolikelihood = -3295.4415
Iteration 3:   log pseudolikelihood = -3295.1363
Iteration 4:   log pseudolikelihood = -3295.1302
Iteration 5:   log pseudolikelihood = -3295.1302
Refining estimates:
Iteration 0:   log pseudolikelihood = -3295.1302

Cox regression with Breslow method for ties

No. of subjects =     13,873                            Number of obs = 13,873
No. of failures =        347
Time at risk    = 362,840.25
                                                        Wald chi2(5)  =  10.67
Log pseudolikelihood = -3295.1302                       Prob > chi2   = 0.0584

                         (Std. err. adjusted for 13,873 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   3.162504   1.421953     2.56   0.010     1.310105    7.634065
    paxlovid  |   .7257532   .7325778    -0.32   0.751     .1003652    5.248011
molnupiravir  |      1.617   .9492785     0.82   0.413     .5116845    5.109963
              |
          age |   1.000598   .0028619     0.21   0.834     .9950044    1.006223
              |
          sex |
      Female  |   1.188321   .1281596     1.60   0.110      .961905    1.468031
-------------------------------------------------------------------------------

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1000.7082
Iteration 1:   log pseudolikelihood = -984.10393
Iteration 2:   log pseudolikelihood = -975.48186
Iteration 3:   log pseudolikelihood = -975.14134
Iteration 4:   log pseudolikelihood = -975.13687
Iteration 5:   log pseudolikelihood = -975.13687
Refining estimates:
Iteration 0:   log pseudolikelihood = -975.13687

Cox regression with Breslow method for ties

No. of subjects =      4,623                            Number of obs =  4,623
No. of failures =        119
Time at risk    = 121,149.75
                                                        Wald chi2(36) =  69.81
Log pseudolikelihood = -975.13687                       Prob > chi2   = 0.0006

                                        (Std. err. adjusted for 4,623 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |    7.14981   4.280364     3.29   0.001     2.211603    23.11436
                  paxlovid  |   2.441886   2.551655     0.85   0.393     .3149634    18.93175
              molnupiravir  |   2.549996   2.634471     0.91   0.365     .3366197    19.31699
                            |
                        age |   1.001917   .0049418     0.39   0.698     .9922774    1.011649
                            |
                        sex |
                    Female  |   1.023166   .1897015     0.12   0.902     .7114227    1.471513
                            |
                 region_nhs |
             East Midlands  |   1.049641   .3843599     0.13   0.895     .5120897    2.151472
                    London  |   .9163268   .3063434    -0.26   0.794     .4758603    1.764499
                North East  |   .8286896   .3159793    -0.49   0.622     .3924902    1.749665
                North West  |   .6370008   .2727155    -1.05   0.292     .2752453    1.474212
                South East  |   .5711506   .2461587    -1.30   0.194     .2454107    1.329253
                South West  |    .678149   .2933627    -0.90   0.369     .2904699    1.583249
             West Midlands  |   .6744293   .2788695    -0.95   0.341      .299898    1.516699
  Yorkshire and The Humber  |    .695367   .2810773    -0.90   0.369     .3148808    1.535614
                            |
                      imdq5 |
                         2  |   1.433771   .4426159     1.17   0.243     .7829021    2.625743
                         3  |   1.471949   .4604658     1.24   0.217     .7972851    2.717514
                         4  |   .9766893   .3263381    -0.07   0.944     .5073961    1.880034
           5 most deprived  |   1.507558   .4615737     1.34   0.180     .8272922    2.747192
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8194612   .2856738    -0.57   0.568     .4137991    1.622808
                            |
         vaccination_status |
           One vaccination  |   .6833237   .3039671    -0.86   0.392     .2857468    1.634074
          Two vaccinations  |   1.035895   .4129754     0.09   0.930      .474211    2.262873
        Three vaccinations  |   1.469048    .389339     1.45   0.147     .8738634     2.46961
 Four or more vaccinations  |   1.293992   .4876796     0.68   0.494     .6182026    2.708522
                            |
                   diabetes |   .4587642   .1922969    -1.86   0.063     .2017425    1.043234
    chronic_cardiac_disease |   .2943003   .1508628    -2.39   0.017     .1077586    .8037659
chronic_respiratory_disease |   .5328283   .2122243    -1.58   0.114     .2440931    1.163105
               hypertension |   .7087698   .2616625    -0.93   0.351     .3437637    1.461337
             downs_syndrome |   .8331298   .2030539    -0.75   0.454     .5167188    1.343294
               solid_cancer |   1.622834   .4189978     1.88   0.061     .9783702    2.691813
               haem_disease |   .8679422   .1600944    -0.77   0.443     .6046225    1.245941
              renal_disease |    .944513   .1890498    -0.29   0.775      .638021    1.398237
              liver_disease |   1.153909   .3678732     0.45   0.653     .6177367    2.155459
               imid_on_drug |   1.109098   .2392363     0.48   0.631     .7267126    1.692689
          immunosuppression |   .7093359    .237965    -1.02   0.306     .3675314    1.369019
                   hiv_aids |   1.478126   .3131866     1.84   0.065     .9757941    2.239055
           organ_transplant |   1.357272   .4447904     0.93   0.351     .7140364    2.579962
                 rare_neuro |   .7778495   .1420494    -1.38   0.169     .5438145    1.112603
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_rash_serious==1
Observed time interval: (stop_ae_rash_serious[_n-1], stop_ae_rash_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     10,358  observations end on or before enter()
--------------------------------------------------------------------------
     13,837  observations remaining, representing
     13,837  subjects
        308  failures in single-failure-per-subject data
    362,835  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -2927.5063
Iteration 1:   log pseudolikelihood =  -2926.464
Iteration 2:   log pseudolikelihood = -2926.1574
Iteration 3:   log pseudolikelihood =  -2926.048
Iteration 4:   log pseudolikelihood = -2926.0077
Iteration 5:   log pseudolikelihood = -2925.9929
Iteration 6:   log pseudolikelihood = -2925.9875
Iteration 7:   log pseudolikelihood = -2925.9855
Iteration 8:   log pseudolikelihood = -2925.9847
Iteration 9:   log pseudolikelihood = -2925.9845
Iteration 10:  log pseudolikelihood = -2925.9844
Iteration 11:  log pseudolikelihood = -2925.9843
Iteration 12:  log pseudolikelihood = -2925.9843
Iteration 13:  log pseudolikelihood = -2925.9843
Iteration 14:  log pseudolikelihood = -2925.9843
Iteration 15:  log pseudolikelihood = -2925.9843
Iteration 16:  log pseudolikelihood = -2925.9843
Iteration 17:  log pseudolikelihood = -2925.9843
Iteration 18:  log pseudolikelihood = -2925.9843
Iteration 19:  log pseudolikelihood = -2925.9843
Iteration 20:  log pseudolikelihood = -2925.9843
Iteration 21:  log pseudolikelihood = -2925.9843
Iteration 22:  log pseudolikelihood = -2925.9843
Iteration 23:  log pseudolikelihood = -2925.9843
Iteration 24:  log pseudolikelihood = -2925.9843
Iteration 25:  log pseudolikelihood = -2925.9843
Iteration 26:  log pseudolikelihood = -2925.9843
Iteration 27:  log pseudolikelihood = -2925.9843
Iteration 28:  log pseudolikelihood = -2925.9843
Iteration 29:  log pseudolikelihood = -2925.9843
Refining estimates:
Iteration 0:   log pseudolikelihood = -2925.9843
Iteration 1:   log pseudolikelihood = -2925.9843

Cox regression with Breslow method for ties

No. of subjects =  13,837                             Number of obs =   13,837
No. of failures =     308
Time at risk    = 362,835
                                                      Wald chi2(3)  = 43048.43
Log pseudolikelihood = -2925.9843                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 13,837 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |     .72057   .7210108    -0.33   0.743     .1013804    5.121514
    paxlovid  |   9.26e-14   1.34e-14  -207.40   0.000     6.97e-14    1.23e-13
molnupiravir  |   .5802839   .5791378    -0.55   0.586     .0820579    4.103561
-------------------------------------------------------------------------------

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -2927.5063
Iteration 1:   log pseudolikelihood = -2925.6804
Iteration 2:   log pseudolikelihood = -2925.3738
Iteration 3:   log pseudolikelihood = -2925.2643
Iteration 4:   log pseudolikelihood = -2925.2241
Iteration 5:   log pseudolikelihood = -2925.2093
Iteration 6:   log pseudolikelihood = -2925.2038
Iteration 7:   log pseudolikelihood = -2925.2018
Iteration 8:   log pseudolikelihood = -2925.2011
Iteration 9:   log pseudolikelihood = -2925.2008
Iteration 10:  log pseudolikelihood = -2925.2007
Iteration 11:  log pseudolikelihood = -2925.2007
Iteration 12:  log pseudolikelihood = -2925.2007
Iteration 13:  log pseudolikelihood = -2925.2007
Iteration 14:  log pseudolikelihood = -2925.2007
Iteration 15:  log pseudolikelihood = -2925.2007
Iteration 16:  log pseudolikelihood = -2925.2007
Iteration 17:  log pseudolikelihood = -2925.2007
Iteration 18:  log pseudolikelihood = -2925.2007
Iteration 19:  log pseudolikelihood = -2925.2007
Iteration 20:  log pseudolikelihood = -2925.2007
Iteration 21:  log pseudolikelihood = -2925.2007
Iteration 22:  log pseudolikelihood = -2925.2007
Iteration 23:  log pseudolikelihood = -2925.2007
Iteration 24:  log pseudolikelihood = -2925.2007
Iteration 25:  log pseudolikelihood = -2925.2007
Iteration 26:  log pseudolikelihood = -2925.2007
Iteration 27:  log pseudolikelihood = -2925.2007
Iteration 28:  log pseudolikelihood = -2925.2007
Iteration 29:  log pseudolikelihood = -2925.2007
Iteration 30:  log pseudolikelihood = -2925.2007
Iteration 31:  log pseudolikelihood = -2925.2007
Iteration 32:  log pseudolikelihood = -2925.2007
Iteration 33:  log pseudolikelihood = -2925.2007
Iteration 34:  log pseudolikelihood = -2925.2007
Iteration 35:  log pseudolikelihood = -2925.2007
Iteration 36:  log pseudolikelihood = -2925.2007
Iteration 37:  log pseudolikelihood = -2925.2007
Iteration 38:  log pseudolikelihood = -2925.2007
Iteration 39:  log pseudolikelihood = -2925.2007
Refining estimates:
Iteration 0:   log pseudolikelihood = -2925.2007
Iteration 1:   log pseudolikelihood = -2925.2007
Iteration 2:   log pseudolikelihood = -2925.2007

Cox regression with Breslow method for ties

No. of subjects =  13,837                             Number of obs =   13,837
No. of failures =     308
Time at risk    = 362,835
                                                      Wald chi2(5)  = 80138.40
Log pseudolikelihood = -2925.2007                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 13,837 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |    .718106   .7179207    -0.33   0.740     .1012061    5.095308
    paxlovid  |   1.54e-18   2.24e-19  -282.09   0.000     1.16e-18    2.05e-18
molnupiravir  |   .5855307   .5845251    -0.54   0.592      .082758    4.142756
              |
          age |   .9991558   .0029785    -0.28   0.777      .993335    1.005011
              |
          sex |
      Female  |   .8700439   .0991602    -1.22   0.222     .6958705    1.087812
-------------------------------------------------------------------------------

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -957.65077
Iteration 1:   log pseudolikelihood = -935.77825
Iteration 2:   log pseudolikelihood = -935.15493
Iteration 3:   log pseudolikelihood = -935.11868
Iteration 4:   log pseudolikelihood =  -935.1062
Iteration 5:   log pseudolikelihood = -935.10161
Iteration 6:   log pseudolikelihood = -935.09992
Iteration 7:   log pseudolikelihood =  -935.0993
Iteration 8:   log pseudolikelihood = -935.09907
Iteration 9:   log pseudolikelihood = -935.09899
Iteration 10:  log pseudolikelihood = -935.09896
Iteration 11:  log pseudolikelihood = -935.09894
Iteration 12:  log pseudolikelihood = -935.09894
Iteration 13:  log pseudolikelihood = -935.09894
Iteration 14:  log pseudolikelihood = -935.09894
Iteration 15:  log pseudolikelihood = -935.09894
Iteration 16:  log pseudolikelihood = -935.09894
Iteration 17:  log pseudolikelihood = -935.09894
Iteration 18:  log pseudolikelihood = -935.09894
Iteration 19:  log pseudolikelihood = -935.09894
Iteration 20:  log pseudolikelihood = -935.09894
Iteration 21:  log pseudolikelihood = -935.09894
Iteration 22:  log pseudolikelihood = -935.09894
Iteration 23:  log pseudolikelihood = -935.09894
Iteration 24:  log pseudolikelihood = -935.09894
Iteration 25:  log pseudolikelihood = -935.09894
Iteration 26:  log pseudolikelihood = -935.09894
Iteration 27:  log pseudolikelihood = -935.09894
Iteration 28:  log pseudolikelihood = -935.09894
Iteration 29:  log pseudolikelihood = -935.09894
Iteration 30:  log pseudolikelihood = -935.09894
Refining estimates:
Iteration 0:   log pseudolikelihood = -935.09894
Iteration 1:   log pseudolikelihood = -935.09894
Iteration 2:   log pseudolikelihood = -935.09894

Cox regression with Breslow method for ties

No. of subjects =   4,580                             Number of obs =    4,580
No. of failures =     114
Time at risk    = 120,058
                                                      Wald chi2(36) = 10870.88
Log pseudolikelihood = -935.09894                     Prob > chi2   =   0.0000

                                        (Std. err. adjusted for 4,580 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |    1.66397   1.714709     0.49   0.621     .2207946    12.54015
                  paxlovid  |   1.01e-14   3.39e-15   -95.64   0.000     5.19e-15    1.95e-14
              molnupiravir  |   1.628381   1.649951     0.48   0.630     .2235006    11.86405
                            |
                        age |   .9959502   .0048669    -0.83   0.406     .9864567    1.005535
                            |
                        sex |
                    Female  |   .8066629   .1527017    -1.13   0.256     .5566205    1.169028
                            |
                 region_nhs |
             East Midlands  |   1.298564   .7595189     0.45   0.655     .4126702    4.086239
                    London  |   1.401295   .7243206     0.65   0.514     .5088019    3.859316
                North East  |   3.666913   1.842579     2.59   0.010     1.369564    9.817909
                North West  |   2.406356   1.274503     1.66   0.097      .852176    6.795015
                South East  |   2.897066   1.462632     2.11   0.035     1.076999    7.792946
                South West  |   .9923403   .6326924    -0.01   0.990     .2844165    3.462313
             West Midlands  |   2.904743   1.474126     2.10   0.036     1.074316    7.853866
  Yorkshire and The Humber  |   2.666667   1.374896     1.90   0.057     .9707363    7.325486
                            |
                      imdq5 |
                         2  |   1.167648   .3670926     0.49   0.622     .6305298     2.16231
                         3  |   1.497147   .4532149     1.33   0.182     .8271596    2.709813
                         4  |   1.147516   .3558308     0.44   0.657      .624901    2.107201
           5 most deprived  |   1.105556   .3522313     0.31   0.753     .5920888    2.064308
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.085476   .3743099     0.24   0.812     .5522002    2.133753
                            |
         vaccination_status |
           One vaccination  |   .9858024   .3810628    -0.04   0.970     .4621226    2.102919
          Two vaccinations  |   1.103033    .420247     0.26   0.797     .5227422      2.3275
        Three vaccinations  |    1.28801   .3399869     0.96   0.338     .7677739    2.160752
 Four or more vaccinations  |   1.006731   .4068783     0.02   0.987     .4559249    2.222968
                            |
                   diabetes |   .7481856   .2608231    -0.83   0.405     .3778105    1.481646
    chronic_cardiac_disease |   1.144256   .3516969     0.44   0.661     .6264684    2.090005
chronic_respiratory_disease |   .5047912    .212066    -1.63   0.104     .2215729    1.150024
               hypertension |   .5543642   .2349907    -1.39   0.164     .2415335    1.272369
             downs_syndrome |   .9503082   .2274549    -0.21   0.831     .5944709    1.519142
               solid_cancer |   1.209662   .3477096     0.66   0.508     .6886386     2.12489
               haem_disease |   1.104345   .2131786     0.51   0.607     .7564706    1.612195
              renal_disease |   .7764667   .1588791    -1.24   0.216     .5199381    1.159562
              liver_disease |   .7120007   .2536894    -0.95   0.340     .3541548    1.431422
               imid_on_drug |   .8989888   .2084932    -0.46   0.646      .570616    1.416331
          immunosuppression |   .9277164    .270185    -0.26   0.797     .5242208    1.641785
                   hiv_aids |   1.117704    .256505     0.48   0.628     .7128234    1.752554
           organ_transplant |   .7532108   .2607933    -0.82   0.413     .3821156    1.484699
                 rare_neuro |   .6579746   .1220794    -2.26   0.024     .4573816    .9465413
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_contactderm_serious==1
Observed time interval: (stop_ae_contactderm_serious[_n-1], stop_ae_contactderm_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     10,346  observations end on or before enter()
--------------------------------------------------------------------------
     13,849  observations remaining, representing
     13,849  subjects
        316  failures in single-failure-per-subject data
 362,787.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3003.5608
Iteration 1:   log pseudolikelihood = -3002.3141
Iteration 2:   log pseudolikelihood = -3001.9093
Iteration 3:   log pseudolikelihood =  -3001.765
Iteration 4:   log pseudolikelihood = -3001.7119
Iteration 5:   log pseudolikelihood = -3001.6924
Iteration 6:   log pseudolikelihood = -3001.6852
Iteration 7:   log pseudolikelihood = -3001.6826
Iteration 8:   log pseudolikelihood = -3001.6816
Iteration 9:   log pseudolikelihood = -3001.6813
Iteration 10:  log pseudolikelihood = -3001.6811
Iteration 11:  log pseudolikelihood = -3001.6811
Iteration 12:  log pseudolikelihood = -3001.6811
Iteration 13:  log pseudolikelihood = -3001.6811
Iteration 14:  log pseudolikelihood = -3001.6811
Iteration 15:  log pseudolikelihood = -3001.6811
Iteration 16:  log pseudolikelihood = -3001.6811
Iteration 17:  log pseudolikelihood = -3001.6811
Iteration 18:  log pseudolikelihood = -3001.6811
Iteration 19:  log pseudolikelihood = -3001.6811
Iteration 20:  log pseudolikelihood = -3001.6811
Iteration 21:  log pseudolikelihood = -3001.6811
Iteration 22:  log pseudolikelihood = -3001.6811
Iteration 23:  log pseudolikelihood = -3001.6811
Iteration 24:  log pseudolikelihood = -3001.6811
Iteration 25:  log pseudolikelihood = -3001.6811
Iteration 26:  log pseudolikelihood = -3001.6811
Iteration 27:  log pseudolikelihood = -3001.6811
Iteration 28:  log pseudolikelihood = -3001.6811
Iteration 29:  log pseudolikelihood = -3001.6811
Refining estimates:
Iteration 0:   log pseudolikelihood = -3001.6811
Iteration 1:   log pseudolikelihood = -3001.6811

Cox regression with Breslow method for ties

No. of subjects =     13,849                          Number of obs =   13,849
No. of failures =        316
Time at risk    = 362,787.75
                                                      Wald chi2(3)  = 53444.03
Log pseudolikelihood = -3001.6811                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 13,849 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.527751   1.085499     0.60   0.551     .3795389     6.14963
    paxlovid  |   .7990537   .8077033    -0.22   0.824     .1101946    5.794175
molnupiravir  |   9.28e-14   1.21e-14  -230.96   0.000     7.20e-14    1.20e-13
-------------------------------------------------------------------------------

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3003.5608
Iteration 1:   log pseudolikelihood = -3001.8624
Iteration 2:   log pseudolikelihood = -3001.4576
Iteration 3:   log pseudolikelihood = -3001.3133
Iteration 4:   log pseudolikelihood = -3001.2603
Iteration 5:   log pseudolikelihood = -3001.2407
Iteration 6:   log pseudolikelihood = -3001.2336
Iteration 7:   log pseudolikelihood = -3001.2309
Iteration 8:   log pseudolikelihood =   -3001.23
Iteration 9:   log pseudolikelihood = -3001.2296
Iteration 10:  log pseudolikelihood = -3001.2295
Iteration 11:  log pseudolikelihood = -3001.2294
Iteration 12:  log pseudolikelihood = -3001.2294
Iteration 13:  log pseudolikelihood = -3001.2294
Iteration 14:  log pseudolikelihood = -3001.2294
Iteration 15:  log pseudolikelihood = -3001.2294
Iteration 16:  log pseudolikelihood = -3001.2294
Iteration 17:  log pseudolikelihood = -3001.2294
Iteration 18:  log pseudolikelihood = -3001.2294
Iteration 19:  log pseudolikelihood = -3001.2294
Iteration 20:  log pseudolikelihood = -3001.2294
Iteration 21:  log pseudolikelihood = -3001.2294
Iteration 22:  log pseudolikelihood = -3001.2294
Iteration 23:  log pseudolikelihood = -3001.2294
Iteration 24:  log pseudolikelihood = -3001.2294
Iteration 25:  log pseudolikelihood = -3001.2294
Iteration 26:  log pseudolikelihood = -3001.2294
Iteration 27:  log pseudolikelihood = -3001.2294
Iteration 28:  log pseudolikelihood = -3001.2294
Iteration 29:  log pseudolikelihood = -3001.2294
Iteration 30:  log pseudolikelihood = -3001.2294
Iteration 31:  log pseudolikelihood = -3001.2294
Iteration 32:  log pseudolikelihood = -3001.2294
Iteration 33:  log pseudolikelihood = -3001.2294
Iteration 34:  log pseudolikelihood = -3001.2294
Iteration 35:  log pseudolikelihood = -3001.2294
Iteration 36:  log pseudolikelihood = -3001.2294
Iteration 37:  log pseudolikelihood = -3001.2294
Iteration 38:  log pseudolikelihood = -3001.2294
Iteration 39:  log pseudolikelihood = -3001.2294
Iteration 40:  log pseudolikelihood = -3001.2294
Iteration 41:  log pseudolikelihood = -3001.2294
Iteration 42:  log pseudolikelihood = -3001.2294
Iteration 43:  log pseudolikelihood = -3001.2294
Iteration 44:  log pseudolikelihood = -3001.2294
Iteration 45:  log pseudolikelihood = -3001.2294
Refining estimates:
Iteration 0:   log pseudolikelihood = -3001.2294

Cox regression with Breslow method for ties

No. of subjects =     13,849                            Number of obs = 13,849
No. of failures =        316
Time at risk    = 362,787.75
                                                        Wald chi2(4)  =   1.26
Log pseudolikelihood = -3001.2294                       Prob > chi2   = 0.8683

                         (Std. err. adjusted for 13,849 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.546222   1.101627     0.61   0.541     .3826674     6.24773
    paxlovid  |   .8037192   .8130037    -0.22   0.829     .1106802    5.836318
molnupiravir  |   2.83e-20          .        .       .            .           .
              |
          age |   .9987479   .0030207    -0.41   0.679      .992845    1.004686
              |
          sex |
      Female  |   1.100818   .1240876     0.85   0.394     .8826028    1.372984
-------------------------------------------------------------------------------

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -873.67109
Iteration 1:   log pseudolikelihood =  -860.4022
Iteration 2:   log pseudolikelihood = -859.87597
Iteration 3:   log pseudolikelihood = -859.75561
Iteration 4:   log pseudolikelihood = -859.71144
Iteration 5:   log pseudolikelihood =  -859.6952
Iteration 6:   log pseudolikelihood = -859.68922
Iteration 7:   log pseudolikelihood = -859.68703
Iteration 8:   log pseudolikelihood = -859.68622
Iteration 9:   log pseudolikelihood = -859.68592
Iteration 10:  log pseudolikelihood = -859.68581
Iteration 11:  log pseudolikelihood = -859.68577
Iteration 12:  log pseudolikelihood = -859.68576
Iteration 13:  log pseudolikelihood = -859.68575
Iteration 14:  log pseudolikelihood = -859.68575
Iteration 15:  log pseudolikelihood = -859.68575
Iteration 16:  log pseudolikelihood = -859.68575
Iteration 17:  log pseudolikelihood = -859.68575
Iteration 18:  log pseudolikelihood = -859.68575
Iteration 19:  log pseudolikelihood = -859.68575
Iteration 20:  log pseudolikelihood = -859.68575
Iteration 21:  log pseudolikelihood = -859.68575
Iteration 22:  log pseudolikelihood = -859.68575
Iteration 23:  log pseudolikelihood = -859.68575
Iteration 24:  log pseudolikelihood = -859.68575
Iteration 25:  log pseudolikelihood = -859.68575
Iteration 26:  log pseudolikelihood = -859.68575
Iteration 27:  log pseudolikelihood = -859.68575
Iteration 28:  log pseudolikelihood = -859.68575
Iteration 29:  log pseudolikelihood = -859.68575
Iteration 30:  log pseudolikelihood = -859.68575
Iteration 31:  log pseudolikelihood = -859.68575
Iteration 32:  log pseudolikelihood = -859.68575
Iteration 33:  log pseudolikelihood = -859.68575
Iteration 34:  log pseudolikelihood = -859.68575
Refining estimates:
Iteration 0:   log pseudolikelihood = -859.68575
Iteration 1:   log pseudolikelihood = -859.68575
Iteration 2:   log pseudolikelihood = -859.68575

Cox regression with Breslow method for ties

No. of subjects =   4,578                             Number of obs =    4,578
No. of failures =     104
Time at risk    = 120,175
                                                      Wald chi2(36) = 41163.28
Log pseudolikelihood = -859.68575                     Prob > chi2   =   0.0000

                                        (Std. err. adjusted for 4,578 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.39e-16   7.97e-17  -107.84   0.000     1.24e-16    4.60e-16
                  paxlovid  |   2.21e-16   6.95e-17  -114.52   0.000     1.19e-16    4.09e-16
              molnupiravir  |   2.46e-16   7.23e-17  -122.40   0.000     1.38e-16    4.38e-16
                            |
                        age |   1.002185   .0048431     0.45   0.652     .9927375    1.011722
                            |
                        sex |
                    Female  |   1.224553   .2484512     1.00   0.318     .8227658    1.822548
                            |
                 region_nhs |
             East Midlands  |   1.090885   .4074196     0.23   0.816     .5246567    2.268206
                    London  |   .6383652   .2374945    -1.21   0.228     .3078875    1.323568
                North East  |   .5054915   .2417814    -1.43   0.154     .1979594    1.290778
                North West  |   .5506966   .2495704    -1.32   0.188     .2265458    1.338655
                South East  |   .5122178   .2312927    -1.48   0.138     .2113943    1.241126
                South West  |   .7264788   .3115142    -0.75   0.456     .3134929     1.68352
             West Midlands  |   .6341944   .2722581    -1.06   0.289     .2734032    1.471097
  Yorkshire and The Humber  |   .8744628   .3377319    -0.35   0.728     .4101977    1.864187
                            |
                      imdq5 |
                         2  |   .8348804   .2682682    -0.56   0.574     .4447456    1.567245
                         3  |   .6303725   .2176042    -1.34   0.181      .320452    1.240028
                         4  |     1.0754   .3218717     0.24   0.808      .598139    1.933474
           5 most deprived  |   .9389876    .288368    -0.20   0.838     .5143414    1.714227
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.149673   .4009268     0.40   0.689     .5804085    2.277271
                            |
         vaccination_status |
           One vaccination  |   .9163265   .3359775    -0.24   0.812     .4466335    1.879963
          Two vaccinations  |   .9286415    .341586    -0.20   0.840     .4515929    1.909629
        Three vaccinations  |    .801374   .2013726    -0.88   0.378     .4897132     1.31138
 Four or more vaccinations  |   .8518695   .3252856    -0.42   0.675     .4030348    1.800544
                            |
                   diabetes |   1.121107   .3585112     0.36   0.721     .5990278      2.0982
    chronic_cardiac_disease |   1.304804   .3959445     0.88   0.381     .7198583    2.365067
chronic_respiratory_disease |   .8479832    .298597    -0.47   0.640     .4252625    1.690898
               hypertension |    1.35674   .4103217     1.01   0.313     .7500084    2.454298
             downs_syndrome |   1.137488   .2646399     0.55   0.580     .7209614    1.794656
               solid_cancer |   .6885851   .2513244    -1.02   0.307     .3367289    1.408104
               haem_disease |   1.096783    .214804     0.47   0.637     .7471601    1.610007
              renal_disease |   .7845165   .1763751    -1.08   0.280     .5049343    1.218904
              liver_disease |   .9696607   .3258127    -0.09   0.927     .5018919    1.873395
               imid_on_drug |   .7815421   .1942259    -0.99   0.321     .4801921    1.272008
          immunosuppression |   1.674216   .4371725     1.97   0.048     1.003564    2.793044
                   hiv_aids |    .928703    .234226    -0.29   0.769     .5664966    1.522497
           organ_transplant |   .6831929   .2311636    -1.13   0.260      .351992    1.326032
                 rare_neuro |     1.2618   .2612559     1.12   0.261     .8409095    1.893355
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_dizziness_serious==1
Observed time interval: (stop_ae_dizziness_serious[_n-1], stop_ae_dizziness_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     10,295  observations end on or before enter()
--------------------------------------------------------------------------
     13,900  observations remaining, representing
     13,900  subjects
        304  failures in single-failure-per-subject data
    364,803  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -2890.4409
Iteration 1:   log pseudolikelihood = -2889.5479
Iteration 2:   log pseudolikelihood = -2889.2415
Iteration 3:   log pseudolikelihood = -2889.1292
Iteration 4:   log pseudolikelihood = -2889.0879
Iteration 5:   log pseudolikelihood = -2889.0727
Iteration 6:   log pseudolikelihood = -2889.0671
Iteration 7:   log pseudolikelihood = -2889.0651
Iteration 8:   log pseudolikelihood = -2889.0643
Iteration 9:   log pseudolikelihood =  -2889.064
Iteration 10:  log pseudolikelihood = -2889.0639
Iteration 11:  log pseudolikelihood = -2889.0639
Iteration 12:  log pseudolikelihood = -2889.0639
Iteration 13:  log pseudolikelihood = -2889.0639
Iteration 14:  log pseudolikelihood = -2889.0639
Iteration 15:  log pseudolikelihood = -2889.0639
Iteration 16:  log pseudolikelihood = -2889.0639
Iteration 17:  log pseudolikelihood = -2889.0639
Iteration 18:  log pseudolikelihood = -2889.0639
Iteration 19:  log pseudolikelihood = -2889.0639
Iteration 20:  log pseudolikelihood = -2889.0639
Iteration 21:  log pseudolikelihood = -2889.0639
Iteration 22:  log pseudolikelihood = -2889.0639
Iteration 23:  log pseudolikelihood = -2889.0639
Iteration 24:  log pseudolikelihood = -2889.0639
Iteration 25:  log pseudolikelihood = -2889.0639
Iteration 26:  log pseudolikelihood = -2889.0639
Iteration 27:  log pseudolikelihood = -2889.0639
Iteration 28:  log pseudolikelihood = -2889.0639
Iteration 29:  log pseudolikelihood = -2889.0639
Refining estimates:
Iteration 0:   log pseudolikelihood = -2889.0639
Iteration 1:   log pseudolikelihood = -2889.0639

Cox regression with Breslow method for ties

No. of subjects =  13,900                             Number of obs =   13,900
No. of failures =     304
Time at risk    = 364,803
                                                      Wald chi2(3)  = 44528.92
Log pseudolikelihood = -2889.0639                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 13,900 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   9.29e-14   1.32e-14  -210.84   0.000     7.03e-14    1.23e-13
    paxlovid  |   .7985313   .7943879    -0.23   0.821     .1136337    5.611473
molnupiravir  |   1.200195   .8448013     0.26   0.795     .3020662    4.768715
-------------------------------------------------------------------------------

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -2890.4409
Iteration 1:   log pseudolikelihood = -2889.1591
Iteration 2:   log pseudolikelihood = -2888.8527
Iteration 3:   log pseudolikelihood = -2888.7403
Iteration 4:   log pseudolikelihood =  -2888.699
Iteration 5:   log pseudolikelihood = -2888.6839
Iteration 6:   log pseudolikelihood = -2888.6783
Iteration 7:   log pseudolikelihood = -2888.6762
Iteration 8:   log pseudolikelihood = -2888.6755
Iteration 9:   log pseudolikelihood = -2888.6752
Iteration 10:  log pseudolikelihood = -2888.6751
Iteration 11:  log pseudolikelihood =  -2888.675
Iteration 12:  log pseudolikelihood =  -2888.675
Iteration 13:  log pseudolikelihood =  -2888.675
Iteration 14:  log pseudolikelihood =  -2888.675
Iteration 15:  log pseudolikelihood =  -2888.675
Iteration 16:  log pseudolikelihood =  -2888.675
Iteration 17:  log pseudolikelihood =  -2888.675
Iteration 18:  log pseudolikelihood =  -2888.675
Iteration 19:  log pseudolikelihood =  -2888.675
Iteration 20:  log pseudolikelihood =  -2888.675
Iteration 21:  log pseudolikelihood =  -2888.675
Iteration 22:  log pseudolikelihood =  -2888.675
Iteration 23:  log pseudolikelihood =  -2888.675
Iteration 24:  log pseudolikelihood =  -2888.675
Iteration 25:  log pseudolikelihood =  -2888.675
Iteration 26:  log pseudolikelihood =  -2888.675
Iteration 27:  log pseudolikelihood =  -2888.675
Iteration 28:  log pseudolikelihood =  -2888.675
Iteration 29:  log pseudolikelihood =  -2888.675
Iteration 30:  log pseudolikelihood =  -2888.675
Iteration 31:  log pseudolikelihood =  -2888.675
Iteration 32:  log pseudolikelihood =  -2888.675
Iteration 33:  log pseudolikelihood =  -2888.675
Iteration 34:  log pseudolikelihood =  -2888.675
Iteration 35:  log pseudolikelihood =  -2888.675
Iteration 36:  log pseudolikelihood =  -2888.675
Iteration 37:  log pseudolikelihood =  -2888.675
Iteration 38:  log pseudolikelihood =  -2888.675
Iteration 39:  log pseudolikelihood =  -2888.675
Iteration 40:  log pseudolikelihood =  -2888.675
Refining estimates:
Iteration 0:   log pseudolikelihood =  -2888.675
Iteration 1:   log pseudolikelihood =  -2888.675
