---------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/c
> ox_model.log
  log type:  text
 opened on:   1 Dec 2023, 19:26:54

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir
> /analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. 
. use "$projectdir/output/data/sensitivity_analysis.dta", clear

. 
. 
. * Models
. global crude    i.drug 

. global agesex   i.drug age i.sex

. global adj              i.drug age i.sex i.region_nhs i.imdq5 White 1b.bmi_group ///
>                                 paxlovid_contraindicated i.vaccination_status diabetes chronic_cardiac_disease chronic_respiratory_disease hypertension
>  ///
>                             downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosuppression hiv_aids organ_transpla
> nt rare_neuro  

. global adj2     i.drug age i.sex i.region_nhs i.imdq5 White 1b.bmi_group 

. global adj3     i.drug age i.sex i.region_nhs i.imdq5 White 1b.bmi_group ///
>                                 paxlovid_contraindicated i.vaccination_status diabetes chronic_cardiac_disease chronic_respiratory_disease hypertension
>  

. global adj4             paxlovid_contraindicated i.vaccination_status diabetes chronic_cardiac_disease chronic_respiratory_disease hypertension ///
>                             downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosuppression hiv_aids organ_transpla
> nt rare_neuro ///
>                                 dementia care_home serious_mental_illness

. 
. * Outcome
. global ae_disease                       ae_diverticulitis                               ///
>                                                         ae_diarrhoea                                    ///
>                                                         ae_taste                                                ///
>                                                         ae_rash                                                 ///
>                                                         ae_bronchospasm                                 ///
>                                                         ae_contactderm                                  ///
>                                                         ae_dizziness                                    ///
>                                                         ae_nausea_vomit                                 ///
>                                                         ae_headache                                             ///
>                                                         ae_anaphylaxis                                  ///
>                                                         ae_drugreaction                                 ///
>                                                         ae_ra                                                   ///
>                                                         ae_sle                                                  ///
>                                                         ae_psorasis                                     ///
>                                                         ae_psa                                                  ///
>                                                         ae_axspa                                                ///
>                                                         ae_ibd                                          

. global ae_disease_serious       ae_diverticulitis_serious               ///
>                                                         ae_diarrhoea_serious                    ///
>                                                         ae_taste_serious                                ///
>                                                         ae_rash_serious                                 ///
>                                                         ae_contactderm_serious                  ///
>                                                         ae_dizziness_serious                    ///
>                                                         ae_nausea_vomit_serious                 ///
>                                                         ae_headache_serious                             ///
>                                                         ae_anaphylaxis_serious                  ///
>                                                         ae_drugreaction_serious                 ///
>                                                         ae_ra_serious                                   ///
>                                                         ae_sle_serious                                  ///
>                                                         ae_psorasis_serious                     ///
>                                                         ae_psa_serious                                  ///
>                                                         ae_axspa_serious                                ///
>                                                         ae_ibd_serious  

. global ae_combined                      ae_all                                                  ///
>                                                         ae_all_serious                                  ///
>                                                         ae_spc_all                                              ///
>                                                         ae_spc_serious                                  ///
>                                                         ae_drug_all                                             ///
>                                                         ae_drug_serious                                 ///
>                                                         ae_imae_all                                             ///     
>                                                         ae_imae_serious 

. 
end of do-file

. do "C:\Users\k1635179\AppData\Local\Temp\STD43dc_000000.tmp"

. *******************************************************************************************************************************************************
> *******************************************************************************
. ** SENSITIVITY ANALYSIS 6 =  Start date is covid test for both control and treatment  **
. *                                                        Restrict to eligible on EHR - i.e high_risk_cohort_codelist==1                                
>            *
. 
. use "$projectdir/output/data/sensitivity_analysis.dta", clear

. tab pre_drug_test drug

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
               0 days |         0         15         16         26 |        57 
               1 days |         0         11         13         17 |        41 
               2 days |         0         23         14         12 |        49 
               3 days |         0         14         17         17 |        48 
               4 days |         0         12          9         13 |        34 
               5 days |         0         11         12         13 |        36 
             6-7 days |         0         19         11         16 |        46 
   >7 days & <21 days |         0        213        217        222 |       652 
treatment >21 day or  |    26,554      9,899      9,902      9,807 |    56,162 
no test date / no tre |         0      1,147      1,107      1,106 |     3,360 
----------------------+--------------------------------------------+----------
                Total |    26,554     11,364     11,318     11,249 |    60,485 

. drop if  covid_test_5d!=1 & drug >0
(33,666 observations deleted)

. tab pre_drug_test drug

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
               0 days |         0         15         16         26 |        57 
               1 days |         0         11         13         17 |        41 
               2 days |         0         23         14         12 |        49 
               3 days |         0         14         17         17 |        48 
               4 days |         0         12          9         13 |        34 
               5 days |         0         11         12         13 |        36 
treatment >21 day or  |    26,554          0          0          0 |    26,554 
----------------------+--------------------------------------------+----------
                Total |    26,554         86         81         98 |    26,819 

. tab drug paxlovid_contraindicated

             | paxlovid_contraindica
             |          ted
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    11,086     15,468 |    26,554 
  sotrovimab |        49         37 |        86 
    paxlovid |        40         41 |        81 
molnupiravir |        39         59 |        98 
-------------+----------------------+----------
       Total |    11,214     15,605 |    26,819 

. tab drug high_risk_cohort_codelist

             | high_risk_cohort_code
             |         list
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |         0     26,554 |    26,554 
  sotrovimab |         2         84 |        86 
    paxlovid |         3         78 |        81 
molnupiravir |         1         97 |        98 
-------------+----------------------+----------
       Total |         6     26,813 |    26,819 

. 
. ** Start day for treatment group is date treated & start date for control group is date test + 2 days
. count if start_date!=covid_test_positive_date & drug==0
  26,512

. count if start_date!=date_treated & drug>0
  0

. tab median_delay_all

median_dela |
      y_all |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |     26,819      100.00      100.00
------------+-----------------------------------
      Total |     26,819      100.00

. gen start_date_delay = start_date + median_delay_all if drug==0
(2,889 missing values generated)

. replace start_date_delay = start_date if drug>0
(265 real changes made)

. 
. *** Hazard of events                                            
. tempname cox_model_summary_sens_6

. postfile `cox_model_summary_sens_6' str20(model) str20(failure) ///
>         hr_sot lc_sot uc_sot hr_pax lc_pax uc_pax hr_mol lc_mol uc_mol ///
>         using "$projectdir/output/tables/cox_model_summary_sens_6", replace                                                      

. foreach fail in $ae_combined {
  2.         stset stop_`fail' if high_risk_cohort_codelist==1, id(patient_id) origin(time start_date) enter(time start_date) failure(fail_`fail'==1) 
  3.         foreach model in crude agesex adj {
  4.                 stcox $`model', vce(robust)
  5.                                         matrix b = r(table)
  6.                                         local hr_sot = b[1,2]
  7.                                         local lc_sot = b[5,2]
  8.                                         local uc_sot = b[6,2]
  9.                                         local hr_pax = b[1,3]
 10.                                         local lc_pax = b[5,3]
 11.                                         local uc_pax = b[6,3]
 12.                                         local hr_mol = b[1,4]
 13.                                         local lc_mol = b[5,4]
 14.                                         local uc_mol = b[6,4]   
 15.                 
.                 post `cox_model_summary_sens_6' ("`model'") ("`fail'") (`hr_sot') (`lc_sot') (`uc_sot') (`hr_pax') (`lc_pax') (`uc_pax') (`hr_mol') (`l
> c_mol') (`uc_mol')                               
 16. }
 17. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     22,828  observations end on or before enter()
--------------------------------------------------------------------------
      1,361  observations remaining, representing
      1,361  subjects
        867  failures in single-failure-per-subject data
     24,709  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5888.6368
Iteration 1:   log pseudolikelihood = -5886.1563
Iteration 2:   log pseudolikelihood = -5885.8671
Iteration 3:   log pseudolikelihood = -5885.8649
Iteration 4:   log pseudolikelihood = -5885.8649
Refining estimates:
Iteration 0:   log pseudolikelihood = -5885.8649

Cox regression with Breslow method for ties

No. of subjects =  1,361                                Number of obs =  1,361
No. of failures =    867
Time at risk    = 24,709
                                                        Wald chi2(3)  =   7.70
Log pseudolikelihood = -5885.8649                       Prob > chi2   = 0.0527

                          (Std. err. adjusted for 1,361 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |    1.79578   .4690316     2.24   0.025     1.076296    2.996226
    paxlovid  |   .5303025   .2985826    -1.13   0.260     .1758982     1.59877
molnupiravir  |   .6597538   .2396326    -1.15   0.252     .3237521     1.34447
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -5888.6368
Iteration 1:   log pseudolikelihood = -5885.4655
Iteration 2:   log pseudolikelihood = -5885.1769
Iteration 3:   log pseudolikelihood = -5885.1747
Iteration 4:   log pseudolikelihood = -5885.1747
Refining estimates:
Iteration 0:   log pseudolikelihood = -5885.1747

Cox regression with Breslow method for ties

No. of subjects =  1,361                                Number of obs =  1,361
No. of failures =    867
Time at risk    = 24,709
                                                        Wald chi2(5)  =   9.32
Log pseudolikelihood = -5885.1747                       Prob > chi2   = 0.0970

                          (Std. err. adjusted for 1,361 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.831289   .4763029     2.33   0.020     1.099933    3.048928
    paxlovid  |    .531411   .2950042    -1.14   0.255     .1790192    1.577471
molnupiravir  |   .6544612   .2390044    -1.16   0.246     .3199126    1.338864
              |
          age |   1.000178   .0017466     0.10   0.919     .9967609    1.003607
              |
          sex |
      Female  |   1.083318   .0724764     1.20   0.232     .9501859    1.235103
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1745.7881
Iteration 1:   log pseudolikelihood = -1732.9842
Iteration 2:   log pseudolikelihood = -1732.4938
Iteration 3:   log pseudolikelihood = -1732.4837
Iteration 4:   log pseudolikelihood = -1732.4837
Refining estimates:
Iteration 0:   log pseudolikelihood = -1732.4837

Cox regression with Breslow method for ties

No. of subjects =   470                                 Number of obs =    470
No. of failures =   305
Time at risk    = 8,261
                                                        Wald chi2(36) =  35.53
Log pseudolikelihood = -1732.4837                       Prob > chi2   = 0.4910

                                          (Std. err. adjusted for 470 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.072889   .7937277     1.90   0.057     .9786859    4.390447
                  paxlovid  |   .6716055   .5896443    -0.45   0.650     .1201687    3.753506
              molnupiravir  |   .4673342   .3145704    -1.13   0.258     .1249308    1.748177
                            |
                        age |   1.000425   .0029723     0.14   0.886     .9946161    1.006267
                            |
                        sex |
                    Female  |   1.009603   .1186969     0.08   0.935     .8018197    1.271232
                            |
                 region_nhs |
             East Midlands  |   1.201558   .3486244     0.63   0.527      .680415    2.121853
                    London  |    1.94401   .4838145     2.67   0.008     1.193593    3.166218
                North East  |    1.15446   .3396864     0.49   0.625     .6485193     2.05511
                North West  |   1.615601   .4624572     1.68   0.094     .9218961    2.831301
                South East  |   1.380384   .3934995     1.13   0.258     .7894998    2.413503
                South West  |   1.833705   .5084579     2.19   0.029     1.064889     3.15758
             West Midlands  |    1.60051   .4541824     1.66   0.097      .917719    2.791302
  Yorkshire and The Humber  |   1.745483   .5166206     1.88   0.060     .9771933    3.117817
                            |
                      imdq5 |
                         2  |   .9371224   .1888603    -0.32   0.747     .6313234    1.391044
                         3  |   1.072402   .2342004     0.32   0.749     .6989799     1.64532
                         4  |   1.016327   .2052772     0.08   0.936     .6840824    1.509937
           5 most deprived  |   .8819253   .1743524    -0.64   0.525     .5986229    1.299302
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.228135   .2742782     0.92   0.357     .7927717    1.902585
                            |
         vaccination_status |
           One vaccination  |   .9739146    .226818    -0.11   0.910     .6169955    1.537304
          Two vaccinations  |   .8772319   .2389868    -0.48   0.631      .514303    1.496269
        Three vaccinations  |    .936917   .1534611    -0.40   0.691     .6796411    1.291584
 Four or more vaccinations  |   .7723541   .1731709    -1.15   0.249     .4976993    1.198577
                            |
                   diabetes |   .9030884   .2237404    -0.41   0.681     .5557056    1.467627
    chronic_cardiac_disease |   .8278335   .1827103    -0.86   0.392     .5371247    1.275883
chronic_respiratory_disease |   .9536851   .1837826    -0.25   0.806     .6536899    1.391356
               hypertension |   .8887387   .1698102    -0.62   0.537     .6111335    1.292445
             downs_syndrome |   .9337185   .1335869    -0.48   0.632     .7053988    1.235939
               solid_cancer |   .8816702    .179434    -0.62   0.536     .5916611    1.313831
               haem_disease |   .9447604   .1140414    -0.47   0.638     .7457164    1.196932
              renal_disease |    .945323   .1292095    -0.41   0.681      .723162    1.235734
              liver_disease |   .7197821   .1478765    -1.60   0.109     .4811992    1.076657
               imid_on_drug |   .9532273   .1374734    -0.33   0.740     .7185171    1.264608
          immunosuppression |   .9089162   .1781947    -0.49   0.626     .6189338    1.334761
                   hiv_aids |   .8637326   .1309397    -0.97   0.334     .6417107    1.162571
           organ_transplant |   .9773772   .2020747    -0.11   0.912     .6517403    1.465716
                 rare_neuro |   .9583037   .1168438    -0.35   0.727     .7546022    1.216993
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all_serious==1
Observed time interval: (stop_ae_all_serious[_n-1], stop_ae_all_serious]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     21,122  observations end on or before enter()
--------------------------------------------------------------------------
      3,067  observations remaining, representing
      3,067  subjects
        986  failures in single-failure-per-subject data
     72,844  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7735.1931
Iteration 1:   log pseudolikelihood = -7734.7033
Iteration 2:   log pseudolikelihood = -7734.6965
Iteration 3:   log pseudolikelihood = -7734.6965
Refining estimates:
Iteration 0:   log pseudolikelihood = -7734.6965

Cox regression with Breslow method for ties

No. of subjects =  3,067                                Number of obs =  3,067
No. of failures =    986
Time at risk    = 72,844
                                                        Wald chi2(3)  =   1.09
Log pseudolikelihood = -7734.6965                       Prob > chi2   = 0.7806

                          (Std. err. adjusted for 3,067 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.219574    .436382     0.55   0.579     .6048326    2.459127
    paxlovid  |    .740326    .343424    -0.65   0.517     .2982399    1.837724
molnupiravir  |   1.221334   .4106841     0.59   0.552     .6318452    2.360795
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7735.1931
Iteration 1:   log pseudolikelihood = -7734.5309
Iteration 2:   log pseudolikelihood =  -7734.524
Iteration 3:   log pseudolikelihood =  -7734.524
Refining estimates:
Iteration 0:   log pseudolikelihood =  -7734.524

Cox regression with Breslow method for ties

No. of subjects =  3,067                                Number of obs =  3,067
No. of failures =    986
Time at risk    = 72,844
                                                        Wald chi2(5)  =   1.41
Log pseudolikelihood = -7734.524                        Prob > chi2   = 0.9227

                          (Std. err. adjusted for 3,067 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.221148   .4363175     0.56   0.576     .6062238    2.459821
    paxlovid  |   .7414669   .3449763    -0.64   0.520     .2978929     1.84554
molnupiravir  |    1.21922   .4105687     0.59   0.556     .6301478    2.358966
              |
          age |   .9991161   .0016931    -0.52   0.602     .9958032     1.00244
              |
          sex |
      Female  |   .9826361   .0622131    -0.28   0.782     .8679628     1.11246
-------------------------------------------------------------------------------

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2246.7749
Iteration 1:   log pseudolikelihood = -2230.0746
Iteration 2:   log pseudolikelihood = -2229.7542
Iteration 3:   log pseudolikelihood = -2229.7505
Iteration 4:   log pseudolikelihood = -2229.7505
Refining estimates:
Iteration 0:   log pseudolikelihood = -2229.7505

Cox regression with Breslow method for ties

No. of subjects =     1,023                             Number of obs =  1,023
No. of failures =       333
Time at risk    = 24,232.25
                                                        Wald chi2(36) =  34.33
Log pseudolikelihood = -2229.7505                       Prob > chi2   = 0.5483

                                        (Std. err. adjusted for 1,023 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   1.802854   .9074297     1.17   0.242     .6722423    4.834988
                  paxlovid  |   1.329562   .9544059     0.40   0.692     .3256018    5.429135
              molnupiravir  |   1.363527   .6455526     0.65   0.513     .5390987    3.448731
                            |
                        age |   1.002963   .0028646     1.04   0.300     .9973637    1.008593
                            |
                        sex |
                    Female  |   1.002001    .113345     0.02   0.986     .8027523    1.250705
                            |
                 region_nhs |
             East Midlands  |   .8089379   .1898679    -0.90   0.366     .5106549    1.281454
                    London  |   .6925032   .1444312    -1.76   0.078     .4601419    1.042202
                North East  |    .633023    .156959    -1.84   0.065     .3893703    1.029144
                North West  |   .8717218   .1902543    -0.63   0.529     .5683321    1.337068
                South East  |   .6651451   .1572647    -1.72   0.085     .4184669    1.057235
                South West  |   .5912994   .1551375    -2.00   0.045     .3535738    .9888597
             West Midlands  |    .625641   .1610547    -1.82   0.068     .3777513    1.036202
  Yorkshire and The Humber  |   .7730777   .1779779    -1.12   0.264     .4923336    1.213911
                            |
                      imdq5 |
                         2  |   1.087623   .1915798     0.48   0.633     .7700927    1.536079
                         3  |   1.008464   .1861898     0.05   0.964     .7022717    1.448155
                         4  |   .8724955   .1680818    -0.71   0.479     .5981135    1.272749
           5 most deprived  |   1.048203   .1797305     0.27   0.784     .7490208    1.466888
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .7801829   .1565968    -1.24   0.216     .5264353     1.15624
                            |
         vaccination_status |
           One vaccination  |   1.402947   .3002573     1.58   0.114     .9222914    2.134099
          Two vaccinations  |   1.213662   .2821533     0.83   0.405     .7695015    1.914193
        Three vaccinations  |   1.197962   .1925802     1.12   0.261     .8741924    1.641645
 Four or more vaccinations  |   1.183623   .2754578     0.72   0.469     .7500982    1.867707
                            |
                   diabetes |   1.017757   .1957517     0.09   0.927     .6981154    1.483752
    chronic_cardiac_disease |     .97999   .1940774    -0.10   0.919     .6647366    1.444753
chronic_respiratory_disease |   1.196446   .2109217     1.02   0.309     .8469045    1.690252
               hypertension |   .7180789   .1412523    -1.68   0.092     .4883526    1.055871
             downs_syndrome |   .9298785   .1326497    -0.51   0.610     .7030723    1.229851
               solid_cancer |   1.045905   .1830072     0.26   0.798     .7422548    1.473775
               haem_disease |   1.032556   .1150802     0.29   0.774     .8299378     1.28464
              renal_disease |   .8718001   .1086147    -1.10   0.271      .682918    1.112923
              liver_disease |   1.380597   .2444209     1.82   0.068     .9758207    1.953276
               imid_on_drug |   1.340343   .1742318     2.25   0.024     1.038886    1.729275
          immunosuppression |   .8707794    .156457    -0.77   0.441     .6123064    1.238362
                   hiv_aids |   .8292753   .1159279    -1.34   0.181     .6305299    1.090666
           organ_transplant |   1.043755   .1877076     0.24   0.812     .7337022    1.484833
                 rare_neuro |   .8302789   .0938306    -1.65   0.100     .6653175    1.036142
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_all==1
Observed time interval: (stop_ae_spc_all[_n-1], stop_ae_spc_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     21,800  observations end on or before enter()
--------------------------------------------------------------------------
      2,389  observations remaining, representing
      2,389  subjects
        932  failures in single-failure-per-subject data
     54,214  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7034.8776
Iteration 1:   log pseudolikelihood = -7032.9349
Iteration 2:   log pseudolikelihood =  -7032.786
Iteration 3:   log pseudolikelihood = -7032.7837
Iteration 4:   log pseudolikelihood = -7032.7837
Refining estimates:
Iteration 0:   log pseudolikelihood = -7032.7837

Cox regression with Breslow method for ties

No. of subjects =  2,389                                Number of obs =  2,389
No. of failures =    932
Time at risk    = 54,214
                                                        Wald chi2(3)  =   3.44
Log pseudolikelihood = -7032.7837                       Prob > chi2   = 0.3287

                          (Std. err. adjusted for 2,389 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.428095   .4219504     1.21   0.228      .800309    2.548334
    paxlovid  |   .3925147   .2972641    -1.23   0.217     .0889638    1.731803
molnupiravir  |   .7412372   .3345466    -0.66   0.507     .3060411     1.79529
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7034.8776
Iteration 1:   log pseudolikelihood = -7031.6985
Iteration 2:   log pseudolikelihood = -7031.5504
Iteration 3:   log pseudolikelihood = -7031.5481
Iteration 4:   log pseudolikelihood = -7031.5481
Refining estimates:
Iteration 0:   log pseudolikelihood = -7031.5481

Cox regression with Breslow method for ties

No. of subjects =  2,389                                Number of obs =  2,389
No. of failures =    932
Time at risk    = 54,214
                                                        Wald chi2(5)  =   5.98
Log pseudolikelihood = -7031.5481                       Prob > chi2   = 0.3085

                          (Std. err. adjusted for 2,389 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.419315   .4216168     1.18   0.238     .7929096    2.540585
    paxlovid  |   .3905513   .2963092    -1.24   0.215     .0882828    1.727747
molnupiravir  |    .734448   .3295787    -0.69   0.492     .3047825    1.769832
              |
          age |   1.002636   .0017483     1.51   0.131     .9992155    1.006069
              |
          sex |
      Female  |   1.034577   .0673805     0.52   0.602     .9105949    1.175439
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2032.4047
Iteration 1:   log pseudolikelihood = -2018.3775
Iteration 2:   log pseudolikelihood = -2015.1609
Iteration 3:   log pseudolikelihood = -2014.8425
Iteration 4:   log pseudolikelihood = -2014.8361
Iteration 5:   log pseudolikelihood = -2014.8361
Refining estimates:
Iteration 0:   log pseudolikelihood = -2014.8361

Cox regression with Breslow method for ties

No. of subjects =       786                             Number of obs =    786
No. of failures =       316
Time at risk    = 17,458.75
                                                        Wald chi2(36) =  40.66
Log pseudolikelihood = -2014.8361                       Prob > chi2   = 0.2727

                                          (Std. err. adjusted for 786 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   3.370503   1.376856     2.97   0.003     1.513483    7.506057
                  paxlovid  |   1.369139   1.251228     0.34   0.731     .2283243    8.209996
              molnupiravir  |   .7876958   .4329529    -0.43   0.664     .2682255     2.31322
                            |
                        age |    1.00449     .00302     1.49   0.136     .9985886    1.010427
                            |
                        sex |
                    Female  |   .9616498   .1094024    -0.34   0.731     .7694488    1.201861
                            |
                 region_nhs |
             East Midlands  |   .8969884   .2277451    -0.43   0.669     .5453395    1.475389
                    London  |   .7511566   .1720122    -1.25   0.211     .4795218    1.176664
                North East  |   .7083363   .1885777    -1.30   0.195     .4203658     1.19358
                North West  |   1.104422   .2756898     0.40   0.691     .6771038    1.801421
                South East  |   .6755971   .1748546    -1.52   0.130      .406803    1.121996
                South West  |   .7598022   .2133693    -0.98   0.328     .4381919    1.317458
             West Midlands  |   1.153333   .2786969     0.59   0.555     .7182349    1.852009
  Yorkshire and The Humber  |   .8539948   .2178992    -0.62   0.536     .5179272    1.408127
                            |
                      imdq5 |
                         2  |   1.180236   .2293337     0.85   0.394     .8064372    1.727298
                         3  |   1.260419   .2520541     1.16   0.247     .8517154    1.865242
                         4  |   1.010782   .2002228     0.05   0.957     .6855603    1.490286
           5 most deprived  |   1.076907    .210722     0.38   0.705     .7338723    1.580285
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.025417   .2048751     0.13   0.900     .6931598    1.516938
                            |
         vaccination_status |
           One vaccination  |   1.155604   .2637056     0.63   0.526     .7388691    1.807386
          Two vaccinations  |   1.310688    .281516     1.26   0.208     .8603477    1.996754
        Three vaccinations  |   .9140444   .1466822    -0.56   0.575      .667375    1.251886
 Four or more vaccinations  |   .7262136   .1751281    -1.33   0.185      .452684    1.165021
                            |
                   diabetes |    .849632   .1959087    -0.71   0.480     .5407048    1.335062
    chronic_cardiac_disease |   .7873277   .1592105    -1.18   0.237     .5296984     1.17026
chronic_respiratory_disease |   .8847134   .1766533    -0.61   0.540     .5981922    1.308472
               hypertension |   .8090029   .1666819    -1.03   0.304      .540224    1.211508
             downs_syndrome |   .9782885   .1376079    -0.16   0.876     .7425665    1.288839
               solid_cancer |   .9812529   .1961766    -0.09   0.925     .6631394    1.451968
               haem_disease |   .8249432    .096124    -1.65   0.099     .6565086    1.036592
              renal_disease |   .8388876   .1114282    -1.32   0.186     .6466063    1.088348
              liver_disease |   1.088118   .2033774     0.45   0.651     .7543624    1.569538
               imid_on_drug |   .8953919   .1301071    -0.76   0.447     .6734839    1.190417
          immunosuppression |   .9594785   .1711831    -0.23   0.817     .6763479    1.361132
                   hiv_aids |   .8925361   .1323184    -0.77   0.443     .6674754    1.193483
           organ_transplant |   1.101264   .2062895     0.51   0.607     .7628577    1.589787
                 rare_neuro |    .995204   .1171765    -0.04   0.967     .7901156    1.253527
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_serious==1
Observed time interval: (stop_ae_spc_serious[_n-1], stop_ae_spc_serious]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     19,030  observations end on or before enter()
--------------------------------------------------------------------------
      5,159  observations remaining, representing
      5,159  subjects
      1,012  failures in single-failure-per-subject data
 133,537.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -8541.2601
Iteration 1:   log pseudolikelihood = -8539.3508
Iteration 2:   log pseudolikelihood = -8539.0128
Iteration 3:   log pseudolikelihood = -8538.9871
Iteration 4:   log pseudolikelihood = -8538.9868
Iteration 5:   log pseudolikelihood = -8538.9868
Refining estimates:
Iteration 0:   log pseudolikelihood = -8538.9868

Cox regression with Breslow method for ties

No. of subjects =      5,159                            Number of obs =  5,159
No. of failures =      1,012
Time at risk    = 133,537.75
                                                        Wald chi2(3)  =   2.65
Log pseudolikelihood = -8538.9868                       Prob > chi2   = 0.4483

                          (Std. err. adjusted for 5,159 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.224688   .4592583     0.54   0.589     .5872519    2.554031
    paxlovid  |   .2162778     .22078    -1.50   0.134     .0292476    1.599311
molnupiravir  |   1.117329   .3789537     0.33   0.744     .5747608    2.172075
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -8541.2601
Iteration 1:   log pseudolikelihood = -8538.1689
Iteration 2:   log pseudolikelihood = -8537.8312
Iteration 3:   log pseudolikelihood = -8537.8055
Iteration 4:   log pseudolikelihood = -8537.8052
Iteration 5:   log pseudolikelihood = -8537.8052
Refining estimates:
Iteration 0:   log pseudolikelihood = -8537.8052

Cox regression with Breslow method for ties

No. of subjects =      5,159                            Number of obs =  5,159
No. of failures =      1,012
Time at risk    = 133,537.75
                                                        Wald chi2(5)  =   4.88
Log pseudolikelihood = -8537.8052                       Prob > chi2   = 0.4311

                          (Std. err. adjusted for 5,159 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.237348    .462097     0.57   0.568     .5951199    2.572643
    paxlovid  |   .2189944    .223554    -1.49   0.137     .0296148    1.619411
molnupiravir  |   1.105668   .3758881     0.30   0.768     .5678663    2.152798
              |
          age |   .9974416   .0017056    -1.50   0.134     .9941042     1.00079
              |
          sex |
      Female  |   .9941094   .0623202    -0.09   0.925     .8791698    1.124076
-------------------------------------------------------------------------------

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood =  -2455.136
Iteration 1:   log pseudolikelihood = -2434.4616
Iteration 2:   log pseudolikelihood = -2433.1943
Iteration 3:   log pseudolikelihood = -2433.1237
Iteration 4:   log pseudolikelihood = -2433.1232
Iteration 5:   log pseudolikelihood = -2433.1232
Refining estimates:
Iteration 0:   log pseudolikelihood = -2433.1232

Cox regression with Breslow method for ties

No. of subjects =  1,695                                Number of obs =  1,695
No. of failures =    335
Time at risk    = 43,980
                                                        Wald chi2(36) =  44.90
Log pseudolikelihood = -2433.1232                       Prob > chi2   = 0.1469

                                        (Std. err. adjusted for 1,695 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.588476   1.390754     1.77   0.077     .9030352    7.419651
                  paxlovid  |   .8872287   .9786874    -0.11   0.914     .1021149    7.708715
              molnupiravir  |   1.507976   .7663097     0.81   0.419     .5569785    4.082727
                            |
                        age |   1.000961   .0030044     0.32   0.749     .9950895    1.006867
                            |
                        sex |
                    Female  |   1.048339   .1177228     0.42   0.674     .8412331    1.306433
                            |
                 region_nhs |
             East Midlands  |   .9536893   .2186981    -0.21   0.836     .6084307    1.494867
                    London  |   .5175347   .1137536    -3.00   0.003     .3363924    .7962194
                North East  |    .836606   .1939983    -0.77   0.442     .5310533    1.317965
                North West  |   .8448057   .1976368    -0.72   0.471     .5341015    1.336257
                South East  |   .6675687   .1585811    -1.70   0.089      .419076    1.063406
                South West  |   .6079861   .1630018    -1.86   0.063     .3594889    1.028257
             West Midlands  |   .6726515   .1640836    -1.63   0.104     .4170151    1.084997
  Yorkshire and The Humber  |    .913594   .2026057    -0.41   0.684     .5915401    1.410985
                            |
                      imdq5 |
                         2  |   1.254324   .2261936     1.26   0.209     .8808698    1.786109
                         3  |   1.126426   .2066988     0.65   0.516      .786154    1.613979
                         4  |   .9816873   .1851218    -0.10   0.922     .6783562    1.420655
           5 most deprived  |   1.085045   .1959418     0.45   0.651     .7616133    1.545828
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .9353689    .189458    -0.33   0.742     .6288875    1.391211
                            |
         vaccination_status |
           One vaccination  |   1.423691   .3015687     1.67   0.095     .9399675    2.156347
          Two vaccinations  |   1.070295   .2371883     0.31   0.759     .6932158    1.652489
        Three vaccinations  |   1.057315   .1633472     0.36   0.718     .7810883    1.431227
 Four or more vaccinations  |   1.046593   .2249833     0.21   0.832     .6867478    1.594991
                            |
                   diabetes |   .9391059   .1904485    -0.31   0.757     .6310923     1.39745
    chronic_cardiac_disease |   .8400159   .1680394    -0.87   0.383     .5675582    1.243267
chronic_respiratory_disease |   1.044569   .1981755     0.23   0.818     .7201901     1.51505
               hypertension |   .6983903   .1441089    -1.74   0.082     .4660769    1.046499
             downs_syndrome |   .9825017   .1372593    -0.13   0.899     .7471661    1.291961
               solid_cancer |   .9577978   .1730396    -0.24   0.811     .6721905    1.364757
               haem_disease |   .9856603   .1103035    -0.13   0.897     .7915363    1.227393
              renal_disease |   .7192672   .0924925    -2.56   0.010     .5590259    .9254406
              liver_disease |   1.235574   .2260903     1.16   0.248     .8632021    1.768582
               imid_on_drug |   1.215982   .1579019     1.51   0.132     .9427441    1.568412
          immunosuppression |   1.093177   .1791742     0.54   0.587     .7928238    1.507316
                   hiv_aids |   .9957121   .1367051    -0.03   0.975     .7607975    1.303162
           organ_transplant |    1.05659   .1969531     0.30   0.768     .7332269    1.522559
                 rare_neuro |   .8333158   .0931985    -1.63   0.103     .6692845    1.037549
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_all==1
Observed time interval: (stop_ae_drug_all[_n-1], stop_ae_drug_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     18,971  observations end on or before enter()
--------------------------------------------------------------------------
      5,218  observations remaining, representing
      5,218  subjects
        968  failures in single-failure-per-subject data
    136,152  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -8186.3505
Iteration 1:   log pseudolikelihood =  -8185.499
Iteration 2:   log pseudolikelihood = -8185.4663
Iteration 3:   log pseudolikelihood = -8185.4662
Refining estimates:
Iteration 0:   log pseudolikelihood = -8185.4662

Cox regression with Breslow method for ties

No. of subjects =   5,218                               Number of obs =  5,218
No. of failures =     968
Time at risk    = 136,152
                                                        Wald chi2(3)  =   1.58
Log pseudolikelihood = -8185.4662                       Prob > chi2   = 0.6651

                          (Std. err. adjusted for 5,218 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   .5894836   .3032055    -1.03   0.304     .2151045    1.615451
    paxlovid  |   1.287617   .4632751     0.70   0.482     .6361077     2.60641
molnupiravir  |   .9534433   .3428368    -0.13   0.895     .4712181    1.929158
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -8186.3505
Iteration 1:   log pseudolikelihood = -8184.3424
Iteration 2:   log pseudolikelihood = -8184.3097
Iteration 3:   log pseudolikelihood = -8184.3096
Refining estimates:
Iteration 0:   log pseudolikelihood = -8184.3096

Cox regression with Breslow method for ties

No. of subjects =   5,218                               Number of obs =  5,218
No. of failures =     968
Time at risk    = 136,152
                                                        Wald chi2(5)  =   4.23
Log pseudolikelihood = -8184.3096                       Prob > chi2   = 0.5174

                          (Std. err. adjusted for 5,218 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   .5874627   .3018024    -1.04   0.300     .2146273    1.607961
    paxlovid  |   1.265167    .458964     0.65   0.517     .6213808    2.575952
molnupiravir  |   .9604687   .3451521    -0.11   0.911     .4748945    1.942537
              |
          age |   .9998028   .0017029    -0.12   0.908     .9964707    1.003146
              |
          sex |
      Female  |   .9068597   .0581841    -1.52   0.128     .7996998    1.028379
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2393.0308
Iteration 1:   log pseudolikelihood = -2377.7471
Iteration 2:   log pseudolikelihood = -2377.3767
Iteration 3:   log pseudolikelihood = -2377.3717
Iteration 4:   log pseudolikelihood = -2377.3717
Refining estimates:
Iteration 0:   log pseudolikelihood = -2377.3717

Cox regression with Breslow method for ties

No. of subjects =     1,744                             Number of obs =  1,744
No. of failures =       325
Time at risk    = 45,405.75
                                                        Wald chi2(36) =  30.03
Log pseudolikelihood = -2377.3717                       Prob > chi2   = 0.7476

                                        (Std. err. adjusted for 1,744 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |    1.02227   .7458714     0.03   0.976     .2446302    4.271905
                  paxlovid  |   2.380551   1.356187     1.52   0.128     .7793859     7.27114
              molnupiravir  |   .3743219   .3707047    -0.99   0.321     .0537365    2.607482
                            |
                        age |   1.000448   .0030065     0.15   0.882     .9945724    1.006358
                            |
                        sex |
                    Female  |   .9193307   .1037459    -0.75   0.456     .7369095     1.14691
                            |
                 region_nhs |
             East Midlands  |   .8825784   .2339841    -0.47   0.638     .5249134    1.483949
                    London  |   1.027884   .2259905     0.13   0.900     .6680343    1.581573
                North East  |   .5972355   .1745725    -1.76   0.078      .336774    1.059138
                North West  |   1.016942   .2635961     0.06   0.948     .6118726    1.690175
                South East  |   1.056447   .2509348     0.23   0.817     .6632305    1.682795
                South West  |   1.125265   .2774841     0.48   0.632     .6939897    1.824552
             West Midlands  |   .7160217   .1899675    -1.26   0.208     .4256906    1.204365
  Yorkshire and The Humber  |   1.020099   .2511315     0.08   0.936     .6296378    1.652701
                            |
                      imdq5 |
                         2  |   1.340635    .252689     1.56   0.120     .9265571    1.939764
                         3  |   1.473069   .2731975     2.09   0.037     1.024137    2.118791
                         4  |   1.000328   .1950559     0.00   0.999     .6825976    1.465952
           5 most deprived  |   1.221417   .2294597     1.06   0.287     .8451893    1.765117
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   1.252562   .2255891     1.25   0.211      .880027    1.782799
                            |
         vaccination_status |
           One vaccination  |   .8379351   .1860824    -0.80   0.426     .5422279    1.294908
          Two vaccinations  |   1.084609   .2252617     0.39   0.696     .7219177    1.629516
        Three vaccinations  |   .9548667   .1379833    -0.32   0.749     .7193489    1.267494
 Four or more vaccinations  |   .7157404   .1799168    -1.33   0.183     .4373083    1.171449
                            |
                   diabetes |   .7447241   .1631322    -1.35   0.178     .4847739    1.144067
    chronic_cardiac_disease |    1.11066   .1902685     0.61   0.540     .7938908    1.553823
chronic_respiratory_disease |   .8546181   .1668302    -0.80   0.421     .5829199    1.252954
               hypertension |   .9706736   .1941785    -0.15   0.882     .6558349    1.436653
             downs_syndrome |    1.08201    .143062     0.60   0.551     .8350001    1.402091
               solid_cancer |   .8210421   .1602222    -1.01   0.312       .56009    1.203575
               haem_disease |   1.008884    .112197     0.08   0.937     .8112974    1.254592
              renal_disease |   1.065464   .1305561     0.52   0.605      .837987    1.354691
              liver_disease |   .7859917   .1397868    -1.35   0.176     .5546688    1.113787
               imid_on_drug |   .9779059   .1304385    -0.17   0.867     .7529377    1.270092
          immunosuppression |   1.049252   .1760848     0.29   0.775     .7551472    1.457901
                   hiv_aids |   .9132841   .1349155    -0.61   0.539     .6836937    1.219973
           organ_transplant |   .8460125   .1441691    -0.98   0.326     .6057919     1.18149
                 rare_neuro |   .9659346   .1112369    -0.30   0.763     .7707676     1.21052
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_serious==1
Observed time interval: (stop_ae_drug_serious[_n-1], stop_ae_drug_serious]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,037  observations end on or before enter()
--------------------------------------------------------------------------
     10,152  observations remaining, representing
     10,152  subjects
        702  failures in single-failure-per-subject data
    280,078  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -6442.4918
Iteration 1:   log pseudolikelihood = -6439.2035
Iteration 2:   log pseudolikelihood = -6438.2761
Iteration 3:   log pseudolikelihood = -6437.9703
Iteration 4:   log pseudolikelihood = -6437.8581
Iteration 5:   log pseudolikelihood = -6437.8168
Iteration 6:   log pseudolikelihood = -6437.8016
Iteration 7:   log pseudolikelihood = -6437.7961
Iteration 8:   log pseudolikelihood =  -6437.794
Iteration 9:   log pseudolikelihood = -6437.7932
Iteration 10:  log pseudolikelihood =  -6437.793
Iteration 11:  log pseudolikelihood = -6437.7929
Iteration 12:  log pseudolikelihood = -6437.7928
Iteration 13:  log pseudolikelihood = -6437.7928
Iteration 14:  log pseudolikelihood = -6437.7928
Iteration 15:  log pseudolikelihood = -6437.7928
Iteration 16:  log pseudolikelihood = -6437.7928
Iteration 17:  log pseudolikelihood = -6437.7928
Iteration 18:  log pseudolikelihood = -6437.7928
Iteration 19:  log pseudolikelihood = -6437.7928
Iteration 20:  log pseudolikelihood = -6437.7928
Iteration 21:  log pseudolikelihood = -6437.7928
Iteration 22:  log pseudolikelihood = -6437.7928
Iteration 23:  log pseudolikelihood = -6437.7928
Iteration 24:  log pseudolikelihood = -6437.7928
Iteration 25:  log pseudolikelihood = -6437.7928
Iteration 26:  log pseudolikelihood = -6437.7928
Iteration 27:  log pseudolikelihood = -6437.7928
Iteration 28:  log pseudolikelihood = -6437.7928
Iteration 29:  log pseudolikelihood = -6437.7928
Refining estimates:
Iteration 0:   log pseudolikelihood = -6437.7928
Iteration 1:   log pseudolikelihood = -6437.7928

Cox regression with Breslow method for ties

No. of subjects =  10,152                             Number of obs =   10,152
No. of failures =     702
Time at risk    = 280,078
                                                      Wald chi2(3)  = 42215.23
Log pseudolikelihood = -6437.7928                     Prob > chi2   =   0.0000

                         (Std. err. adjusted for 10,152 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   9.27e-14   1.35e-14  -205.37   0.000     6.96e-14    1.23e-13
    paxlovid  |      1.658   .7205919     1.16   0.245      .707358     3.88624
molnupiravir  |   .5129434   .3632233    -0.94   0.346     .1280325    2.055033
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -6442.4918
Iteration 1:   log pseudolikelihood = -6439.0421
Iteration 2:   log pseudolikelihood = -6438.1147
Iteration 3:   log pseudolikelihood = -6437.8089
Iteration 4:   log pseudolikelihood = -6437.6967
Iteration 5:   log pseudolikelihood = -6437.6554
Iteration 6:   log pseudolikelihood = -6437.6402
Iteration 7:   log pseudolikelihood = -6437.6346
Iteration 8:   log pseudolikelihood = -6437.6326
Iteration 9:   log pseudolikelihood = -6437.6318
Iteration 10:  log pseudolikelihood = -6437.6315
Iteration 11:  log pseudolikelihood = -6437.6314
Iteration 12:  log pseudolikelihood = -6437.6314
Iteration 13:  log pseudolikelihood = -6437.6314
Iteration 14:  log pseudolikelihood = -6437.6314
Iteration 15:  log pseudolikelihood = -6437.6314
Iteration 16:  log pseudolikelihood = -6437.6314
Iteration 17:  log pseudolikelihood = -6437.6314
Iteration 18:  log pseudolikelihood = -6437.6314
Iteration 19:  log pseudolikelihood = -6437.6314
Iteration 20:  log pseudolikelihood = -6437.6314
Iteration 21:  log pseudolikelihood = -6437.6314
Iteration 22:  log pseudolikelihood = -6437.6314
Iteration 23:  log pseudolikelihood = -6437.6314
Iteration 24:  log pseudolikelihood = -6437.6314
Iteration 25:  log pseudolikelihood = -6437.6314
Iteration 26:  log pseudolikelihood = -6437.6314
Iteration 27:  log pseudolikelihood = -6437.6314
Iteration 28:  log pseudolikelihood = -6437.6314
Iteration 29:  log pseudolikelihood = -6437.6314
Iteration 30:  log pseudolikelihood = -6437.6314
Iteration 31:  log pseudolikelihood = -6437.6314
Iteration 32:  log pseudolikelihood = -6437.6314
Iteration 33:  log pseudolikelihood = -6437.6314
Iteration 34:  log pseudolikelihood = -6437.6314
Iteration 35:  log pseudolikelihood = -6437.6314
Iteration 36:  log pseudolikelihood = -6437.6314
Iteration 37:  log pseudolikelihood = -6437.6314
Iteration 38:  log pseudolikelihood = -6437.6314
Iteration 39:  log pseudolikelihood = -6437.6314
Iteration 40:  log pseudolikelihood = -6437.6314
Iteration 41:  log pseudolikelihood = -6437.6314
Iteration 42:  log pseudolikelihood = -6437.6314
Iteration 43:  log pseudolikelihood = -6437.6314
Iteration 44:  log pseudolikelihood = -6437.6314
Iteration 45:  log pseudolikelihood = -6437.6314
Iteration 46:  log pseudolikelihood = -6437.6314
Refining estimates:
Iteration 0:   log pseudolikelihood = -6437.6314

Cox regression with Breslow method for ties

No. of subjects =  10,152                               Number of obs = 10,152
No. of failures =     702
Time at risk    = 280,078
                                                        Wald chi2(4)  =   2.49
Log pseudolikelihood = -6437.6314                       Prob > chi2   = 0.6458

                         (Std. err. adjusted for 10,152 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.04e-20          .        .       .            .           .
    paxlovid  |   1.654572   .7190413     1.16   0.247     .7059462    3.877926
molnupiravir  |   .5110199   .3622637    -0.95   0.344     .1273557    2.050489
              |
          age |    1.00106   .0019961     0.53   0.595     .9971555     1.00498
              |
          sex |
      Female  |   1.015223   .0766076     0.20   0.841     .8756506    1.177043
-------------------------------------------------------------------------------

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -1881.0694
Iteration 1:   log pseudolikelihood = -1862.7722
Iteration 2:   log pseudolikelihood = -1861.9349
Iteration 3:   log pseudolikelihood = -1861.7239
Iteration 4:   log pseudolikelihood = -1861.6466
Iteration 5:   log pseudolikelihood = -1861.6182
Iteration 6:   log pseudolikelihood = -1861.6077
Iteration 7:   log pseudolikelihood = -1861.6039
Iteration 8:   log pseudolikelihood = -1861.6025
Iteration 9:   log pseudolikelihood = -1861.6019
Iteration 10:  log pseudolikelihood = -1861.6017
Iteration 11:  log pseudolikelihood = -1861.6017
Iteration 12:  log pseudolikelihood = -1861.6016
Iteration 13:  log pseudolikelihood = -1861.6016
Iteration 14:  log pseudolikelihood = -1861.6016
Iteration 15:  log pseudolikelihood = -1861.6016
Iteration 16:  log pseudolikelihood = -1861.6016
Iteration 17:  log pseudolikelihood = -1861.6016
Iteration 18:  log pseudolikelihood = -1861.6016
Iteration 19:  log pseudolikelihood = -1861.6016
Iteration 20:  log pseudolikelihood = -1861.6016
Iteration 21:  log pseudolikelihood = -1861.6016
Iteration 22:  log pseudolikelihood = -1861.6016
Iteration 23:  log pseudolikelihood = -1861.6016
Iteration 24:  log pseudolikelihood = -1861.6016
Iteration 25:  log pseudolikelihood = -1861.6016
Iteration 26:  log pseudolikelihood = -1861.6016
Iteration 27:  log pseudolikelihood = -1861.6016
Iteration 28:  log pseudolikelihood = -1861.6016
Iteration 29:  log pseudolikelihood = -1861.6016
Refining estimates:
Iteration 0:   log pseudolikelihood = -1861.6016
Iteration 1:   log pseudolikelihood = -1861.6016
Iteration 2:   log pseudolikelihood = -1861.6016
Iteration 3:   log pseudolikelihood = -1861.6016
Iteration 4:   log pseudolikelihood = -1861.6016
Iteration 5:   log pseudolikelihood = -1861.6016

Cox regression with Breslow method for ties

No. of subjects =     3,355                           Number of obs =    3,355
No. of failures =       233
Time at risk    = 92,705.25
                                                      Wald chi2(36) = 31190.81
Log pseudolikelihood = -1861.6016                     Prob > chi2   =   0.0000

                                        (Std. err. adjusted for 3,355 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   1.34e-15   3.84e-16  -119.24   0.000     7.61e-16    2.35e-15
                  paxlovid  |   1.652354   1.185641     0.70   0.484     .4048797    6.743418
              molnupiravir  |   1.51e-15   4.24e-16  -121.37   0.000     8.69e-16    2.62e-15
                            |
                        age |   1.001555    .003506     0.44   0.657     .9947065     1.00845
                            |
                        sex |
                    Female  |   .8850252   .1171157    -0.92   0.356      .682835    1.147085
                            |
                 region_nhs |
             East Midlands  |   .7544234   .2221415    -0.96   0.339     .4236207    1.343548
                    London  |    .702034   .1752536    -1.42   0.156     .4303946    1.145116
                North East  |   .6781996   .1957534    -1.35   0.179     .3851849    1.194114
                North West  |   .9096424   .2523578    -0.34   0.733     .5281118    1.566807
                South East  |   .9664616   .2500971    -0.13   0.895      .581988    1.604927
                South West  |   .7808002   .2211017    -0.87   0.382     .4482315    1.360121
             West Midlands  |   .7409288   .2093114    -1.06   0.288     .4259055    1.288961
  Yorkshire and The Humber  |   .5294398    .166288    -2.02   0.043     .2860676     .979861
                            |
                      imdq5 |
                         2  |   .9323493   .2006739    -0.33   0.745     .6114635    1.421631
                         3  |   1.225134    .252143     0.99   0.324     .8184627    1.833868
                         4  |    .891883   .1933252    -0.53   0.598     .5831775    1.364002
           5 most deprived  |   1.035369    .216687     0.17   0.868     .6869918     1.56041
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8796433   .1951591    -0.58   0.563     .5694526      1.3588
                            |
         vaccination_status |
           One vaccination  |   .8673822    .229569    -0.54   0.591     .5163259    1.457126
          Two vaccinations  |   1.622713   .3814461     2.06   0.039     1.023652    2.572355
        Three vaccinations  |   .9512315   .1718342    -0.28   0.782     .6676084    1.355347
 Four or more vaccinations  |    1.03995   .2736185     0.15   0.882     .6209476    1.741686
                            |
                   diabetes |   .7043879   .1838336    -1.34   0.179     .4223402    1.174793
    chronic_cardiac_disease |   .9182732   .2054254    -0.38   0.703     .5923126    1.423616
chronic_respiratory_disease |   .9974052    .221516    -0.01   0.991     .6453961    1.541406
               hypertension |   .7907937   .1931393    -0.96   0.337     .4899708     1.27631
             downs_syndrome |   .8973682   .1529074    -0.64   0.525     .6425839    1.253174
               solid_cancer |   1.162392   .2337489     0.75   0.454     .7837577    1.723945
               haem_disease |   1.351873    .180324     2.26   0.024     1.040868    1.755804
              renal_disease |   1.309647   .1855885     1.90   0.057      .992045    1.728928
              liver_disease |   1.152513   .2337965     0.70   0.484     .7744128    1.715216
               imid_on_drug |   1.004436    .160434     0.03   0.978     .7344526    1.373665
          immunosuppression |   .8191943   .1842765    -0.89   0.375     .5271212    1.273102
                   hiv_aids |   .8429851    .147626    -0.98   0.329     .5980742    1.188187
           organ_transplant |   .9547497    .194818    -0.23   0.820     .6400305    1.424224
                 rare_neuro |   1.000746   .1358998     0.01   0.996     .7668885    1.305918
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_all==1
Observed time interval: (stop_ae_imae_all[_n-1], stop_ae_imae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     20,867  observations end on or before enter()
--------------------------------------------------------------------------
      3,322  observations remaining, representing
      3,322  subjects
        959  failures in single-failure-per-subject data
     80,744  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7619.8163
Iteration 1:   log pseudolikelihood = -7618.9157
Iteration 2:   log pseudolikelihood = -7618.8589
Iteration 3:   log pseudolikelihood = -7618.8585
Iteration 4:   log pseudolikelihood = -7618.8585
Refining estimates:
Iteration 0:   log pseudolikelihood = -7618.8585

Cox regression with Breslow method for ties

No. of subjects =  3,322                                Number of obs =  3,322
No. of failures =    959
Time at risk    = 80,744
                                                        Wald chi2(3)  =   1.58
Log pseudolikelihood = -7618.8585                       Prob > chi2   = 0.6650

                          (Std. err. adjusted for 3,322 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   .9951264   .3483079    -0.01   0.989     .5011249    1.976107
    paxlovid  |   .5021511   .2859931    -1.21   0.226     .1644541     1.53329
molnupiravir  |    .848278    .410758    -0.34   0.734     .3283708    2.191351
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7619.8163
Iteration 1:   log pseudolikelihood = -7618.5626
Iteration 2:   log pseudolikelihood = -7618.5059
Iteration 3:   log pseudolikelihood = -7618.5055
Iteration 4:   log pseudolikelihood = -7618.5055
Refining estimates:
Iteration 0:   log pseudolikelihood = -7618.5055

Cox regression with Breslow method for ties

No. of subjects =  3,322                                Number of obs =  3,322
No. of failures =    959
Time at risk    = 80,744
                                                        Wald chi2(5)  =   2.34
Log pseudolikelihood = -7618.5055                       Prob > chi2   = 0.8010

                          (Std. err. adjusted for 3,322 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.003143   .3514731     0.01   0.993     .5048077    1.993425
    paxlovid  |   .5087551   .2900267    -1.19   0.236     .1664421    1.555086
molnupiravir  |   .8484105   .4113234    -0.34   0.735      .328042    2.194232
              |
          age |    .998832   .0016727    -0.70   0.485      .995559    1.002116
              |
          sex |
      Female  |   1.032502   .0663892     0.50   0.619     .9102466    1.171177
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2251.4957
Iteration 1:   log pseudolikelihood = -2237.1731
Iteration 2:   log pseudolikelihood = -2236.5139
Iteration 3:   log pseudolikelihood = -2236.3006
Iteration 4:   log pseudolikelihood = -2236.2222
Iteration 5:   log pseudolikelihood = -2236.1933
Iteration 6:   log pseudolikelihood = -2236.1827
Iteration 7:   log pseudolikelihood = -2236.1788
Iteration 8:   log pseudolikelihood = -2236.1774
Iteration 9:   log pseudolikelihood = -2236.1769
Iteration 10:  log pseudolikelihood = -2236.1767
Iteration 11:  log pseudolikelihood = -2236.1766
Iteration 12:  log pseudolikelihood = -2236.1766
Iteration 13:  log pseudolikelihood = -2236.1766
Iteration 14:  log pseudolikelihood = -2236.1766
Iteration 15:  log pseudolikelihood = -2236.1766
Iteration 16:  log pseudolikelihood = -2236.1766
Iteration 17:  log pseudolikelihood = -2236.1766
Iteration 18:  log pseudolikelihood = -2236.1766
Iteration 19:  log pseudolikelihood = -2236.1766
Iteration 20:  log pseudolikelihood = -2236.1766
Iteration 21:  log pseudolikelihood = -2236.1766
Iteration 22:  log pseudolikelihood = -2236.1766
Iteration 23:  log pseudolikelihood = -2236.1766
Iteration 24:  log pseudolikelihood = -2236.1766
Iteration 25:  log pseudolikelihood = -2236.1766
Iteration 26:  log pseudolikelihood = -2236.1766
Iteration 27:  log pseudolikelihood = -2236.1766
Iteration 28:  log pseudolikelihood = -2236.1766
Iteration 29:  log pseudolikelihood = -2236.1766
Iteration 30:  log pseudolikelihood = -2236.1766
Refining estimates:
Iteration 0:   log pseudolikelihood = -2236.1766
Iteration 1:   log pseudolikelihood = -2236.1766
Iteration 2:   log pseudolikelihood = -2236.1766
Iteration 3:   log pseudolikelihood = -2236.1766
Iteration 4:   log pseudolikelihood = -2236.1766

Cox regression with Breslow method for ties

No. of subjects =  1,125                               Number of obs =   1,125
No. of failures =    328
Time at risk    = 27,316
                                                       Wald chi2(36) = 8019.92
Log pseudolikelihood = -2236.1766                      Prob > chi2   =  0.0000

                                        (Std. err. adjusted for 1,125 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |    1.07159   .5900038     0.13   0.900     .3642234    3.152749
                  paxlovid  |   1.47e-15   9.21e-16   -54.50   0.000     4.30e-16    5.02e-15
              molnupiravir  |   1.50e-15   7.70e-16   -66.42   0.000     5.47e-16    4.10e-15
                            |
                        age |   1.000225   .0028965     0.08   0.938     .9945636    1.005918
                            |
                        sex |
                    Female  |   1.034842   .1181117     0.30   0.764      .827413    1.294273
                            |
                 region_nhs |
             East Midlands  |   1.286116   .3718512     0.87   0.384     .7297511    2.266657
                    London  |   1.614009   .4175527     1.85   0.064      .972066    2.679886
                North East  |    1.50983   .4258271     1.46   0.144      .868677    2.624206
                North West  |   1.203636   .3594645     0.62   0.535     .6703241    2.161253
                South East  |   1.886667   .5230822     2.29   0.022     1.095716    3.248573
                South West  |   1.846837   .5244046     2.16   0.031       1.0586    3.221996
             West Midlands  |   1.128617   .3449704     0.40   0.692     .6199699    2.054579
  Yorkshire and The Humber  |   1.745768   .4818732     2.02   0.044      1.01633    2.998736
                            |
                      imdq5 |
                         2  |   1.113734   .2060802     0.58   0.560     .7749595    1.600604
                         3  |   1.172975   .2152778     0.87   0.385     .8185896     1.68078
                         4  |   1.109449   .2005215     0.57   0.566      .778505    1.581078
           5 most deprived  |   .9852925   .1771607    -0.08   0.934     .6926514    1.401573
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .9783409   .1958392    -0.11   0.913     .6608473    1.448369
                            |
         vaccination_status |
           One vaccination  |   1.151792   .2472799     0.66   0.510      .756186    1.754365
          Two vaccinations  |   1.052005   .2354876     0.23   0.821     .6783903    1.631385
        Three vaccinations  |   1.058366   .1715094     0.35   0.726     .7703668    1.454032
 Four or more vaccinations  |    1.33705   .2923046     1.33   0.184     .8710816     2.05228
                            |
                   diabetes |   .9094485   .1743813    -0.50   0.621     .6245472    1.324314
    chronic_cardiac_disease |   .9507006   .1764466    -0.27   0.785     .6607906    1.367803
chronic_respiratory_disease |   .8659892   .1621156    -0.77   0.442     .6000192    1.249855
               hypertension |   .7467134   .1579644    -1.38   0.167     .4932709    1.130375
             downs_syndrome |   1.164555   .1565639     1.13   0.257     .8947954    1.515641
               solid_cancer |   1.148303   .2105524     0.75   0.451     .8016422    1.644874
               haem_disease |   1.040245   .1168971     0.35   0.726     .8346075     1.29655
              renal_disease |   1.168975   .1428813     1.28   0.201     .9199512    1.485408
              liver_disease |   .9316657   .1730675    -0.38   0.703     .6473509    1.340851
               imid_on_drug |   1.113595   .1515588     0.79   0.429     .8528641    1.454034
          immunosuppression |   .8607939   .1580861    -0.82   0.414     .6005854     1.23374
                   hiv_aids |   1.027135   .1429078     0.19   0.847     .7819835     1.34914
           organ_transplant |   .9536225    .176045    -0.26   0.797     .6641086    1.369348
                 rare_neuro |   1.098241   .1294902     0.79   0.427     .8716364    1.383759
---------------------------------------------------------------------------------------------

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_serious==1
Observed time interval: (stop_ae_imae_serious[_n-1], stop_ae_imae_serious]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     16,607  observations end on or before enter()
--------------------------------------------------------------------------
      7,582  observations remaining, representing
      7,582  subjects
        897  failures in single-failure-per-subject data
 204,307.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7952.1371
Iteration 1:   log pseudolikelihood = -7950.8786
Iteration 2:   log pseudolikelihood = -7950.7114
Iteration 3:   log pseudolikelihood = -7950.7103
Iteration 4:   log pseudolikelihood = -7950.7103
Refining estimates:
Iteration 0:   log pseudolikelihood = -7950.7103

Cox regression with Breslow method for ties

No. of subjects =      7,582                            Number of obs =  7,582
No. of failures =        897
Time at risk    = 204,307.75
                                                        Wald chi2(3)  =   3.49
Log pseudolikelihood = -7950.7103                       Prob > chi2   = 0.3217

                          (Std. err. adjusted for 7,582 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |   1.756048   .6077417     1.63   0.104     .8911448    3.460384
    paxlovid  |   1.004799   .5192302     0.01   0.993     .3649392    2.766546
molnupiravir  |   1.461886   .5951598     0.93   0.351     .6582249     3.24678
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

Iteration 0:   log pseudolikelihood = -7952.1371
Iteration 1:   log pseudolikelihood = -7950.2965
Iteration 2:   log pseudolikelihood = -7950.1291
Iteration 3:   log pseudolikelihood =  -7950.128
Iteration 4:   log pseudolikelihood =  -7950.128
Refining estimates:
Iteration 0:   log pseudolikelihood =  -7950.128

Cox regression with Breslow method for ties

No. of subjects =      7,582                            Number of obs =  7,582
No. of failures =        897
Time at risk    = 204,307.75
                                                        Wald chi2(5)  =   4.64
Log pseudolikelihood = -7950.128                        Prob > chi2   = 0.4614

                          (Std. err. adjusted for 7,582 clusters in patient_id)
-------------------------------------------------------------------------------
              |               Robust
           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
         drug |
  sotrovimab  |    1.76685   .6115572     1.64   0.100     .8965501    3.481969
    paxlovid  |   1.003833    .518845     0.01   0.994     .3645076    2.764501
molnupiravir  |    1.45156   .5910377     0.92   0.360     .6535033    3.224202
              |
          age |   .9984396   .0017589    -0.89   0.375     .9949982    1.001893
              |
          sex |
      Female  |    .958934   .0638819    -0.63   0.529     .8415572    1.092682
-------------------------------------------------------------------------------

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date
  Enter on or after: time start_date
        ID variable: patient_id

note: White omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -2431.0902
Iteration 1:   log pseudolikelihood = -2417.6282
Iteration 2:   log pseudolikelihood = -2417.2623
Iteration 3:   log pseudolikelihood = -2417.2577
Iteration 4:   log pseudolikelihood = -2417.2577
Refining estimates:
Iteration 0:   log pseudolikelihood = -2417.2577

Cox regression with Breslow method for ties

No. of subjects =     2,529                             Number of obs =  2,529
No. of failures =       313
Time at risk    = 68,056.25
                                                        Wald chi2(36) =  29.78
Log pseudolikelihood = -2417.2577                       Prob > chi2   = 0.7580

                                        (Std. err. adjusted for 2,529 clusters in patient_id)
---------------------------------------------------------------------------------------------
                            |               Robust
                         _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                       drug |
                sotrovimab  |   2.075777   1.139146     1.33   0.183     .7080398    6.085603
                  paxlovid  |   .6922805   .7085594    -0.36   0.719     .0931247    5.146353
              molnupiravir  |    1.99886   1.474599     0.94   0.348      .470797    8.486545
                            |
                        age |   1.001522    .002947     0.52   0.605      .995763    1.007315
                            |
                        sex |
                    Female  |   1.108841   .1278874     0.90   0.370     .8844975    1.390087
                            |
                 region_nhs |
             East Midlands  |   1.214057   .3298189     0.71   0.475     .7128463    2.067675
                    London  |   1.360371     .32014     1.31   0.191     .8577122    2.157611
                North East  |   1.256356   .3418646     0.84   0.402     .7370445    2.141566
                North West  |   1.041513   .2896425     0.15   0.884     .6038755    1.796313
                South East  |   1.086063   .2964303     0.30   0.762     .6361035    1.854309
                South West  |   1.396276   .3671852     1.27   0.204      .833925    2.337845
             West Midlands  |   .7986484   .2400028    -0.75   0.454     .4431595      1.4393
  Yorkshire and The Humber  |   1.078684   .2947566     0.28   0.782     .6313912     1.84285
                            |
                      imdq5 |
                         2  |   1.271462   .2218452     1.38   0.169     .9032032     1.78987
                         3  |   .9370706    .182255    -0.33   0.738     .6400566    1.371912
                         4  |   1.129006   .2070505     0.66   0.508     .7881206    1.617334
           5 most deprived  |   .9662076    .178293    -0.19   0.852     .6729756    1.387208
                            |
                      White |          1  (omitted)
                            |
   paxlovid_contraindicated |   .8624633   .1789455    -0.71   0.476     .5742907    1.295238
                            |
         vaccination_status |
           One vaccination  |   1.090603   .2389355     0.40   0.692     .7098726    1.675532
          Two vaccinations  |   1.110496   .2494875     0.47   0.641     .7149626    1.724847
        Three vaccinations  |   1.062331   .1670657     0.38   0.701     .7805439    1.445848
 Four or more vaccinations  |   1.033047   .2411088     0.14   0.889     .6538122     1.63225
                            |
                   diabetes |   .9021695   .1854383    -0.50   0.616     .6030122     1.34974
    chronic_cardiac_disease |   1.020607   .1862743     0.11   0.911     .7136788    1.459533
chronic_respiratory_disease |   1.087244   .1994514     0.46   0.648      .758887    1.557677
               hypertension |   .7547271   .1680094    -1.26   0.206     .4878704     1.16755
             downs_syndrome |   1.114069   .1527621     0.79   0.431     .8515196    1.457571
               solid_cancer |   1.159783   .2037368     0.84   0.399     .8219542     1.63646
               haem_disease |   .9466352   .1079923    -0.48   0.631     .7569679    1.183826
              renal_disease |     .94724   .1165679    -0.44   0.660      .744236    1.205617
              liver_disease |   1.178225   .2285075     0.85   0.398     .8056465    1.723107
               imid_on_drug |   1.173118   .1606234     1.17   0.244      .897006    1.534223
          immunosuppression |   1.093551   .1943619     0.50   0.615     .7718817    1.549269
                   hiv_aids |   .7162467   .1158342    -2.06   0.039     .5216786    .9833819
           organ_transplant |   1.088043   .2141954     0.43   0.668     .7397346    1.600354
                 rare_neuro |   1.050582   .1237072     0.42   0.675     .8340653    1.323305
---------------------------------------------------------------------------------------------

. postclose `cox_model_summary_sens_6'

. 
. **** Rates of events 
. tempname coxoutput_rates_sens_6

. postfile `coxoutput_rates_sens_6' str20(failure) ///
>                 all_ptime all_events all_rate all_lci all_uci ///
>                 control_ptime control_events control_rate control_lci_ control_uci ///
>                 sot_ptime sot_events sot_rate sot_lci sot_uci ///
>                 pax_ptime pax_events pax_rate pax_lci pax_uci ///
>                 mol_ptime mol_events mol_rate mol_lci mol_uci ///
>                 using "$projectdir/output/tables/cox_model_rates_sens_6", replace       

. foreach fail in $ae_disease $ae_disease_serious $ae_combined  {
  2.         stset stop_`fail' if high_risk_cohort_codelist==1, id(patient_id) origin(time start_date_delay) enter(time start_date_delay) failure(fail_`f
> ail'==1)            
  3.         stptime 
  4.                                         local all_rate = `r(rate)'
  5.                                         local all_ptime = `r(ptime)'
  6.                                         local all_lci = `r(lb)'
  7.                                         local all_uci = `r(ub)'
  8.                                         local all_events = `r(failures)'                                        
  9.                 stptime if drug == 0
 10.                                         local control_rate = `r(rate)'
 11.                                         local control_ptime = `r(ptime)'
 12.                                         local control_lci = `r(lb)'
 13.                                         local control_uci = `r(ub)'
 14.                                         local control_events = `r(failures)'
 15.                 display "no drug"
 16.                 stptime if drug == 1
 17.                                         local sot_rate = `r(rate)'
 18.                                         local sot_ptime = `r(ptime)'
 19.                                         local sot_lci = `r(lb)'
 20.                                         local sot_uci = `r(ub)'
 21.                                         local sot_events = `r(failures)'
 22.                 display "sotrovimab"
 23.                 stptime if drug == 2
 24.                                         local pax_rate = `r(rate)'
 25.                                         local pax_ptime = `r(ptime)'
 26.                                         local pax_lci = `r(lb)'
 27.                                         local pax_uci = `r(ub)'
 28.                                         local pax_events = `r(failures)'                
 29.                 display "paxlovid"
 30.                 stptime if drug == 3
 31.                                         local mol_rate = `r(rate)'
 32.                                         local mol_ptime = `r(ptime)'
 33.                                         local mol_lci = `r(lb)'
 34.                                         local mol_uci = `r(ub)'
 35.                                         local mol_events = `r(failures)'                
 36.                 display "molnupavir"                    
 37.                 post `coxoutput_rates_sens_6' ("`fail'")        (`all_ptime') (`all_events') (`all_rate') (`all_lci') (`all_uci') ///
>                                         (`control_ptime') (`control_events') (`control_rate') (`control_lci') (`control_uci') ///
>                                         (`sot_ptime') (`sot_events') (`sot_rate') (`sot_lci') (`sot_uci') ///
>                                         (`pax_ptime') (`pax_events') (`pax_rate') (`pax_lci') (`pax_uci') ///
>                                         (`mol_ptime') (`mol_events') (`mol_rate') (`mol_lci') (`mol_uci')       
 38.                                         
. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_diverticulitis==1
Observed time interval: (stop_ae_diverticulitis[_n-1], stop_ae_diverticulitis]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,198  observations end on or before enter()
--------------------------------------------------------------------------
      9,991  observations remaining, representing
      9,991  subjects
        645  failures in single-failure-per-subject data
 258,303.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_diverticulitis==1
   Analysis time _t: (stop_ae_diverticulitis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    258303.75        645   .00249706   .0023116    .0026974

         Failure _d: fail_ae_diverticulitis==1
   Analysis time _t: (stop_ae_diverticulitis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       253851        639   .00251722   .0023294    .0027202
no drug

         Failure _d: fail_ae_diverticulitis==1
   Analysis time _t: (stop_ae_diverticulitis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1434          0           0          .           .
sotrovimab

         Failure _d: fail_ae_diverticulitis==1
   Analysis time _t: (stop_ae_diverticulitis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1191.75          3   .00251731   .0008119    .0078051
paxlovid

         Failure _d: fail_ae_diverticulitis==1
   Analysis time _t: (stop_ae_diverticulitis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1827          3   .00164204   .0005296    .0050912
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_diarrhoea==1
Observed time interval: (stop_ae_diarrhoea[_n-1], stop_ae_diarrhoea]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,153  observations end on or before enter()
--------------------------------------------------------------------------
     10,036  observations remaining, representing
     10,036  subjects
        702  failures in single-failure-per-subject data
    258,644  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_diarrhoea==1
   Analysis time _t: (stop_ae_diarrhoea-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258644        702   .00271416   .0025206    .0029225

         Failure _d: fail_ae_diarrhoea==1
   Analysis time _t: (stop_ae_diarrhoea-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       254646        694   .00272535   .0025299    .0029358
no drug

         Failure _d: fail_ae_diarrhoea==1
   Analysis time _t: (stop_ae_diarrhoea-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1326          4   .00301659   .0011322    .0080374
sotrovimab

         Failure _d: fail_ae_diarrhoea==1
   Analysis time _t: (stop_ae_diarrhoea-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1066          1   .00093809   .0001321    .0066595
paxlovid

         Failure _d: fail_ae_diarrhoea==1
   Analysis time _t: (stop_ae_diarrhoea-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1606          3     .001868   .0006025    .0057918
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_taste==1
Observed time interval: (stop_ae_taste[_n-1], stop_ae_taste]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     12,422  observations end on or before enter()
--------------------------------------------------------------------------
     11,767  observations remaining, representing
     11,767  subjects
        559  failures in single-failure-per-subject data
 305,296.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_taste==1
   Analysis time _t: (stop_ae_taste-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    305296.25        559   .00183101   .0016853    .0019893

         Failure _d: fail_ae_taste==1
   Analysis time _t: (stop_ae_taste-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       300436        550   .00183067   .0016839    .0019902
no drug

         Failure _d: fail_ae_taste==1
   Analysis time _t: (stop_ae_taste-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1621.75          6   .00369971   .0016621    .0082351
sotrovimab

         Failure _d: fail_ae_taste==1
   Analysis time _t: (stop_ae_taste-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1336          1    .0007485   .0001054    .0053137
paxlovid

         Failure _d: fail_ae_taste==1
   Analysis time _t: (stop_ae_taste-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       1902.5          2   .00105125   .0002629    .0042034
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_rash==1
Observed time interval: (stop_ae_rash[_n-1], stop_ae_rash]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,143  observations end on or before enter()
--------------------------------------------------------------------------
     10,046  observations remaining, representing
     10,046  subjects
        680  failures in single-failure-per-subject data
    259,294  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_rash==1
   Analysis time _t: (stop_ae_rash-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       259294        680   .00262251   .0024326    .0028272

         Failure _d: fail_ae_rash==1
   Analysis time _t: (stop_ae_rash-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       255117        673   .00263801    .002446     .002845
no drug

         Failure _d: fail_ae_rash==1
   Analysis time _t: (stop_ae_rash-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1348          3   .00222552   .0007178    .0069004
sotrovimab

         Failure _d: fail_ae_rash==1
   Analysis time _t: (stop_ae_rash-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1226          1   .00081566   .0001149    .0057904
paxlovid

         Failure _d: fail_ae_rash==1
   Analysis time _t: (stop_ae_rash-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1603          3   .00187149   .0006036    .0058027
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_bronchospasm==1
Observed time interval: (stop_ae_bronchospasm[_n-1], stop_ae_bronchospasm]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,275  observations end on or before enter()
--------------------------------------------------------------------------
     13,914  observations remaining, representing
     13,914  subjects
        328  failures in single-failure-per-subject data
    364,712  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_bronchospasm==1
   Analysis time _t: (stop_ae_bronchospasm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       364712        328   .00089934   .0008071    .0010021

         Failure _d: fail_ae_bronchospasm==1
   Analysis time _t: (stop_ae_bronchospasm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       359224        325   .00090473   .0008115    .0010086
no drug

         Failure _d: fail_ae_bronchospasm==1
   Analysis time _t: (stop_ae_bronchospasm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1776          2   .00112613   .0002816    .0045027
sotrovimab

         Failure _d: fail_ae_bronchospasm==1
   Analysis time _t: (stop_ae_bronchospasm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1492          1   .00067024   .0000944    .0047581
paxlovid

         Failure _d: fail_ae_bronchospasm==1
   Analysis time _t: (stop_ae_bronchospasm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2220          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_contactderm==1
Observed time interval: (stop_ae_contactderm[_n-1], stop_ae_contactderm]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,118  observations end on or before enter()
--------------------------------------------------------------------------
     10,071  observations remaining, representing
     10,071  subjects
        639  failures in single-failure-per-subject data
    260,426  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_contactderm==1
   Analysis time _t: (stop_ae_contactderm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       260426        639   .00245367   .0022706    .0026515

         Failure _d: fail_ae_contactderm==1
   Analysis time _t: (stop_ae_contactderm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       256322        629   .00245394   .0022695    .0026534
no drug

         Failure _d: fail_ae_contactderm==1
   Analysis time _t: (stop_ae_contactderm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1294          6   .00463679   .0020831    .0103209
sotrovimab

         Failure _d: fail_ae_contactderm==1
   Analysis time _t: (stop_ae_contactderm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1256          2   .00159236   .0003982    .0063669
paxlovid

         Failure _d: fail_ae_contactderm==1
   Analysis time _t: (stop_ae_contactderm-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1554          2     .001287   .0003219     .005146
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_dizziness==1
Observed time interval: (stop_ae_dizziness[_n-1], stop_ae_dizziness]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,119  observations end on or before enter()
--------------------------------------------------------------------------
     10,070  observations remaining, representing
     10,070  subjects
        615  failures in single-failure-per-subject data
    260,688  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_dizziness==1
   Analysis time _t: (stop_ae_dizziness-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       260688        615   .00235914   .0021799    .0025532

         Failure _d: fail_ae_dizziness==1
   Analysis time _t: (stop_ae_dizziness-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       256450        606   .00236303   .0021822    .0025589
no drug

         Failure _d: fail_ae_dizziness==1
   Analysis time _t: (stop_ae_dizziness-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1329          1   .00075245    .000106    .0053417
sotrovimab

         Failure _d: fail_ae_dizziness==1
   Analysis time _t: (stop_ae_dizziness-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1309          4   .00305577   .0011469    .0081418
paxlovid

         Failure _d: fail_ae_dizziness==1
   Analysis time _t: (stop_ae_dizziness-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1600          4       .0025   .0009383     .006661
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_nausea_vomit==1
Observed time interval: (stop_ae_nausea_vomit[_n-1], stop_ae_nausea_vomit]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     12,504  observations end on or before enter()
--------------------------------------------------------------------------
     11,685  observations remaining, representing
     11,685  subjects
        506  failures in single-failure-per-subject data
    304,378  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_nausea_vomit==1
   Analysis time _t: (stop_ae_nausea_vomit-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       304378        506   .00166241   .0015237    .0018138

         Failure _d: fail_ae_nausea_vomit==1
   Analysis time _t: (stop_ae_nausea_vomit-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       299765        501   .00167131   .0015312    .0018243
no drug

         Failure _d: fail_ae_nausea_vomit==1
   Analysis time _t: (stop_ae_nausea_vomit-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1633          1   .00061237   .0000863    .0043473
sotrovimab

         Failure _d: fail_ae_nausea_vomit==1
   Analysis time _t: (stop_ae_nausea_vomit-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1278          2   .00156495   .0003914    .0062573
paxlovid

         Failure _d: fail_ae_nausea_vomit==1
   Analysis time _t: (stop_ae_nausea_vomit-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1702          2   .00117509   .0002939    .0046985
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_headache==1
Observed time interval: (stop_ae_headache[_n-1], stop_ae_headache]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,088  observations end on or before enter()
--------------------------------------------------------------------------
     10,101  observations remaining, representing
     10,101  subjects
        622  failures in single-failure-per-subject data
    261,013  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_headache==1
   Analysis time _t: (stop_ae_headache-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261013        622   .00238302   .0022029    .0025779

         Failure _d: fail_ae_headache==1
   Analysis time _t: (stop_ae_headache-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       256614        615    .0023966   .0022145    .0025937
no drug

         Failure _d: fail_ae_headache==1
   Analysis time _t: (stop_ae_headache-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1517          0           0          .           .
sotrovimab

         Failure _d: fail_ae_headache==1
   Analysis time _t: (stop_ae_headache-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1208          4   .00331126   .0012428    .0088225
paxlovid

         Failure _d: fail_ae_headache==1
   Analysis time _t: (stop_ae_headache-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1674          3   .00179211    .000578    .0055566
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_anaphylaxis==1
Observed time interval: (stop_ae_anaphylaxis[_n-1], stop_ae_anaphylaxis]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,192  observations end on or before enter()
--------------------------------------------------------------------------
      9,997  observations remaining, representing
      9,997  subjects
        623  failures in single-failure-per-subject data
    258,543  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_anaphylaxis==1
   Analysis time _t: (stop_ae_anaphylaxis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258543        623   .00240966   .0022277    .0026065

         Failure _d: fail_ae_anaphylaxis==1
   Analysis time _t: (stop_ae_anaphylaxis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       254176        613   .00241171   .0022282    .0026104
no drug

         Failure _d: fail_ae_anaphylaxis==1
   Analysis time _t: (stop_ae_anaphylaxis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1559          1   .00064144   .0000904    .0045536
sotrovimab

         Failure _d: fail_ae_anaphylaxis==1
   Analysis time _t: (stop_ae_anaphylaxis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1255          5   .00398406   .0016583    .0095718
paxlovid

         Failure _d: fail_ae_anaphylaxis==1
   Analysis time _t: (stop_ae_anaphylaxis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1553          4   .00257566   .0009667    .0068626
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drugreaction==1
Observed time interval: (stop_ae_drugreaction[_n-1], stop_ae_drugreaction]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     17,349  observations end on or before enter()
--------------------------------------------------------------------------
      6,840  observations remaining, representing
      6,840  subjects
        817  failures in single-failure-per-subject data
    173,106  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drugreaction==1
   Analysis time _t: (stop_ae_drugreaction-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       173106        817   .00471965   .0044069    .0050546

         Failure _d: fail_ae_drugreaction==1
   Analysis time _t: (stop_ae_drugreaction-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       169846        803   .00472781   .0044119    .0050664
no drug

         Failure _d: fail_ae_drugreaction==1
   Analysis time _t: (stop_ae_drugreaction-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1011          4   .00395648   .0014849    .0105417
sotrovimab

         Failure _d: fail_ae_drugreaction==1
   Analysis time _t: (stop_ae_drugreaction-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          947          7   .00739176   .0035239     .015505
paxlovid

         Failure _d: fail_ae_drugreaction==1
   Analysis time _t: (stop_ae_drugreaction-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1302          3   .00230415   .0007431    .0071442
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_ra==1
Observed time interval: (stop_ae_ra[_n-1], stop_ae_ra]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     13,520  observations end on or before enter()
--------------------------------------------------------------------------
     10,669  observations remaining, representing
     10,669  subjects
        581  failures in single-failure-per-subject data
    276,426  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_ra==1
   Analysis time _t: (stop_ae_ra-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       276426        581   .00210183   .0019377    .0022799

         Failure _d: fail_ae_ra==1
   Analysis time _t: (stop_ae_ra-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       272193        571   .00209778   .0019326    .0022771
no drug

         Failure _d: fail_ae_ra==1
   Analysis time _t: (stop_ae_ra-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1517          4   .00263678   .0009896    .0070255
sotrovimab

         Failure _d: fail_ae_ra==1
   Analysis time _t: (stop_ae_ra-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1204          3   .00249169   .0008036    .0077257
paxlovid

         Failure _d: fail_ae_ra==1
   Analysis time _t: (stop_ae_ra-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1512          3   .00198413   .0006399    .0061519
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_sle==1
Observed time interval: (stop_ae_sle[_n-1], stop_ae_sle]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     13,448  observations end on or before enter()
--------------------------------------------------------------------------
     10,741  observations remaining, representing
     10,741  subjects
        634  failures in single-failure-per-subject data
    277,385  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_sle==1
   Analysis time _t: (stop_ae_sle-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       277385        634   .00228563   .0021145    .0024707

         Failure _d: fail_ae_sle==1
   Analysis time _t: (stop_ae_sle-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       273015        625   .00228925   .0021166    .0024759
no drug

         Failure _d: fail_ae_sle==1
   Analysis time _t: (stop_ae_sle-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1439          2   .00138985   .0003476    .0055572
sotrovimab

         Failure _d: fail_ae_sle==1
   Analysis time _t: (stop_ae_sle-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1230          2   .00162602   .0004067    .0065015
paxlovid

         Failure _d: fail_ae_sle==1
   Analysis time _t: (stop_ae_sle-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1701          5   .00293945   .0012235    .0070621
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_psorasis==1
Observed time interval: (stop_ae_psorasis[_n-1], stop_ae_psorasis]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     13,490  observations end on or before enter()
--------------------------------------------------------------------------
     10,699  observations remaining, representing
     10,699  subjects
        571  failures in single-failure-per-subject data
    277,351  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_psorasis==1
   Analysis time _t: (stop_ae_psorasis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       277351        571   .00205876   .0018966    .0022347

         Failure _d: fail_ae_psorasis==1
   Analysis time _t: (stop_ae_psorasis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       273009        561   .00205488   .0018917    .0022322
no drug

         Failure _d: fail_ae_psorasis==1
   Analysis time _t: (stop_ae_psorasis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1481          3   .00202566   .0006533    .0062807
sotrovimab

         Failure _d: fail_ae_psorasis==1
   Analysis time _t: (stop_ae_psorasis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1257          2   .00159109   .0003979    .0063619
paxlovid

         Failure _d: fail_ae_psorasis==1
   Analysis time _t: (stop_ae_psorasis-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1604          5   .00311721   .0012975    .0074892
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_psa==1
Observed time interval: (stop_ae_psa[_n-1], stop_ae_psa]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     13,450  observations end on or before enter()
--------------------------------------------------------------------------
     10,739  observations remaining, representing
     10,739  subjects
        590  failures in single-failure-per-subject data
    277,778  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_psa==1
   Analysis time _t: (stop_ae_psa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       277778        590     .002124   .0019593    .0023025

         Failure _d: fail_ae_psa==1
   Analysis time _t: (stop_ae_psa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       273200        579   .00211933   .0019535    .0022992
no drug

         Failure _d: fail_ae_psa==1
   Analysis time _t: (stop_ae_psa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1504          5   .00332447   .0013837    .0079871
sotrovimab

         Failure _d: fail_ae_psa==1
   Analysis time _t: (stop_ae_psa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1232          4   .00324675   .0012186    .0086507
paxlovid

         Failure _d: fail_ae_psa==1
   Analysis time _t: (stop_ae_psa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1842          2   .00108578   .0002716    .0043414
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_axspa==1
Observed time interval: (stop_ae_axspa[_n-1], stop_ae_axspa]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     13,413  observations end on or before enter()
--------------------------------------------------------------------------
     10,776  observations remaining, representing
     10,776  subjects
        573  failures in single-failure-per-subject data
 279,777.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_axspa==1
   Analysis time _t: (stop_ae_axspa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    279777.75        573   .00204805    .001887    .0022228

         Failure _d: fail_ae_axspa==1
   Analysis time _t: (stop_ae_axspa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       275438        565   .00205128   .0018889    .0022276
no drug

         Failure _d: fail_ae_axspa==1
   Analysis time _t: (stop_ae_axspa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1385          2   .00144404   .0003612    .0057739
sotrovimab

         Failure _d: fail_ae_axspa==1
   Analysis time _t: (stop_ae_axspa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1273.75          2   .00157017   .0003927    .0062782
paxlovid

         Failure _d: fail_ae_axspa==1
   Analysis time _t: (stop_ae_axspa-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1681          4   .00237954   .0008931    .0063401
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_ibd==1
Observed time interval: (stop_ae_ibd[_n-1], stop_ae_ibd]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     13,445  observations end on or before enter()
--------------------------------------------------------------------------
     10,744  observations remaining, representing
     10,744  subjects
        552  failures in single-failure-per-subject data
 278,928.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_ibd==1
   Analysis time _t: (stop_ae_ibd-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    278928.25        552     .001979   .0018206    .0021512

         Failure _d: fail_ae_ibd==1
   Analysis time _t: (stop_ae_ibd-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       274612        542   .00197369   .0018143     .002147
no drug

         Failure _d: fail_ae_ibd==1
   Analysis time _t: (stop_ae_ibd-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       1472.5          3   .00203735   .0006571    .0063169
sotrovimab

         Failure _d: fail_ae_ibd==1
   Analysis time _t: (stop_ae_ibd-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1219.75          6   .00491904   .0022099    .0109492
paxlovid

         Failure _d: fail_ae_ibd==1
   Analysis time _t: (stop_ae_ibd-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1624          1   .00061576   .0000867    .0043713
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_diverticulitis_serious==1
Observed time interval: (stop_ae_diverticulitis_serious[_n-1], stop_ae_diverticulitis_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,372  observations end on or before enter()
--------------------------------------------------------------------------
     13,817  observations remaining, representing
     13,817  subjects
        318  failures in single-failure-per-subject data
    362,354  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       362354        318   .00087759   .0007863    .0009796

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       357070        313   .00087658   .0007847    .0009793
no drug

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1636          0           0          .           .
sotrovimab

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1502          2   .00133156    .000333    .0053242
paxlovid

         Failure _d: fail_ae_diverticulitis_serious==1
   Analysis time _t: (stop_ae_diverticulitis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2146          3   .00139795   .0004509    .0043344
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_diarrhoea_serious==1
Observed time interval: (stop_ae_diarrhoea_serious[_n-1], stop_ae_diarrhoea_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     12,473  observations end on or before enter()
--------------------------------------------------------------------------
     11,716  observations remaining, representing
     11,716  subjects
        578  failures in single-failure-per-subject data
    303,823  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       303823        578   .00190242   .0017535     .002064

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       299487        569   .00189992     .00175    .0020626
no drug

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1369          5    .0036523   .0015202    .0087748
sotrovimab

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1240          1   .00080645   .0001136    .0057251
paxlovid

         Failure _d: fail_ae_diarrhoea_serious==1
   Analysis time _t: (stop_ae_diarrhoea_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1727          3   .00173712   .0005603     .005386
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_taste_serious==1
Observed time interval: (stop_ae_taste_serious[_n-1], stop_ae_taste_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,320  observations end on or before enter()
--------------------------------------------------------------------------
     13,869  observations remaining, representing
     13,869  subjects
        346  failures in single-failure-per-subject data
 362,741.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    362741.25        346   .00095385   .0008585    .0010598

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       357393        338   .00094574   .0008501    .0010521
no drug

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1732.75          5   .00288559   .0012011    .0069327
sotrovimab

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1539          1   .00064977   .0000915    .0046128
paxlovid

         Failure _d: fail_ae_taste_serious==1
   Analysis time _t: (stop_ae_taste_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       2076.5          2   .00096316   .0002409    .0038511
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_rash_serious==1
Observed time interval: (stop_ae_rash_serious[_n-1], stop_ae_rash_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,356  observations end on or before enter()
--------------------------------------------------------------------------
     13,833  observations remaining, representing
     13,833  subjects
        308  failures in single-failure-per-subject data
    362,719  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       362719        308   .00084914   .0007594    .0009495

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       357334        306   .00085634   .0007656    .0009579
no drug

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1677          1    .0005963    .000084    .0042332
sotrovimab

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1554          0           0          .           .
paxlovid

         Failure _d: fail_ae_rash_serious==1
   Analysis time _t: (stop_ae_rash_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2154          1   .00046425   .0000654    .0032958
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_contactderm_serious==1
Observed time interval: (stop_ae_contactderm_serious[_n-1], stop_ae_contactderm_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,345  observations end on or before enter()
--------------------------------------------------------------------------
     13,844  observations remaining, representing
     13,844  subjects
        316  failures in single-failure-per-subject data
 362,642.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    362642.75        316   .00087138   .0007804     .000973

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       357583        313   .00087532   .0007835    .0009779
no drug

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1540          2    .0012987   .0003248    .0051928
sotrovimab

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1471.75          1   .00067946   .0000957    .0048236
paxlovid

         Failure _d: fail_ae_contactderm_serious==1
   Analysis time _t: (stop_ae_contactderm_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2048          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_dizziness_serious==1
Observed time interval: (stop_ae_dizziness_serious[_n-1], stop_ae_dizziness_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,293  observations end on or before enter()
--------------------------------------------------------------------------
     13,896  observations remaining, representing
     13,896  subjects
        304  failures in single-failure-per-subject data
    364,687  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       364687        304   .00083359    .000745    .0009328

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       359381        301   .00083755   .0007481    .0009377
no drug

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1633          0           0          .           .
sotrovimab

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1570          1   .00063694   .0000897    .0045217
paxlovid

         Failure _d: fail_ae_dizziness_serious==1
   Analysis time _t: (stop_ae_dizziness_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2103          2   .00095102   .0002378    .0038026
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_nausea_vomit_serious==1
Observed time interval: (stop_ae_nausea_vomit_serious[_n-1], stop_ae_nausea_vomit_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,378  observations end on or before enter()
--------------------------------------------------------------------------
     13,811  observations remaining, representing
     13,811  subjects
        307  failures in single-failure-per-subject data
    361,890  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_nausea_vomit_serious==1
   Analysis time _t: (stop_ae_nausea_vomit_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       361890        307   .00084832   .0007585    .0009487

         Failure _d: fail_ae_nausea_vomit_serious==1
   Analysis time _t: (stop_ae_nausea_vomit_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       356800        303   .00084922   .0007588    .0009504
no drug

         Failure _d: fail_ae_nausea_vomit_serious==1
   Analysis time _t: (stop_ae_nausea_vomit_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1691          1   .00059137   .0000833    .0041981
sotrovimab

         Failure _d: fail_ae_nausea_vomit_serious==1
   Analysis time _t: (stop_ae_nausea_vomit_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1523          1    .0006566   .0000925    .0046612
paxlovid

         Failure _d: fail_ae_nausea_vomit_serious==1
   Analysis time _t: (stop_ae_nausea_vomit_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1876          2    .0010661   .0002666    .0042627
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_headache_serious==1
Observed time interval: (stop_ae_headache_serious[_n-1], stop_ae_headache_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,344  observations end on or before enter()
--------------------------------------------------------------------------
     13,845  observations remaining, representing
     13,845  subjects
        296  failures in single-failure-per-subject data
    363,375  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_headache_serious==1
   Analysis time _t: (stop_ae_headache_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       363375        296   .00081459   .0007269    .0009129

         Failure _d: fail_ae_headache_serious==1
   Analysis time _t: (stop_ae_headache_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       357993        292   .00081566   .0007273    .0009148
no drug

         Failure _d: fail_ae_headache_serious==1
   Analysis time _t: (stop_ae_headache_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1691          0           0          .           .
sotrovimab

         Failure _d: fail_ae_headache_serious==1
   Analysis time _t: (stop_ae_headache_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1654          2   .00120919   .0003024    .0048349
paxlovid

         Failure _d: fail_ae_headache_serious==1
   Analysis time _t: (stop_ae_headache_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2037          2   .00098184   .0002456    .0039258
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_anaphylaxis_serious==1
Observed time interval: (stop_ae_anaphylaxis_serious[_n-1], stop_ae_anaphylaxis_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,358  observations end on or before enter()
--------------------------------------------------------------------------
     13,831  observations remaining, representing
     13,831  subjects
        294  failures in single-failure-per-subject data
    362,512  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_anaphylaxis_serious==1
   Analysis time _t: (stop_ae_anaphylaxis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       362512        294   .00081101   .0007234    .0009092

         Failure _d: fail_ae_anaphylaxis_serious==1
   Analysis time _t: (stop_ae_anaphylaxis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       357457        289   .00080849   .0007204    .0009073
no drug

         Failure _d: fail_ae_anaphylaxis_serious==1
   Analysis time _t: (stop_ae_anaphylaxis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1749          0           0          .           .
sotrovimab

         Failure _d: fail_ae_anaphylaxis_serious==1
   Analysis time _t: (stop_ae_anaphylaxis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1476          4   .00271003   .0010171    .0072206
paxlovid

         Failure _d: fail_ae_anaphylaxis_serious==1
   Analysis time _t: (stop_ae_anaphylaxis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1830          1   .00054645    .000077    .0038793
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drugreaction_serious==1
Observed time interval: (stop_ae_drugreaction_serious[_n-1], stop_ae_drugreaction_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     12,442  observations end on or before enter()
--------------------------------------------------------------------------
     11,747  observations remaining, representing
     11,747  subjects
        517  failures in single-failure-per-subject data
    305,948  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drugreaction_serious==1
   Analysis time _t: (stop_ae_drugreaction_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       305948        517   .00168983   .0015503     .001842

         Failure _d: fail_ae_drugreaction_serious==1
   Analysis time _t: (stop_ae_drugreaction_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       301111        514   .00170701   .0015656    .0018612
no drug

         Failure _d: fail_ae_drugreaction_serious==1
   Analysis time _t: (stop_ae_drugreaction_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1546          0           0          .           .
sotrovimab

         Failure _d: fail_ae_drugreaction_serious==1
   Analysis time _t: (stop_ae_drugreaction_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1326          2    .0015083   .0003772    .0060308
paxlovid

         Failure _d: fail_ae_drugreaction_serious==1
   Analysis time _t: (stop_ae_drugreaction_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1965          1   .00050891   .0000717    .0036128
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_ra_serious==1
Observed time interval: (stop_ae_ra_serious[_n-1], stop_ae_ra_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,104  observations end on or before enter()
--------------------------------------------------------------------------
     14,085  observations remaining, representing
     14,085  subjects
        270  failures in single-failure-per-subject data
    369,787  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_ra_serious==1
   Analysis time _t: (stop_ae_ra_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       369787        270   .00073015   .0006481    .0008226

         Failure _d: fail_ae_ra_serious==1
   Analysis time _t: (stop_ae_ra_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       364443        265   .00072714   .0006447    .0008202
no drug

         Failure _d: fail_ae_ra_serious==1
   Analysis time _t: (stop_ae_ra_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1779          2   .00112423   .0002812    .0044952
sotrovimab

         Failure _d: fail_ae_ra_serious==1
   Analysis time _t: (stop_ae_ra_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1487          1   .00067249   .0000947    .0047741
paxlovid

         Failure _d: fail_ae_ra_serious==1
   Analysis time _t: (stop_ae_ra_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2078          2   .00096246   .0002407    .0038484
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_sle_serious==1
Observed time interval: (stop_ae_sle_serious[_n-1], stop_ae_sle_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,038  observations end on or before enter()
--------------------------------------------------------------------------
     14,151  observations remaining, representing
     14,151  subjects
        305  failures in single-failure-per-subject data
    370,445  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_sle_serious==1
   Analysis time _t: (stop_ae_sle_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       370445        305   .00082333   .0007359    .0009211

         Failure _d: fail_ae_sle_serious==1
   Analysis time _t: (stop_ae_sle_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       364988        298   .00081647   .0007288    .0009146
no drug

         Failure _d: fail_ae_sle_serious==1
   Analysis time _t: (stop_ae_sle_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1754          3   .00171038   .0005516    .0053031
sotrovimab

         Failure _d: fail_ae_sle_serious==1
   Analysis time _t: (stop_ae_sle_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1666          1   .00060024   .0000846    .0042611
paxlovid

         Failure _d: fail_ae_sle_serious==1
   Analysis time _t: (stop_ae_sle_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2037          3   .00147275    .000475    .0045664
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_psorasis_serious==1
Observed time interval: (stop_ae_psorasis_serious[_n-1], stop_ae_psorasis_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,048  observations end on or before enter()
--------------------------------------------------------------------------
     14,141  observations remaining, representing
     14,141  subjects
        285  failures in single-failure-per-subject data
    370,769  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_psorasis_serious==1
   Analysis time _t: (stop_ae_psorasis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       370769        285   .00076867   .0006844    .0008633

         Failure _d: fail_ae_psorasis_serious==1
   Analysis time _t: (stop_ae_psorasis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       365734        277   .00075738   .0006732     .000852
no drug

         Failure _d: fail_ae_psorasis_serious==1
   Analysis time _t: (stop_ae_psorasis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1582          1   .00063211    .000089    .0044874
sotrovimab

         Failure _d: fail_ae_psorasis_serious==1
   Analysis time _t: (stop_ae_psorasis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1520          3   .00197368   .0006366    .0061195
paxlovid

         Failure _d: fail_ae_psorasis_serious==1
   Analysis time _t: (stop_ae_psorasis_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1933          4   .00206932   .0007767    .0055135
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_psa_serious==1
Observed time interval: (stop_ae_psa_serious[_n-1], stop_ae_psa_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,086  observations end on or before enter()
--------------------------------------------------------------------------
     14,103  observations remaining, representing
     14,103  subjects
        280  failures in single-failure-per-subject data
    369,906  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_psa_serious==1
   Analysis time _t: (stop_ae_psa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       369906        280   .00075695   .0006733     .000851

         Failure _d: fail_ae_psa_serious==1
   Analysis time _t: (stop_ae_psa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       364524        273   .00074892   .0006651    .0008432
no drug

         Failure _d: fail_ae_psa_serious==1
   Analysis time _t: (stop_ae_psa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1747          3   .00171723   .0005538    .0053244
sotrovimab

         Failure _d: fail_ae_psa_serious==1
   Analysis time _t: (stop_ae_psa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1574          2   .00127065   .0003178    .0050806
paxlovid

         Failure _d: fail_ae_psa_serious==1
   Analysis time _t: (stop_ae_psa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2061          2    .0009704   .0002427    .0038801
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_axspa_serious==1
Observed time interval: (stop_ae_axspa_serious[_n-1], stop_ae_axspa_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,042  observations end on or before enter()
--------------------------------------------------------------------------
     14,147  observations remaining, representing
     14,147  subjects
        285  failures in single-failure-per-subject data
    370,847  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_axspa_serious==1
   Analysis time _t: (stop_ae_axspa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       370847        285   .00076851   .0006843    .0008631

         Failure _d: fail_ae_axspa_serious==1
   Analysis time _t: (stop_ae_axspa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       365622        282   .00077129   .0006863    .0008668
no drug

         Failure _d: fail_ae_axspa_serious==1
   Analysis time _t: (stop_ae_axspa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1689          1   .00059207   .0000834    .0042031
sotrovimab

         Failure _d: fail_ae_axspa_serious==1
   Analysis time _t: (stop_ae_axspa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1522          1   .00065703   .0000926    .0046643
paxlovid

         Failure _d: fail_ae_axspa_serious==1
   Analysis time _t: (stop_ae_axspa_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2014          1   .00049652   .0000699    .0035249
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_ibd_serious==1
Observed time interval: (stop_ae_ibd_serious[_n-1], stop_ae_ibd_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     10,037  observations end on or before enter()
--------------------------------------------------------------------------
     14,152  observations remaining, representing
     14,152  subjects
        263  failures in single-failure-per-subject data
  371,402.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_ibd_serious==1
   Analysis time _t: (stop_ae_ibd_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     371402.5        263   .00070813   .0006275    .0007991

         Failure _d: fail_ae_ibd_serious==1
   Analysis time _t: (stop_ae_ibd_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       366219        257   .00070177    .000621     .000793
no drug

         Failure _d: fail_ae_ibd_serious==1
   Analysis time _t: (stop_ae_ibd_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1689.75          2   .00118361    .000296    .0047326
sotrovimab

         Failure _d: fail_ae_ibd_serious==1
   Analysis time _t: (stop_ae_ibd_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1462.75          3   .00205093   .0006615    .0063591
paxlovid

         Failure _d: fail_ae_ibd_serious==1
   Analysis time _t: (stop_ae_ibd_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2031          1   .00049237   .0000694    .0034954
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     22,951  observations end on or before enter()
--------------------------------------------------------------------------
      1,238  observations remaining, representing
      1,238  subjects
        748  failures in single-failure-per-subject data
   22,141.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      22141.5        748   .03378272   .0314464    .0362926

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        21563        729   .03380791   .0314407    .0363533
no drug

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       159.75         10   .06259781    .033681     .116341
sotrovimab

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       160.75          3   .01866252   .0060191    .0578644
paxlovid

         Failure _d: fail_ae_all==1
   Analysis time _t: (stop_ae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          258          6   .02325581   .0104479    .0517646
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all_serious==1
Observed time interval: (stop_ae_all_serious[_n-1], stop_ae_all_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     21,246  observations end on or before enter()
--------------------------------------------------------------------------
      2,943  observations remaining, representing
      2,943  subjects
        868  failures in single-failure-per-subject data
  66,929.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     66929.75        868   .01296882   .0121341    .0138609

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        65561        848   .01293452   .0120926     .013835
no drug

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       484.75          8   .01650335   .0082533    .0330003
sotrovimab

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          402          4   .00995025   .0037345    .0265115
paxlovid

         Failure _d: fail_ae_all_serious==1
   Analysis time _t: (stop_ae_all_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          482          8   .01659751   .0083004    .0331885
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_all==1
Observed time interval: (stop_ae_spc_all[_n-1], stop_ae_spc_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     21,902  observations end on or before enter()
--------------------------------------------------------------------------
      2,287  observations remaining, representing
      2,287  subjects
        836  failures in single-failure-per-subject data
   49,614.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      49614.5        836   .01684991   .0157456    .0180317

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        48480        818   .01687294   .0157554    .0180698
no drug

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       446.75         11   .02462227   .0136358    .0444606
sotrovimab

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       296.75          2   .00673968   .0016856    .0269482
paxlovid

         Failure _d: fail_ae_spc_all==1
   Analysis time _t: (stop_ae_spc_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          391          5   .01278772   .0053226    .0307229
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_spc_serious==1
Observed time interval: (stop_ae_spc_serious[_n-1], stop_ae_spc_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     19,143  observations end on or before enter()
--------------------------------------------------------------------------
      5,046  observations remaining, representing
      5,046  subjects
        905  failures in single-failure-per-subject data
 123,483.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    123483.75        905    .0073289   .0068666    .0078223

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       121177        889   .00733638   .0068696    .0078348
no drug

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       753.75          7    .0092869   .0044274    .0194803
sotrovimab

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          610          1   .00163934   .0002309    .0116378
paxlovid

         Failure _d: fail_ae_spc_serious==1
   Analysis time _t: (stop_ae_spc_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          943          8   .00848356   .0042426    .0169638
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_all==1
Observed time interval: (stop_ae_drug_all[_n-1], stop_ae_drug_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     19,091  observations end on or before enter()
--------------------------------------------------------------------------
      5,098  observations remaining, representing
      5,098  subjects
        854  failures in single-failure-per-subject data
    126,018  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       126018        854   .00677681   .0063372    .0072469

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       123268        836   .00678197   .0063375    .0072576
no drug

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          953          4   .00419727   .0015753    .0111832
sotrovimab

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          765          7   .00915033   .0043623    .0191938
paxlovid

         Failure _d: fail_ae_drug_all==1
   Analysis time _t: (stop_ae_drug_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1032          7   .00678295   .0032337    .0142279
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_drug_serious==1
Observed time interval: (stop_ae_drug_serious[_n-1], stop_ae_drug_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     14,129  observations end on or before enter()
--------------------------------------------------------------------------
     10,060  observations remaining, representing
     10,060  subjects
        627  failures in single-failure-per-subject data
    260,134  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       260134        627    .0024103   .0022288    .0026065

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       255958        620   .00242227   .0022389    .0026206
no drug

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1430          0           0          .           .
sotrovimab

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1200          5   .00416667   .0017343    .0100105
paxlovid

         Failure _d: fail_ae_drug_serious==1
   Analysis time _t: (stop_ae_drug_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1546          2   .00129366   .0003235    .0051726
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_all==1
Observed time interval: (stop_ae_imae_all[_n-1], stop_ae_imae_all]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     20,989  observations end on or before enter()
--------------------------------------------------------------------------
      3,200  observations remaining, representing
      3,200  subjects
        842  failures in single-failure-per-subject data
  74,320.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     74320.25        842   .01132935   .0105894     .012121

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        72747        827   .01136817   .0106192      .01217
no drug

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        675.5          8   .01184308   .0059227    .0236815
sotrovimab

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       503.75          3   .00595533   .0019207    .0184649
paxlovid

         Failure _d: fail_ae_imae_all==1
   Analysis time _t: (stop_ae_imae_all-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          394          4   .01015228   .0038103    .0270498
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_imae_serious==1
Observed time interval: (stop_ae_imae_serious[_n-1], stop_ae_imae_serious]
     Enter on or after: time start_date_delay
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date_delay
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     16,722  observations end on or before enter()
--------------------------------------------------------------------------
      7,467  observations remaining, representing
      7,467  subjects
        792  failures in single-failure-per-subject data
 189,459.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    189459.75        792   .00418031   .0038991    .0044818

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       186574        774   .00414849   .0038663    .0044513
no drug

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1040.75          8   .00768676   .0038441    .0153705
sotrovimab

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          910          4    .0043956   .0016497    .0117117
paxlovid

         Failure _d: fail_ae_imae_serious==1
   Analysis time _t: (stop_ae_imae_serious-origin)
             Origin: time start_date_delay
  Enter on or after: time start_date_delay
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |          935          6   .00641711    .002883    .0142837
molnupavir

. postclose `coxoutput_rates_sens_6'

. 
. *** Redact and save 
. use "$projectdir/output/tables/cox_model_summary_sens_6", clear

. save "$projectdir/output/tables/cox_model_summary_sens_6", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/cox_model_summary_sens_6.dta saved

. export delimited using "$projectdir/output/tables/cox_model_summary_sens_6.csv", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/
> cox_model_summary_sens_6.csv saved

. 
. use "$projectdir/output/tables/cox_model_rates_sens_6", clear

. order failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/cox_model_rates_sens_6", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/cox_model_rates_sens_6.dta saved

. export delimited using "$projectdir/output/tables/cox_model_rates_sens_6.csv", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/
> cox_model_rates_sens_6.csv saved

. 
. use "$projectdir/output/tables/cox_model_rates_sens_6", clear

. foreach var of varlist *events *ptime  {
  2. gen `var'_midpoint = (ceil(`var'/6)*6) - (floor(6/2) * (`var'!=0))
  3. }

. foreach var in all control sot pax mol {
  2. gen `var'_rate_midpoint = (`var'_events_midpoint/`var'_ptime_midpoint)*1000
  3. gen `var'_lci_midpoint = (invpoisson(`var'_events_midpoint,.975)/`var'_ptime_midpoint)*1000
  4. gen `var'_uci_midpoint = (invpoisson(`var'_events_midpoint,.025)/`var'_ptime_midpoint)*1000
  5. }  

. keep failure *midpoint

. order   failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/cox_model_rates_round_sens_6", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/cox_model_rates_round_sens_6.dta saved

. export delimited using "$projectdir/output/tables/cox_model_rates_round_sens_6.csv", replace  
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/
> cox_model_rates_round_sens_6.csv saved

.         
.         
. 
end of do-file

. do "C:\Users\k1635179\AppData\Local\Te
> mp\STD43dc_000000.tmp"

. use "$projectdir/output/data/sensitivi
> ty_analysis.dta", clear

. tab pre_drug_test drug

                      |    drug
        pre_drug_test |   control |     
> Total
----------------------+-----------+-----
> -----
               0 days |         0 |     
>    57 
               1 days |         0 |     
>    41 
               2 days |         0 |     
>    49 
               3 days |         0 |     
>    48 
               4 days |         0 |     
>    34 
               5 days |         0 |     
>    36 
             6-7 days |         0 |     
>    46 
   >7 days & <21 days |         0 |     
>   652 
treatment >21 day or  |    26,554 |    5
> 6,162 
no test date / no tre |         0 |     
> 3,360 
----------------------+-----------+-----
> -----
                Total |    26,554 |    6
> 0,485 


                      |    drug
        pre_drug_test | sotrovima |     
> Total
----------------------+-----------+-----
> -----
               0 days |        15 |     
>    57 
               1 days |        11 |     
>    41 
               2 days |        23 |     
>    49 
               3 days |        14 |     
>    48 
               4 days |        12 |     
>    34 
               5 days |        11 |     
>    36 
             6-7 days |        19 |     
>    46 
   >7 days & <21 days |       213 |     
>   652 
treatment >21 day or  |     9,899 |    5
> 6,162 
no test date / no tre |     1,147 |     
> 3,360 
----------------------+-----------+-----
> -----
                Total |    11,364 |    6
> 0,485 


                      |    drug
        pre_drug_test |  paxlovid |     
> Total
----------------------+-----------+-----
> -----
               0 days |        16 |     
>    57 
               1 days |        13 |     
>    41 
               2 days |        14 |     
>    49 
               3 days |        17 |     
>    48 
               4 days |         9 |     
>    34 
               5 days |        12 |     
>    36 
             6-7 days |        11 |     
>    46 
   >7 days & <21 days |       217 |     
>   652 
treatment >21 day or  |     9,902 |    5
> 6,162 
no test date / no tre |     1,107 |     
> 3,360 
----------------------+-----------+-----
> -----
                Total |    11,318 |    6
> 0,485 


                      |    drug
        pre_drug_test | molnupira |     
> Total
----------------------+-----------+-----
> -----
               0 days |        26 |     
>    57 
               1 days |        17 |     
>    41 
               2 days |        12 |     
>    49 
               3 days |        17 |     
>    48 
               4 days |        13 |     
>    34 
               5 days |        13 |     
>    36 
             6-7 days |        16 |     
>    46 
   >7 days & <21 days |       222 |     
>   652 
treatment >21 day or  |     9,807 |    5
> 6,162 
no test date / no tre |     1,106 |     
> 3,360 
----------------------+-----------+-----
> -----
                Total |    11,249 |    6
> 0,485 

. drop if  covid_test_5d!=1 & drug >0
(33,666 observations deleted)

. tab pre_drug_test drug

                      |    drug
        pre_drug_test |   control |     
> Total
----------------------+-----------+-----
> -----
               0 days |         0 |     
>    57 
               1 days |         0 |     
>    41 
               2 days |         0 |     
>    49 
               3 days |         0 |     
>    48 
               4 days |         0 |     
>    34 
               5 days |         0 |     
>    36 
treatment >21 day or  |    26,554 |    2
> 6,554 
----------------------+-----------+-----
> -----
                Total |    26,554 |    2
> 6,819 


                      |    drug
        pre_drug_test | sotrovima |     
> Total
----------------------+-----------+-----
> -----
               0 days |        15 |     
>    57 
               1 days |        11 |     
>    41 
               2 days |        23 |     
>    49 
               3 days |        14 |     
>    48 
               4 days |        12 |     
>    34 
               5 days |        11 |     
>    36 
treatment >21 day or  |         0 |    2
> 6,554 
----------------------+-----------+-----
> -----
                Total |        86 |    2
> 6,819 


                      |    drug
        pre_drug_test |  paxlovid |     
> Total
----------------------+-----------+-----
> -----
               0 days |        16 |     
>    57 
               1 days |        13 |     
>    41 
               2 days |        14 |     
>    49 
               3 days |        17 |     
>    48 
               4 days |         9 |     
>    34 
               5 days |        12 |     
>    36 
treatment >21 day or  |         0 |    2
> 6,554 
----------------------+-----------+-----
> -----
                Total |        81 |    2
> 6,819 


                      |    drug
        pre_drug_test | molnupira |     
> Total
----------------------+-----------+-----
> -----
               0 days |        26 |     
>    57 
               1 days |        17 |     
>    41 
               2 days |        12 |     
>    49 
               3 days |        17 |     
>    48 
               4 days |        13 |     
>    34 
               5 days |        13 |     
>    36 
treatment >21 day or  |         0 |    2
> 6,554 
----------------------+-----------+-----
> -----
                Total |        98 |    2
> 6,819 

. tab drug paxlovid_contraindicated

             | paxlovid_c
             | ontraindic
             |    ated
        drug |         0 |     Total
-------------+-----------+----------
     control |    11,086 |    26,554 
  sotrovimab |        49 |        86 
    paxlovid |        40 |        81 
molnupiravir |        39 |        98 
-------------+-----------+----------
       Total |    11,214 |    26,819 


             | paxlovid_c
             | ontraindic
             |    ated
        drug |         1 |     Total
-------------+-----------+----------
     control |    15,468 |    26,554 
  sotrovimab |        37 |        86 
    paxlovid |        41 |        81 
molnupiravir |        59 |        98 
-------------+-----------+----------
       Total |    15,605 |    26,819 

. tab drug high_risk_cohort_codelist

             | high_risk_
             | cohort_cod
             |   elist
        drug |         0 |     Total
-------------+-----------+----------
     control |         0 |    26,554 
  sotrovimab |         2 |        86 
    paxlovid |         3 |        81 
molnupiravir |         1 |        98 
-------------+-----------+----------
       Total |         6 |    26,819 


             | high_risk_
             | cohort_cod
             |   elist
        drug |         1 |     Total
-------------+-----------+----------
     control |    26,554 |    26,554 
  sotrovimab |        84 |        86 
    paxlovid |        78 |        81 
molnupiravir |        97 |        98 
-------------+-----------+----------
       Total |    26,813 |    26,819 

. 
end of do-file

. do "C:\Users\k1635179\AppData\Local\Te
> mp\STD43dc_000000.tmp"

. ** Start day for treatment group is da
> te treated & start date for control gr
> oup is date test + 2 days
. count if start_date!=covid_test_positi
> ve_date & drug==0
  26,512

. count if start_date!=date_treated & dr
> ug>0
  0

. tab median_delay_all

median_dela |
      y_all |      Freq.     Percent    
>     Cum.
------------+---------------------------
> --------
          2 |     26,819      100.00    
>   100.00
------------+---------------------------
> --------
      Total |     26,819      100.00

. gen start_date_delay = start_date + me
> dian_delay_all if drug==0
(2,889 missing values generated)

. replace start_date_delay = start_date 
> if drug>0
(265 real changes made)

. 
end of do-file

. stset stop_ae_all if high_risk_cohort_codelist==1, id(patient_id) origin(t
> ime start_date) enter(time start_date) failure(fail_ae_all==1) 

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date
      Keep observations 
                if exp: high_risk_cohort_codelist==1

--------------------------------------------------------------------------
     26,819  total observations
          6  ignored at outset because of if exp
      2,624  ignored because never entered
     22,828  observations end on or before enter()
--------------------------------------------------------------------------
      1,361  observations remaining, representing
      1,361  subjects
        867  failures in single-failure-per-subject data
     24,709  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start
> _date) failure(fail_ae_all==1)

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
     22,834  observations end on or before enter()
--------------------------------------------------------------------------
      1,361  observations remaining, representing
      1,361  subjects
        867  failures in single-failure-per-subject data
     24,709  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

. exit, clear
