------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/preceed_rate.log
  log type:  text
 opened on:   1 Aug 2023, 14:23:52

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir\analysis/analysis/ado"
  [8]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for comparative rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prior
. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0 & pre_ra_icd_new==0  
(24,281 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snomed_new==0 & pre_ra_icd_new==0
(24,363 missing values generated)

. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 & pre_ra_icd_new==0  
(24,264 missing values generated)

. gen new_pre_ankspon_ctv = pre_ankylosing_spondylitis_ctv if pre_ankspon_ctv_new==0 
(24,123 missing values generated)

. gen new_pre_ankspon_ae = pre_ankylosing_spondylitis_ae if pre_ankspon_ctv_new==0
(24,110 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_snomed_new==0 
(24,073 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new==0
(24,083 missing values generated)

. gen new_pre_psa_ae = pre_psoriatic_arthritis_ae if pre_psa_snomed_new==0 
(24,063 missing values generated)

. gen new_pre_psa_snomed = pre_psoriatic_arthritis_snomed if pre_psa_snomed_new==0                                                                                        
(24,076 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 & pre_sle_icd_new==0  
(24,327 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 & pre_sle_icd_new==0
(24,297 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 & pre_sle_icd_new==0  
(24,348 missing values generated)

. 
. *** combined ae from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_diverticulitis_snomed pre_diverticulitis_ae)      
(19,213 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_snomed)
(23,846 missing values generated)

. egen pre_taste = rmin(pre_taste_snomed pre_taste_icd_prim)
(21,391 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_snomed     pre_anaphlaxis_ae)
(19,312 missing values generated)

. egen pre_rash = rmin(pre_rash_snomed)
(23,831 missing values generated)

. egen pre_drug = rmin(pre_drugreact_ae)
(23,834 missing values generated)

. egen pre_allergic = rmin(pre_allergic_ae)
(23,815 missing values generated)

. egen pre_ra = rmin(new_pre_ra_ae new_pre_ra_snomed new_pre_ra_icd)
(20,570 missing values generated)

. egen pre_sle = rmin(new_pre_sle_ctv new_pre_sle_icd new_pre_sle_ae)
(20,661 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_snomed new_pre_psoriasis_ae)
(21,919 missing values generated)

. egen pre_psa = rmin(new_pre_psa_ae new_pre_psa_snomed)
(21,922 missing values generated)

. egen pre_ankspon = rmin(new_pre_ankspon_ctv     new_pre_ankspon_ae)
(22,026 missing values generated)

. egen pre_ibd = rmin(new_ae_ibd_snomed new_ae_ibd_ae)
(11,255 missing values generated)

. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste) 
(14,005 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_rash pre_drug pre_allergic)
(14,100 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_ankspon pre_ibd)       
(3,810 missing values generated)

. egen pre_ae_all = rmin($pre_spc_all $pre_drug_all $pre_imae_all)
(26,469 missing values generated)

. 
. global pre_ae_group                     pre_spc_all                                     ///
>                                                         pre_drug_all                                    ///             
>                                                         pre_imae_all                                    ///                             
>                                                         pre_ae_all

. global pre_ae_disease           pre_diverticulitis                              ///
>                                                         pre_diarrhoea                                   ///
>                                                         pre_taste                                               ///
>                                                         pre_anaphylaxis                                 ///
>                                                         pre_rash                                                ///
>                                                         pre_drug                                                ///
>                                                         pre_allergic                                    ///
>                                                         pre_ra                                                  ///
>                                                         pre_sle                                                 ///
>                                                         pre_psorasis                                    ///
>                                                         pre_psa                                                 ///
>                                                         pre_ankspon                                     ///
>                                                         pre_ibd                 

. 
. *gen start date for comparator rate
. gen start_comparator = start_date-1460

. gen start_comparator_28 = start_date - 1431

. *remove if occurred outside of window, gen failure and stop date: 
. foreach x in $pre_ae_group $pre_ae_disease {
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparator_28) & `x'!=.  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparator_28) & `x'!=.  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8.                 gen stop_`x'=`x' if fail_`x'==1
  9.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
 10.                 tab drug fail_`x' if stop_`x'!=.
 11.                 format %td stop_`x'
 12. }
pre_spc_all
  12,464
  12,277
  170
(14,005 missing values generated)

             |   fail_pre_spc_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    11,720     13,119 |    24,839 
  sotrovimab |       227        309 |       536 
    paxlovid |       266        278 |       544 
molnupiravir |       251        299 |       550 
-------------+----------------------+----------
       Total |    12,464     14,005 |    26,469 
(14,005 missing values generated)
(14,005 real changes made)

             | fail_pre_s
             |   pc_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    11,720 |    11,720 
  sotrovimab |       227 |       227 
    paxlovid |       266 |       266 
molnupiravir |       251 |       251 
-------------+-----------+----------
       Total |    12,464 |    12,464 
pre_drug_all
  12,369
  12,249
  111
(14,100 missing values generated)

             |   fail_pre_drug_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    11,588     13,251 |    24,839 
  sotrovimab |       253        283 |       536 
    paxlovid |       251        293 |       544 
molnupiravir |       277        273 |       550 
-------------+----------------------+----------
       Total |    12,369     14,100 |    26,469 
(14,100 missing values generated)
(14,100 real changes made)

             | fail_pre_d
             |  rug_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    11,588 |    11,588 
  sotrovimab |       253 |       253 
    paxlovid |       251 |       251 
molnupiravir |       277 |       277 
-------------+-----------+----------
       Total |    12,369 |    12,369 
pre_imae_all
  22,659
  22,429
  218
(3,810 missing values generated)

             |   fail_pre_imae_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    21,281      3,558 |    24,839 
  sotrovimab |       444         92 |       536 
    paxlovid |       462         82 |       544 
molnupiravir |       472         78 |       550 
-------------+----------------------+----------
       Total |    22,659      3,810 |    26,469 
(3,810 missing values generated)
(3,810 real changes made)

             | fail_pre_i
             |  mae_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    21,281 |    21,281 
  sotrovimab |       444 |       444 
    paxlovid |       462 |       462 
molnupiravir |       472 |       472 
-------------+-----------+----------
       Total |    22,659 |    22,659 
pre_ae_all
  0
  0
  0
(26,469 missing values generated)

             | fail_pre_a
             |   e_all
        drug |         . |     Total
-------------+-----------+----------
     control |    24,839 |    24,839 
  sotrovimab |       536 |       536 
    paxlovid |       544 |       544 
molnupiravir |       550 |       550 
-------------+-----------+----------
       Total |    26,469 |    26,469 
(26,469 missing values generated)
(26,469 real changes made)
no observations
pre_diverticulitis
  7,256
  7,178
  71
(19,213 missing values generated)

             | fail_pre_diverticulit
             |          is
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,824     18,015 |    24,839 
  sotrovimab |       133        403 |       536 
    paxlovid |       154        390 |       544 
molnupiravir |       145        405 |       550 
-------------+----------------------+----------
       Total |     7,256     19,213 |    26,469 
(19,213 missing values generated)
(19,213 real changes made)

             | fail_pre_d
             | iverticuli
             |    tis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,824 |     6,824 
  sotrovimab |       133 |       133 
    paxlovid |       154 |       154 
molnupiravir |       145 |       145 
-------------+-----------+----------
       Total |     7,256 |     7,256 
pre_diarrhoea
  2,623
  2,579
  39
(23,846 missing values generated)

             |  fail_pre_diarrhoea
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,461     22,378 |    24,839 
  sotrovimab |        40        496 |       536 
    paxlovid |        65        479 |       544 
molnupiravir |        57        493 |       550 
-------------+----------------------+----------
       Total |     2,623     23,846 |    26,469 
(23,846 missing values generated)
(23,846 real changes made)

             | fail_pre_d
             |  iarrhoea
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,461 |     2,461 
  sotrovimab |        40 |        40 
    paxlovid |        65 |        65 
molnupiravir |        57 |        57 
-------------+-----------+----------
       Total |     2,623 |     2,623 
pre_taste
  5,078
  5,005
  68
(21,391 missing values generated)

             |    fail_pre_taste
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,762     20,077 |    24,839 
  sotrovimab |       102        434 |       536 
    paxlovid |       109        435 |       544 
molnupiravir |       105        445 |       550 
-------------+----------------------+----------
       Total |     5,078     21,391 |    26,469 
(21,391 missing values generated)
(21,391 real changes made)

             | fail_pre_t
             |    aste
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,762 |     4,762 
  sotrovimab |       102 |       102 
    paxlovid |       109 |       109 
molnupiravir |       105 |       105 
-------------+-----------+----------
       Total |     5,078 |     5,078 
pre_anaphylaxis
  7,157
  7,072
  80
(19,312 missing values generated)

             | fail_pre_anaphylaxis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,706     18,133 |    24,839 
  sotrovimab |       149        387 |       536 
    paxlovid |       148        396 |       544 
molnupiravir |       154        396 |       550 
-------------+----------------------+----------
       Total |     7,157     19,312 |    26,469 
(19,312 missing values generated)
(19,312 real changes made)

             | fail_pre_a
             | naphylaxis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,706 |     6,706 
  sotrovimab |       149 |       149 
    paxlovid |       148 |       148 
molnupiravir |       154 |       154 
-------------+-----------+----------
       Total |     7,157 |     7,157 
pre_rash
  2,638
  2,598
  36
(23,831 missing values generated)

             |     fail_pre_rash
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,481     22,358 |    24,839 
  sotrovimab |        54        482 |       536 
    paxlovid |        48        496 |       544 
molnupiravir |        55        495 |       550 
-------------+----------------------+----------
       Total |     2,638     23,831 |    26,469 
(23,831 missing values generated)
(23,831 real changes made)

             | fail_pre_r
             |    ash
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,481 |     2,481 
  sotrovimab |        54 |        54 
    paxlovid |        48 |        48 
molnupiravir |        55 |        55 
-------------+-----------+----------
       Total |     2,638 |     2,638 
pre_drug
  2,635
  2,635
  0
(23,834 missing values generated)

             |     fail_pre_drug
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,460     22,379 |    24,839 
  sotrovimab |        54        482 |       536 
    paxlovid |        56        488 |       544 
molnupiravir |        65        485 |       550 
-------------+----------------------+----------
       Total |     2,635     23,834 |    26,469 
(23,834 missing values generated)
(23,834 real changes made)

             | fail_pre_d
             |    rug
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,460 |     2,460 
  sotrovimab |        54 |        54 
    paxlovid |        56 |        56 
molnupiravir |        65 |        65 
-------------+-----------+----------
       Total |     2,635 |     2,635 
pre_allergic
  2,654
  2,654
  0
(23,815 missing values generated)

             |   fail_pre_allergic
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,476     22,363 |    24,839 
  sotrovimab |        61        475 |       536 
    paxlovid |        53        491 |       544 
molnupiravir |        64        486 |       550 
-------------+----------------------+----------
       Total |     2,654     23,815 |    26,469 
(23,815 missing values generated)
(23,815 real changes made)

             | fail_pre_a
             |  llergic
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,476 |     2,476 
  sotrovimab |        61 |        61 
    paxlovid |        53 |        53 
molnupiravir |        64 |        64 
-------------+-----------+----------
       Total |     2,654 |     2,654 
pre_ra
  5,899
  5,827
  67
(20,570 missing values generated)

             |      fail_pre_ra
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,556     19,283 |    24,839 
  sotrovimab |       102        434 |       536 
    paxlovid |       122        422 |       544 
molnupiravir |       119        431 |       550 
-------------+----------------------+----------
       Total |     5,899     20,570 |    26,469 
(20,570 missing values generated)
(20,570 real changes made)

             | fail_pre_r
             |     a
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,556 |     5,556 
  sotrovimab |       102 |       102 
    paxlovid |       122 |       122 
molnupiravir |       119 |       119 
-------------+-----------+----------
       Total |     5,899 |     5,899 
pre_sle
  5,808
  5,753
  53
(20,661 missing values generated)

             |     fail_pre_sle
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,457     19,382 |    24,839 
  sotrovimab |       108        428 |       536 
    paxlovid |       114        430 |       544 
molnupiravir |       129        421 |       550 
-------------+----------------------+----------
       Total |     5,808     20,661 |    26,469 
(20,661 missing values generated)
(20,661 real changes made)

             | fail_pre_s
             |     le
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,457 |     5,457 
  sotrovimab |       108 |       108 
    paxlovid |       114 |       114 
molnupiravir |       129 |       129 
-------------+-----------+----------
       Total |     5,808 |     5,808 
pre_psorasis
  4,550
  4,504
  44
(21,919 missing values generated)

             |   fail_pre_psorasis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,267     20,572 |    24,839 
  sotrovimab |        85        451 |       536 
    paxlovid |       101        443 |       544 
molnupiravir |        97        453 |       550 
-------------+----------------------+----------
       Total |     4,550     21,919 |    26,469 
(21,919 missing values generated)
(21,919 real changes made)

             | fail_pre_p
             |  sorasis
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,267 |     4,267 
  sotrovimab |        85 |        85 
    paxlovid |       101 |       101 
molnupiravir |        97 |        97 
-------------+-----------+----------
       Total |     4,550 |     4,550 
pre_psa
  4,547
  4,512
  34
(21,922 missing values generated)

             |     fail_pre_psa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,275     20,564 |    24,839 
  sotrovimab |        97        439 |       536 
    paxlovid |        86        458 |       544 
molnupiravir |        89        461 |       550 
-------------+----------------------+----------
       Total |     4,547     21,922 |    26,469 
(21,922 missing values generated)
(21,922 real changes made)

             | fail_pre_p
             |     sa
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,275 |     4,275 
  sotrovimab |        97 |        97 
    paxlovid |        86 |        86 
molnupiravir |        89 |        89 
-------------+-----------+----------
       Total |     4,547 |     4,547 
pre_ankspon
  4,443
  4,408
  33
(22,026 missing values generated)

             |   fail_pre_ankspon
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,174     20,665 |    24,839 
  sotrovimab |        87        449 |       536 
    paxlovid |        77        467 |       544 
molnupiravir |       105        445 |       550 
-------------+----------------------+----------
       Total |     4,443     22,026 |    26,469 
(22,026 missing values generated)
(22,026 real changes made)

             | fail_pre_a
             |   nkspon
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,174 |     4,174 
  sotrovimab |        87 |        87 
    paxlovid |        77 |        77 
molnupiravir |       105 |       105 
-------------+-----------+----------
       Total |     4,443 |     4,443 
pre_ibd
  15,214
  15,214
  0
(11,255 missing values generated)

             |     fail_pre_ibd
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    14,293     10,546 |    24,839 
  sotrovimab |       299        237 |       536 
    paxlovid |       317        227 |       544 
molnupiravir |       305        245 |       550 
-------------+----------------------+----------
       Total |    15,214     11,255 |    26,469 
(11,255 missing values generated)
(11,255 real changes made)

             | fail_pre_i
             |     bd
        drug |         1 |     Total
-------------+-----------+----------
     control |    14,293 |    14,293 
  sotrovimab |       299 |       299 
    paxlovid |       317 |       317 
molnupiravir |       305 |       305 
-------------+-----------+----------
       Total |    15,214 |    15,214 

. 
end of do-file

. do "C:\Users\k1635179\AppData\Local\Temp\STD5f0_000000.tmp"

. tempname comparator

. postfile `comparator' str20(failure) ///
>         ptime_all events_all rate_all /// 
>         ptime_control events_control rate_control /// 
>         ptime_sot events_sot rate_sot ///
>         ptime_pax events_pax rate_pax ///
>         ptime_mol events_mol rate_mol ///
>         using "$projectdir/output/tables/comparator_rate_summary", replace      

.                                                  
. * Failures over 1 years - convert into 28 day rate
. foreach fail in $pre_ae_group $pre_ae_disease {
  2.                                                          
.         stset stop_`fail', id(patient_id) origin(time start_comparator) enter(time start_comparator) failure(fail_`fail'==1)    
  3.                 stptime 
  4.                                         local rate_all = `r(rate)'
  5.                                         local ptime_all = `r(ptime)'
  6.                                         local events_all .
  7.                                                 if `r(failures)' == 0 | `r(failures)' > 5 local events_all `r(failures)'
  8.                 
.                 stptime if drug == 0
  9.                                         local rate_control = `r(rate)'
 10.                                         local ptime_control = `r(ptime)'
 11.                                         local events_control .
 12.                                                 if `r(failures)' == 0 | `r(failures)' > 5 local events_control `r(failures)'
 13.                 display "no drug"
 14. 
.                 stptime if drug == 1
 15.                                         local rate_sot = `r(rate)'
 16.                                         local ptime_sot = `r(ptime)'
 17.                                         local events_sot .
 18.                                                 if `r(failures)' == 0 | `r(failures)' > 5 local events_sot `r(failures)'
 19.                 display "sotrovimab"
 20.                 
.                 stptime if drug == 2
 21.                                         local rate_pax = `r(rate)'
 22.                                         local ptime_pax = `r(ptime)'
 23.                                         local events_pax .
 24.                                                 if `r(failures)' == 0 | `r(failures)' > 5 local events_pax `r(failures)'
 25.                 display "paxlovid"
 26.                 
.                 stptime if drug == 3
 27.                                         local rate_mol = `r(rate)'
 28.                                         local ptime_mol = `r(ptime)'
 29.                                         local events_mol .
 30.                                                 if `r(failures)' == 0 | `r(failures)' > 5 local events_mol `r(failures)'
 31.                 display "molnupavir"
 32.                                                 
.                 post `comparator' ("`fail'") (`ptime_all') (`events_all') (`rate_all') ///
>                                         (`ptime_control') (`events_control') (`rate_control') ///
>                                         (`ptime_sot') (`events_sot') (`rate_sot') ///
>                                         (`ptime_pax') (`events_pax') (`rate_pax') ///
>                                         (`ptime_mol') (`events_mol') (`rate_mol') 
 33.                                         
. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_all==1
Observed time interval: (stop_pre_spc_all[_n-1], stop_pre_spc_all]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
      1,880  observations end on or before enter()
--------------------------------------------------------------------------
     24,589  observations remaining, representing
     24,589  subjects
     10,584  failures in single-failure-per-subject data
   10225652  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,041

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     10225652      10584   .00103504   .0010155     .001055

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      9612218       9948   .00103493   .0010148    .0010555
no drug

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       203213        199   .00097927   .0008522    .0011252
sotrovimab

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       199428        220   .00110316   .0009666     .001259
paxlovid

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       210793        217   .00102945   .0009012    .0011759
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_all==1
Observed time interval: (stop_pre_drug_all[_n-1], stop_pre_drug_all]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
      1,136  observations end on or before enter()
--------------------------------------------------------------------------
     25,333  observations remaining, representing
     25,333  subjects
     11,233  failures in single-failure-per-subject data
   13304204  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,042

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     13304204      11233   .00084432   .0008288    .0008601

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     12452489      10517   .00084457   .0008286    .0008609
no drug

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       276818        238   .00085977   .0007572    .0009762
sotrovimab

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       281465        229    .0008136   .0007148    .0009261
paxlovid

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       293432        249   .00084858   .0007495    .0009608
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_all==1
Observed time interval: (stop_pre_imae_all[_n-1], stop_pre_imae_all]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
      2,128  observations end on or before enter()
--------------------------------------------------------------------------
     24,341  observations remaining, representing
     24,341  subjects
     20,531  failures in single-failure-per-subject data
   23075051  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,046

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     23075051      20531   .00088975   .0008777     .000902

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     21681506      19302   .00089025   .0008778    .0009029
no drug

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     468957.5        401   .00085509   .0007754     .000943
sotrovimab

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       448569        405   .00090287   .0008191    .0009952
paxlovid

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       476019        423   .00088862   .0008078    .0009775
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ae_all==1
Observed time interval: (stop_pre_ae_all[_n-1], stop_pre_ae_all]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
          0  exclusions
--------------------------------------------------------------------------
     26,469  observations remaining, representing
     26,469  subjects
          0  failures in single-failure-per-subject data
    767,601  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_ae_all==1
   Analysis time _t: (stop_pre_ae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       767601          0           0          .           .

         Failure _d: fail_pre_ae_all==1
   Analysis time _t: (stop_pre_ae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       720331          0           0          .           .
no drug

         Failure _d: fail_pre_ae_all==1
   Analysis time _t: (stop_pre_ae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        15544          0           0          .           .
sotrovimab

         Failure _d: fail_pre_ae_all==1
   Analysis time _t: (stop_pre_ae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        15776          0           0          .           .
paxlovid

         Failure _d: fail_pre_ae_all==1
   Analysis time _t: (stop_pre_ae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        15950          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diverticulitis==1
Observed time interval: (stop_pre_diverticulitis[_n-1], stop_pre_diverticulitis]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        772  observations end on or before enter()
--------------------------------------------------------------------------
     25,697  observations remaining, representing
     25,697  subjects
      6,484  failures in single-failure-per-subject data
  7,532,751  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,041

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      7532751       6484   .00086077   .0008401     .000882

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      7073295       6099   .00086226   .0008409    .0008842
no drug

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       145193        117   .00080582   .0006723    .0009659
sotrovimab

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       151808        135   .00088928   .0007512    .0010527
paxlovid

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       162455        133   .00081869   .0006907    .0009703
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diarrhoea==1
Observed time interval: (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        391  observations end on or before enter()
--------------------------------------------------------------------------
     26,078  observations remaining, representing
     26,078  subjects
      2,232  failures in single-failure-per-subject data
  2,654,393  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,039

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2654393       2232   .00084087   .0008067    .0008765

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2485900       2094   .00084235    .000807    .0008792
no drug

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        44553         33   .00074069   .0005266    .0010419
sotrovimab

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        66667         56      .00084   .0006464    .0010915
paxlovid

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        57273         49   .00085555   .0006466     .001132
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_taste==1
Observed time interval: (stop_pre_taste[_n-1], stop_pre_taste]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        772  observations end on or before enter()
--------------------------------------------------------------------------
     25,697  observations remaining, representing
     25,697  subjects
      4,306  failures in single-failure-per-subject data
  4,375,256  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,037

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      4375256       4306   .00098417   .0009552     .001014

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      4094686       4029   .00098396    .000954    .0010148
no drug

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       102988         96   .00093215   .0007631    .0011386
sotrovimab

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        88510         90   .00101683    .000827    .0012502
paxlovid

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        89072         91   .00102165   .0008319    .0012547
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_anaphylaxis==1
Observed time interval: (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        748  observations end on or before enter()
--------------------------------------------------------------------------
     25,721  observations remaining, representing
     25,721  subjects
      6,409  failures in single-failure-per-subject data
  7,483,187  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,044

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      7483187       6409   .00085645   .0008357    .0008777

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      7006752       6008   .00085746    .000836    .0008794
no drug

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       166261        138   .00083002   .0007025    .0009807
sotrovimab

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       156404        129   .00082479   .0006941    .0009801
paxlovid

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       153770        134   .00087143   .0007357    .0010322
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_rash==1
Observed time interval: (stop_pre_rash[_n-1], stop_pre_rash]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        403  observations end on or before enter()
--------------------------------------------------------------------------
     26,066  observations remaining, representing
     26,066  subjects
      2,235  failures in single-failure-per-subject data
  2,653,747  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     1,998

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2653747       2235   .00084221    .000808    .0008779

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2494821       2095   .00083974   .0008045    .0008765
no drug

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        50627         50   .00098762   .0007485    .0013031
sotrovimab

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        56228         43   .00076474   .0005672    .0010312
paxlovid

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        52071         47   .00090261   .0006782    .0012013
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug==1
Observed time interval: (stop_pre_drug[_n-1], stop_pre_drug]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
          0  exclusions
--------------------------------------------------------------------------
     26,469  observations remaining, representing
     26,469  subjects
      2,635  failures in single-failure-per-subject data
  4,633,876  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,042

         Failure _d: fail_pre_drug==1
   Analysis time _t: (stop_pre_drug-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      4633876       2635   .00056864   .0005473    .0005908

         Failure _d: fail_pre_drug==1
   Analysis time _t: (stop_pre_drug-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      4329589       2460   .00056818   .0005462    .0005911
no drug

         Failure _d: fail_pre_drug==1
   Analysis time _t: (stop_pre_drug-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        97127         54   .00055597   .0004258    .0007259
sotrovimab

         Failure _d: fail_pre_drug==1
   Analysis time _t: (stop_pre_drug-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        96525         56   .00058016   .0004465    .0007539
paxlovid

         Failure _d: fail_pre_drug==1
   Analysis time _t: (stop_pre_drug-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       110635         65   .00058752   .0004607    .0007492
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_allergic==1
Observed time interval: (stop_pre_allergic[_n-1], stop_pre_allergic]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
          0  exclusions
--------------------------------------------------------------------------
     26,469  observations remaining, representing
     26,469  subjects
      2,654  failures in single-failure-per-subject data
  4,677,674  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,029

         Failure _d: fail_pre_allergic==1
   Analysis time _t: (stop_pre_allergic-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      4677674       2654   .00056738   .0005462    .0005894

         Failure _d: fail_pre_allergic==1
   Analysis time _t: (stop_pre_allergic-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      4365917       2476   .00056712   .0005452    .0005899
no drug

         Failure _d: fail_pre_allergic==1
   Analysis time _t: (stop_pre_allergic-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       104130         61   .00058581   .0004558    .0007529
sotrovimab

         Failure _d: fail_pre_allergic==1
   Analysis time _t: (stop_pre_allergic-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        97172         53   .00054542   .0004167    .0007139
paxlovid

         Failure _d: fail_pre_allergic==1
   Analysis time _t: (stop_pre_allergic-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       110455         64   .00057942   .0004535    .0007403
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ra==1
Observed time interval: (stop_pre_ra[_n-1], stop_pre_ra]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        601  observations end on or before enter()
--------------------------------------------------------------------------
     25,868  observations remaining, representing
     25,868  subjects
      5,298  failures in single-failure-per-subject data
  6,342,982  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,035

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      6342982       5298   .00083525   .0008131    .0008581

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5968504       4992   .00083639   .0008135    .0008599
no drug

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       124044         92   .00074167   .0006046    .0009098
sotrovimab

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       124011        109   .00087895   .0007285    .0010605
paxlovid

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       126423        105   .00083055    .000686    .0010056
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_sle==1
Observed time interval: (stop_pre_sle[_n-1], stop_pre_sle]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        590  observations end on or before enter()
--------------------------------------------------------------------------
     25,879  observations remaining, representing
     25,879  subjects
      5,218  failures in single-failure-per-subject data
  6,238,073  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,046

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      6238073       5218   .00083648   .0008141    .0008595

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5871777       4908   .00083586   .0008128    .0008596
no drug

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       110915         96   .00086553   .0007086    .0010572
sotrovimab

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       119515        102   .00085345   .0007029    .0010362
paxlovid

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       135866        112   .00082434    .000685    .0009921
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psorasis==1
Observed time interval: (stop_pre_psorasis[_n-1], stop_pre_psorasis]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        358  observations end on or before enter()
--------------------------------------------------------------------------
     26,111  observations remaining, representing
     26,111  subjects
      4,192  failures in single-failure-per-subject data
  5,648,157  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,023

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5648157       4192   .00074219   .0007201     .000765

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5305214       3938   .00074229   .0007195    .0007658
no drug

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       107904         77    .0007136   .0005708    .0008922
sotrovimab

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       113030         86   .00076086   .0006159    .0009399
paxlovid

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       122009         91   .00074585   .0006073     .000916
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psa==1
Observed time interval: (stop_pre_psa[_n-1], stop_pre_psa]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        344  observations end on or before enter()
--------------------------------------------------------------------------
     26,125  observations remaining, representing
     26,125  subjects
      4,203  failures in single-failure-per-subject data
  5,680,882  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,036

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5680882       4203   .00073985   .0007178    .0007626

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5340103       3949    .0007395   .0007168    .0007629
no drug

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       124199         93    .0007488   .0006111    .0009176
sotrovimab

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       101493         78   .00076853   .0006156    .0009595
paxlovid

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       115087         83   .00072119   .0005816    .0008943
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ankspon==1
Observed time interval: (stop_pre_ankspon[_n-1], stop_pre_ankspon]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
        335  observations end on or before enter()
--------------------------------------------------------------------------
     26,134  observations remaining, representing
     26,134  subjects
      4,108  failures in single-failure-per-subject data
  5,541,429  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,046

         Failure _d: fail_pre_ankspon==1
   Analysis time _t: (stop_pre_ankspon-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5541429       4108   .00074133    .000719    .0007643

         Failure _d: fail_pre_ankspon==1
   Analysis time _t: (stop_pre_ankspon-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      5222359       3873   .00074162   .0007186    .0007653
no drug

         Failure _d: fail_pre_ankspon==1
   Analysis time _t: (stop_pre_ankspon-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       105041         74   .00070449   .0005609    .0008848
sotrovimab

         Failure _d: fail_pre_ankspon==1
   Analysis time _t: (stop_pre_ankspon-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |        91402         65   .00071114   .0005577    .0009069
paxlovid

         Failure _d: fail_pre_ankspon==1
   Analysis time _t: (stop_pre_ankspon-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       122627         96   .00078286   .0006409    .0009562
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ibd==1
Observed time interval: (stop_pre_ibd[_n-1], stop_pre_ibd]
     Enter on or after: time start_comparator
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,469  total observations
          0  exclusions
--------------------------------------------------------------------------
     26,469  observations remaining, representing
     26,469  subjects
     15,214  failures in single-failure-per-subject data
 22223003.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =     2,042

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     22223004      15214   .00068461   .0006738    .0006956

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     20879900      14293   .00068453   .0006734    .0006958
no drug

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       435455        299   .00068664   .0006131     .000769
sotrovimab

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     464036.5        317   .00068314   .0006119    .0007626
paxlovid

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       443612        305   .00068754   .0006145    .0007692
molnupavir

. 
. postclose `comparator'

. use "$projectdir/output/tables/comparator_rate_summary", replace

. export delimited using "$projectdir/output/tables/comparator_rate_summary_csv.csv", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/comparator_rate_summary_csv.csv saved

. 
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/preceed_rate.log
  log type:  text
 closed on:   1 Aug 2023, 14:24:16
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
