-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 opened on:  31 Oct 2023, 22:13:31

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for compa
> rative rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prior
. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 
(51,837 missing values generated)

. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0 
(51,820 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snomed_new=
> =0 
(51,762 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 
(51,845 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 
(51,772 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 
(51,817 missing values generated)

. gen new_pre_psoriasis_icd = pre_psoriasis_icd_prim if pre_psoriasis_snomed_ne
> w==0 
(51,765 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_snomed_n
> ew==0 
(51,753 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new==0
(51,799 missing values generated)

. gen new_pre_psa_icd = pre_psa_icd_prim if pre_psa_snomed_new==0
(51,806 missing values generated)

. gen new_pre_psa_ae = pre_psa_ae if pre_psa_snomed_new==0 
(51,879 missing values generated)

. gen new_pre_psa_snomed = pre_psa_snomed if pre_psa_snomed_new==0 
(51,854 missing values generated)

. gen new_pre_axspa_icd = pre_axspa_icd_prim if pre_axspa_ctv_new==0
(51,839 missing values generated)

. gen new_pre_axspa_ctv = pre_axspa_ctv if pre_axspa_ctv_new==0 
(51,818 missing values generated)

. gen new_pre_axspa_ae = pre_axspa_ae if pre_axspa_ctv_new==0
(51,831 missing values generated)

. gen new_pre_ibd_icd = pre_ibd_icd_prim if pre_ibd_ctv_new==0
(51,806 missing values generated)

. gen new_pre_ibd_ctv = pre_ibd_ctv if pre_ibd_ctv_new==0
(51,879 missing values generated)

. gen new_pre_ibd_ae = pre_ibd_ae if pre_ibd_ctv_new==0
(51,799 missing values generated)

. 
. *** combined all AEs from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_diverticulitis
> _snomed pre_diverticulitis_ae)      
(41471 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_icd_prim pre_diarrhoea_snomed  pre_di
> arrhoeal_icd_prim)
(41456 missing values generated)

. egen pre_taste = rmin(pre_taste_icd_prim pre_taste_snomed )
(46212 missing values generated)

. egen pre_rash = rmin(pre_rash_icd_prim pre_rash_snomed pre_rash_ae)
(41443 missing values generated)

. egen pre_bronchospasm = rmin(pre_bronchospasm_snomed)
(51260 missing values generated)

. egen pre_contactderm = rmin(pre_contactderm_snomed pre_contactderm_icd_prim p
> re_contactderm_ae)
(41460 missing values generated)

. egen pre_dizziness = rmin(pre_dizziness_snomed pre_dizziness_ae pre_dizziness
> _icd_prim)
(41418 missing values generated)

. egen pre_nausea_vomit = rmin(pre_nausea_vomit_snomed pre_nausea_vomit_icd_pri
> m)
(46080 missing values generated)

. egen pre_headache = rmin(pre_headache_snomed pre_headache_ae pre_headache_icd
> _prim)
(41387 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_snomed  
>    pre_anaphlaxis_ae)
(41445 missing values generated)

. egen pre_drugreaction = rmin(pre_severedrug_icd_prim pre_severedrug_sjs_icd_p
> rim pre_severedrug_snomed pre_severedrug_ae pre_nonsevere_drug_snomed pre_non
> severe_drug_ae)
(30348 missing values generated)

. egen pre_ra = rmin(new_pre_ra_icd new_pre_ra_ae new_pre_ra_snomed )
(42966 missing values generated)

. egen pre_sle = rmin(new_pre_sle_icd new_pre_sle_ctv new_pre_sle_ae)
(43057 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_icd new_pre_psoriasis_snomed  new_
> pre_psoriasis_ae)
(42934 missing values generated)

. egen pre_psa = rmin(new_pre_psa_icd new_pre_psa_ae new_pre_psa_snomed)
(43060 missing values generated)

. egen pre_axspa = rmin(new_pre_axspa_icd  new_pre_axspa_ae new_pre_axspa_ctv)
(43038 missing values generated)

. egen pre_ibd = rmin(new_pre_ibd_icd new_pre_ibd_ctv new_pre_ibd_ae)
(43040 missing values generated)

. 
. *** combined serious AEs from hosp and A&E
. egen pre_diverticulitis_serious = rmin(pre_diverticulitis_icd_prim)      
(51225 missing values generated)

. egen pre_diarrhoea_serious = rmin(pre_diarrhoea_icd_prim pre_diarrhoeal_icd_p
> rim)
(46087 missing values generated)

. egen pre_taste_serious = rmin(pre_taste_icd_prim)
(51335 missing values generated)

. egen pre_rash_serious = rmin(pre_rash_icd_prim)
(51249 missing values generated)

. egen pre_contactderm_serious = rmin(pre_contactderm_snomed pre_contactderm_ic
> d_prim pre_contactderm_ae)
(41460 missing values generated)

. egen pre_dizziness_serious = rmin(pre_dizziness_icd_prim)
(51247 missing values generated)

. egen pre_nausea_vomit_serious = rmin(pre_nausea_vomit_icd_prim)
(51168 missing values generated)

. egen pre_headache_serious = rmin(pre_headache_icd_prim)
(51206 missing values generated)

. egen pre_anaphylaxis_serious = rmin(pre_anaphylaxis_icd_prim)
(51307 missing values generated)

. egen pre_drugreaction_serious = rmin(pre_severedrug_icd_prim pre_severedrug_s
> js_icd_prim)
(46199 missing values generated)

. egen pre_ra_serious = rmin(new_pre_ra_icd)
(51837 missing values generated)

. egen pre_sle_serious = rmin(new_pre_sle_icd)
(51772 missing values generated)

. egen pre_psorasis_serious = rmin(new_pre_psoriasis_icd)
(51765 missing values generated)

. egen pre_psa_serious = rmin(new_pre_psa_icd)
(51806 missing values generated)

. egen pre_axspa_serious = rmin(new_pre_axspa_icd)
(51839 missing values generated)

. egen pre_ibd_serious = rmin(new_pre_ibd_icd)
(51806 missing values generated)

. 
. *** combined AEs by spc, drug and imae                          
. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste pre_rash p
> re_contactderm pre_bronchospasm pre_dizziness pre_nausea_vomit pre_headache p
> re_anaphylaxis pre_drugreaction)
(1927 missing values generated)

. egen pre_spc_serious = rmin(pre_diverticulitis_serious pre_diarrhoea_serious 
> pre_taste_serious pre_rash_serious pre_contactderm_serious pre_dizziness_seri
> ous pre_nausea_vomit_serious pre_headache_serious)
(17779 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_drugreaction)
(22091 missing values generated)

. egen pre_drug_serious = rmin(pre_anaphylaxis_serious pre_drugreaction_serious
> )
(41627 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_ibd pre_axsp
> a)
(10446 missing values generated)

. egen pre_imae_serious = rmin(pre_ra_serious pre_sle_serious pre_psorasis_seri
> ous pre_psa_serious pre_axspa_serious pre_ibd_serious)
(32170 missing values generated)

. egen pre_all = rmin(ae_spc_all ae_drug_all ae_imae_all )

. egen pre_all_serious = rmin(ae_spc_serious ae_drug_serious ae_imae_serious)
(7 missing values generated)

. 
. global pre_ae_disease                   pre_diverticulitis                   
>            ///
>                                                                 pre_diarrhoea
>                                    ///
>                                                                 pre_taste    
>                                            ///
>                                                                 pre_rash     
>                                            ///
>                                                                 pre_bronchosp
> asm                                ///
>                                                                 pre_contactde
> rm                                 ///
>                                                                 pre_dizziness
>                                    ///
>                                                                 pre_nausea_vo
> mit                                ///
>                                                                 pre_headache 
>                                    ///
>                                                                 pre_anaphylax
> is                                 ///
>                                                                 pre_drugreact
> ion                                ///
>                                                                 pre_ra       
>                                            ///
>                                                                 pre_sle      
>                                            ///
>                                                                 pre_psorasis 
>                                    ///
>                                                                 pre_psa      
>                                            ///
>                                                                 pre_axspa    
>                                            ///
>                                                                 pre_ibd 

. global pre_ae_disease_serious   pre_diverticulitis_serious              ///
>                                                                 pre_diarrhoea
> _serious                   ///
>                                                                 pre_taste_ser
> ious                               ///
>                                                                 pre_rash_seri
> ous                                ///
>                                                                 pre_contactde
> rm_serious                 ///
>                                                                 pre_dizziness
> _serious                   ///
>                                                                 pre_nausea_vo
> mit_serious                ///
>                                                                 pre_headache_
> serious                    ///
>                                                                 pre_anaphylax
> is_serious                 ///
>                                                                 pre_drugreact
> ion_serious                ///
>                                                                 pre_ra_seriou
> s                                  ///
>                                                                 pre_sle_serio
> us                                 ///
>                                                                 pre_psorasis_
> serious                    ///
>                                                                 pre_psa_serio
> us                                 ///
>                                                                 pre_axspa_ser
> ious                               ///
>                                                                 pre_ibd_serio
> us                                                         

. global pre_ae_combined                  pre_all                              
>                    ///
>                                                                 pre_all_serio
> us                                 ///
>                                                                 pre_spc_all  
>                                    ///
>                                                                 pre_spc_serio
> us                                 ///
>                                                                 pre_drug_all 
>                                    ///
>                                                                 pre_drug_seri
> ous                                ///
>                                                                 pre_imae_all 
>                                    ///     
>                                                                 pre_imae_seri
> ous                                                        

. 
. ********************************************************
. *       A. START DATE           *
. ********************************************************
. gen start_comparator = start_date-1460
(5,642 missing values generated)

. gen start_comparator_28 = start_date - 1431
(5,642 missing values generated)

. 
. ********************************************************
. *       A. COX MODEL            *
. ********************************************************
. * Generate failure 
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparator_28) 
> & `x'!=.  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparator_28) 
> & `x'!=.  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8. }
pre_diverticulitis
  15,488
  15,326
  154
(41,471 missing values generated)

                      | fail_pre_diverticulit
                      |          is
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,183     19,234 |    26,417 
           sotrovimab |     2,763      7,399 |    10,162 
             paxlovid |     2,794      7,429 |    10,223 
         molnupiravir |     2,748      7,409 |    10,157 
----------------------+----------------------+----------
                Total |    15,488     41,471 |    56,959 
pre_diarrhoea
  15,503
  15,317
  177
(41,456 missing values generated)

                      |  fail_pre_diarrhoea
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,144     19,273 |    26,417 
           sotrovimab |     2,799      7,363 |    10,162 
             paxlovid |     2,749      7,474 |    10,223 
         molnupiravir |     2,811      7,346 |    10,157 
----------------------+----------------------+----------
                Total |    15,503     41,456 |    56,959 
pre_taste
  10,747
  10,624
  114
(46,212 missing values generated)

                      |    fail_pre_taste
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,037     21,380 |    26,417 
           sotrovimab |     1,909      8,253 |    10,162 
             paxlovid |     1,890      8,333 |    10,223 
         molnupiravir |     1,911      8,246 |    10,157 
----------------------+----------------------+----------
                Total |    10,747     46,212 |    56,959 
pre_rash
  15,516
  15,374
  129
(41,443 missing values generated)

                      |     fail_pre_rash
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,227     19,190 |    26,417 
           sotrovimab |     2,739      7,423 |    10,162 
             paxlovid |     2,806      7,417 |    10,223 
         molnupiravir |     2,744      7,413 |    10,157 
----------------------+----------------------+----------
                Total |    15,516     41,443 |    56,959 
pre_bronchospasm
  5,699
  5,639
  55
(51,260 missing values generated)

                      | fail_pre_bronchospasm
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,655     23,762 |    26,417 
           sotrovimab |     1,032      9,130 |    10,162 
             paxlovid |     1,016      9,207 |    10,223 
         molnupiravir |       996      9,161 |    10,157 
----------------------+----------------------+----------
                Total |     5,699     51,260 |    56,959 
pre_contactderm
  15,499
  15,345
  145
(41,460 missing values generated)

                      | fail_pre_contactderm
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,167     19,250 |    26,417 
           sotrovimab |     2,741      7,421 |    10,162 
             paxlovid |     2,826      7,397 |    10,223 
         molnupiravir |     2,765      7,392 |    10,157 
----------------------+----------------------+----------
                Total |    15,499     41,460 |    56,959 
pre_dizziness
  15,541
  15,396
  136
(41,418 missing values generated)

                      |  fail_pre_dizziness
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,198     19,219 |    26,417 
           sotrovimab |     2,865      7,297 |    10,162 
             paxlovid |     2,775      7,448 |    10,223 
         molnupiravir |     2,703      7,454 |    10,157 
----------------------+----------------------+----------
                Total |    15,541     41,418 |    56,959 
pre_nausea_vomit
  10,879
  10,741
  122
(46,080 missing values generated)

                      | fail_pre_nausea_vomit
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,038     21,379 |    26,417 
           sotrovimab |     1,901      8,261 |    10,162 
             paxlovid |     1,960      8,263 |    10,223 
         molnupiravir |     1,980      8,177 |    10,157 
----------------------+----------------------+----------
                Total |    10,879     46,080 |    56,959 
pre_headache
  15,572
  15,419
  138
(41,387 missing values generated)

                      |   fail_pre_headache
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,257     19,160 |    26,417 
           sotrovimab |     2,719      7,443 |    10,162 
             paxlovid |     2,765      7,458 |    10,223 
         molnupiravir |     2,831      7,326 |    10,157 
----------------------+----------------------+----------
                Total |    15,572     41,387 |    56,959 
pre_anaphylaxis
  15,514
  15,369
  136
(41,445 missing values generated)

                      | fail_pre_anaphylaxis
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,215     19,202 |    26,417 
           sotrovimab |     2,787      7,375 |    10,162 
             paxlovid |     2,756      7,467 |    10,223 
         molnupiravir |     2,756      7,401 |    10,157 
----------------------+----------------------+----------
                Total |    15,514     41,445 |    56,959 
pre_drugreaction
  26,611
  26,339
  256
(30,348 missing values generated)

                      | fail_pre_drugreaction
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    12,365     14,052 |    26,417 
           sotrovimab |     4,781      5,381 |    10,162 
             paxlovid |     4,751      5,472 |    10,223 
         molnupiravir |     4,714      5,443 |    10,157 
----------------------+----------------------+----------
                Total |    26,611     30,348 |    56,959 
pre_ra
  13,993
  13,855
  130
(42,966 missing values generated)

                      |      fail_pre_ra
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,507     19,910 |    26,417 
           sotrovimab |     2,426      7,736 |    10,162 
             paxlovid |     2,536      7,687 |    10,223 
         molnupiravir |     2,524      7,633 |    10,157 
----------------------+----------------------+----------
                Total |    13,993     42,966 |    56,959 
pre_sle
  13,902
  13,767
  126
(43,057 missing values generated)

                      |     fail_pre_sle
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,420     19,997 |    26,417 
           sotrovimab |     2,465      7,697 |    10,162 
             paxlovid |     2,543      7,680 |    10,223 
         molnupiravir |     2,474      7,683 |    10,157 
----------------------+----------------------+----------
                Total |    13,902     43,057 |    56,959 
pre_psorasis
  14,025
  13,899
  122
(42,934 missing values generated)

                      |   fail_pre_psorasis
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,497     19,920 |    26,417 
           sotrovimab |     2,553      7,609 |    10,162 
             paxlovid |     2,552      7,671 |    10,223 
         molnupiravir |     2,423      7,734 |    10,157 
----------------------+----------------------+----------
                Total |    14,025     42,934 |    56,959 
pre_psa
  13,899
  13,749
  141
(43,060 missing values generated)

                      |     fail_pre_psa
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,517     19,900 |    26,417 
           sotrovimab |     2,463      7,699 |    10,162 
             paxlovid |     2,495      7,728 |    10,223 
         molnupiravir |     2,424      7,733 |    10,157 
----------------------+----------------------+----------
                Total |    13,899     43,060 |    56,959 
pre_axspa
  13,921
  13,795
  121
(43,038 missing values generated)

                      |    fail_pre_axspa
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,426     19,991 |    26,417 
           sotrovimab |     2,462      7,700 |    10,162 
             paxlovid |     2,563      7,660 |    10,223 
         molnupiravir |     2,470      7,687 |    10,157 
----------------------+----------------------+----------
                Total |    13,921     43,038 |    56,959 
pre_ibd
  13,919
  13,781
  131
(43,040 missing values generated)

                      |     fail_pre_ibd
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,511     19,906 |    26,417 
           sotrovimab |     2,436      7,726 |    10,162 
             paxlovid |     2,498      7,725 |    10,223 
         molnupiravir |     2,474      7,683 |    10,157 
----------------------+----------------------+----------
                Total |    13,919     43,040 |    56,959 
pre_diverticulitis_serious
  5,734
  5,657
  74
(51,225 missing values generated)

                      | fail_pre_diverticulit
                      |      is_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,699     23,718 |    26,417 
           sotrovimab |       988      9,174 |    10,162 
             paxlovid |     1,050      9,173 |    10,223 
         molnupiravir |       997      9,160 |    10,157 
----------------------+----------------------+----------
                Total |     5,734     51,225 |    56,959 
pre_diarrhoea_serious
  10,872
  10,745
  120
(46,087 missing values generated)

                      | fail_pre_diarrhoea_se
                      |         rious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,038     21,379 |    26,417 
           sotrovimab |     1,938      8,224 |    10,162 
             paxlovid |     1,923      8,300 |    10,223 
         molnupiravir |     1,973      8,184 |    10,157 
----------------------+----------------------+----------
                Total |    10,872     46,087 |    56,959 
pre_taste_serious
  5,624
  5,562
  57
(51,335 missing values generated)

                      | fail_pre_taste_seriou
                      |           s
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,650     23,767 |    26,417 
           sotrovimab |     1,002      9,160 |    10,162 
             paxlovid |       969      9,254 |    10,223 
         molnupiravir |     1,003      9,154 |    10,157 
----------------------+----------------------+----------
                Total |     5,624     51,335 |    56,959 
pre_rash_serious
  5,710
  5,643
  61
(51,249 missing values generated)

                      | fail_pre_rash_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,639     23,778 |    26,417 
           sotrovimab |     1,031      9,131 |    10,162 
             paxlovid |     1,030      9,193 |    10,223 
         molnupiravir |     1,010      9,147 |    10,157 
----------------------+----------------------+----------
                Total |     5,710     51,249 |    56,959 
pre_contactderm_serious
  15,499
  15,345
  145
(41,460 missing values generated)

                      | fail_pre_contactderm_
                      |        serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,167     19,250 |    26,417 
           sotrovimab |     2,741      7,421 |    10,162 
             paxlovid |     2,826      7,397 |    10,223 
         molnupiravir |     2,765      7,392 |    10,157 
----------------------+----------------------+----------
                Total |    15,499     41,460 |    56,959 
pre_dizziness_serious
  5,712
  5,637
  70
(51,247 missing values generated)

                      | fail_pre_dizziness_se
                      |         rious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,633     23,784 |    26,417 
           sotrovimab |     1,046      9,116 |    10,162 
             paxlovid |     1,044      9,179 |    10,223 
         molnupiravir |       989      9,168 |    10,157 
----------------------+----------------------+----------
                Total |     5,712     51,247 |    56,959 
pre_nausea_vomit_serious
  5,791
  5,713
  74
(51,168 missing values generated)

                      | fail_pre_nausea_vomit
                      |       _serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,712     23,705 |    26,417 
           sotrovimab |     1,015      9,147 |    10,162 
             paxlovid |     1,027      9,196 |    10,223 
         molnupiravir |     1,037      9,120 |    10,157 
----------------------+----------------------+----------
                Total |     5,791     51,168 |    56,959 
pre_headache_serious
  5,753
  5,673
  75
(51,206 missing values generated)

                      | fail_pre_headache_ser
                      |         ious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,706     23,711 |    26,417 
           sotrovimab |     1,008      9,154 |    10,162 
             paxlovid |     1,034      9,189 |    10,223 
         molnupiravir |     1,005      9,152 |    10,157 
----------------------+----------------------+----------
                Total |     5,753     51,206 |    56,959 
pre_anaphylaxis_serious
  5,652
  5,567
  81
(51,307 missing values generated)

                      | fail_pre_anaphylaxis_
                      |        serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,598     23,819 |    26,417 
           sotrovimab |     1,023      9,139 |    10,162 
             paxlovid |     1,037      9,186 |    10,223 
         molnupiravir |       994      9,163 |    10,157 
----------------------+----------------------+----------
                Total |     5,652     51,307 |    56,959 
pre_drugreaction_serious
  10,760
  10,633
  121
(46,199 missing values generated)

                      | fail_pre_drugreaction
                      |       _serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,018     21,399 |    26,417 
           sotrovimab |     1,922      8,240 |    10,162 
             paxlovid |     1,926      8,297 |    10,223 
         molnupiravir |     1,894      8,263 |    10,157 
----------------------+----------------------+----------
                Total |    10,760     46,199 |    56,959 
pre_ra_serious
  5,122
  5,053
  65
(51,837 missing values generated)

                      |  fail_pre_ra_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,386     24,031 |    26,417 
           sotrovimab |       910      9,252 |    10,162 
             paxlovid |       934      9,289 |    10,223 
         molnupiravir |       892      9,265 |    10,157 
----------------------+----------------------+----------
                Total |     5,122     51,837 |    56,959 
pre_sle_serious
  5,187
  5,113
  72
(51,772 missing values generated)

                      | fail_pre_sle_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,411     24,006 |    26,417 
           sotrovimab |       905      9,257 |    10,162 
             paxlovid |       943      9,280 |    10,223 
         molnupiravir |       928      9,229 |    10,157 
----------------------+----------------------+----------
                Total |     5,187     51,772 |    56,959 
pre_psorasis_serious
  5,194
  5,121
  71
(51,765 missing values generated)

                      | fail_pre_psorasis_ser
                      |         ious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,390     24,027 |    26,417 
           sotrovimab |       964      9,198 |    10,162 
             paxlovid |       962      9,261 |    10,223 
         molnupiravir |       878      9,279 |    10,157 
----------------------+----------------------+----------
                Total |     5,194     51,765 |    56,959 
pre_psa_serious
  5,153
  5,077
  74
(51,806 missing values generated)

                      | fail_pre_psa_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,428     23,989 |    26,417 
           sotrovimab |       871      9,291 |    10,162 
             paxlovid |       935      9,288 |    10,223 
         molnupiravir |       919      9,238 |    10,157 
----------------------+----------------------+----------
                Total |     5,153     51,806 |    56,959 
pre_axspa_serious
  5,120
  5,064
  53
(51,839 missing values generated)

                      | fail_pre_axspa_seriou
                      |           s
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,364     24,053 |    26,417 
           sotrovimab |       936      9,226 |    10,162 
             paxlovid |       923      9,300 |    10,223 
         molnupiravir |       897      9,260 |    10,157 
----------------------+----------------------+----------
                Total |     5,120     51,839 |    56,959 
pre_ibd_serious
  5,153
  5,081
  68
(51,806 missing values generated)

                      | fail_pre_ibd_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,402     24,015 |    26,417 
           sotrovimab |       942      9,220 |    10,162 
             paxlovid |       889      9,334 |    10,223 
         molnupiravir |       920      9,237 |    10,157 
----------------------+----------------------+----------
                Total |     5,153     51,806 |    56,959 
pre_all
  56,959
  56,959
  0

                      | fail_pre_a
                      |     ll
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,417 |    26,417 
           sotrovimab |    10,162 |    10,162 
             paxlovid |    10,223 |    10,223 
         molnupiravir |    10,157 |    10,157 
----------------------+-----------+----------
                Total |    56,959 |    56,959 
pre_all_serious
  56,952
  56,952
  0
(7 missing values generated)

                      | fail_pre_all_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    26,414          3 |    26,417 
           sotrovimab |    10,160          2 |    10,162 
             paxlovid |    10,223          0 |    10,223 
         molnupiravir |    10,155          2 |    10,157 
----------------------+----------------------+----------
                Total |    56,952          7 |    56,959 
pre_spc_all
  55,032
  53,840
  1,104
(1,927 missing values generated)

                      |   fail_pre_spc_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    25,566        851 |    26,417 
           sotrovimab |     9,824        338 |    10,162 
             paxlovid |     9,861        362 |    10,223 
         molnupiravir |     9,781        376 |    10,157 
----------------------+----------------------+----------
                Total |    55,032      1,927 |    56,959 
pre_spc_serious
  39,180
  38,558
  582
(17,779 missing values generated)

                      | fail_pre_spc_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    18,244      8,173 |    26,417 
           sotrovimab |     7,003      3,159 |    10,162 
             paxlovid |     7,025      3,198 |    10,223 
         molnupiravir |     6,908      3,249 |    10,157 
----------------------+----------------------+----------
                Total |    39,180     17,779 |    56,959 
pre_drug_all
  34,868
  34,467
  377
(22,091 missing values generated)

                      |   fail_pre_drug_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    16,224     10,193 |    26,417 
           sotrovimab |     6,247      3,915 |    10,162 
             paxlovid |     6,206      4,017 |    10,223 
         molnupiravir |     6,191      3,966 |    10,157 
----------------------+----------------------+----------
                Total |    34,868     22,091 |    56,959 
pre_drug_serious
  15,332
  15,125
  197
(41,627 missing values generated)

                      | fail_pre_drug_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,125     19,292 |    26,417 
           sotrovimab |     2,751      7,411 |    10,162 
             paxlovid |     2,761      7,462 |    10,223 
         molnupiravir |     2,695      7,462 |    10,157 
----------------------+----------------------+----------
                Total |    15,332     41,627 |    56,959 
pre_imae_all
  46,513
  45,811
  668
(10,446 missing values generated)

                      |   fail_pre_imae_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    21,530      4,887 |    26,417 
           sotrovimab |     8,360      1,802 |    10,162 
             paxlovid |     8,388      1,835 |    10,223 
         molnupiravir |     8,235      1,922 |    10,157 
----------------------+----------------------+----------
                Total |    46,513     10,446 |    56,959 
pre_imae_serious
  24,789
  24,403
  373
(32,170 missing values generated)

                      | fail_pre_imae_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    11,470     14,947 |    26,417 
           sotrovimab |     4,457      5,705 |    10,162 
             paxlovid |     4,477      5,746 |    10,223 
         molnupiravir |     4,385      5,772 |    10,157 
----------------------+----------------------+----------
                Total |    24,789     32,170 |    56,959 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 replace `x'=`x'+0.75 if `x'==start_comparator
  4. }
pre_diverticulitis
(3 real changes made)
pre_diarrhoea
(3 real changes made)
pre_taste
(5 real changes made)
pre_rash
(7 real changes made)
pre_bronchospasm
(3 real changes made)
pre_contactderm
(6 real changes made)
pre_dizziness
(4 real changes made)
pre_nausea_vomit
(9 real changes made)
pre_headache
(9 real changes made)
pre_anaphylaxis
(5 real changes made)
pre_drugreaction
(6 real changes made)
pre_ra
(1 real change made)
pre_sle
(5 real changes made)
pre_psorasis
(3 real changes made)
pre_psa
(4 real changes made)
pre_axspa
(2 real changes made)
pre_ibd
(4 real changes made)
pre_diverticulitis_serious
(2 real changes made)
pre_diarrhoea_serious
(2 real changes made)
pre_taste_serious
(2 real changes made)
pre_rash_serious
(4 real changes made)
pre_contactderm_serious
(6 real changes made)
pre_dizziness_serious
(2 real changes made)
pre_nausea_vomit_serious
(3 real changes made)
pre_headache_serious
(3 real changes made)
pre_anaphylaxis_serious
(3 real changes made)
pre_drugreaction_serious
(2 real changes made)
pre_ra_serious
(1 real change made)
pre_sle_serious
(0 real changes made)
pre_psorasis_serious
(1 real change made)
pre_psa_serious
(1 real change made)
pre_axspa_serious
(1 real change made)
pre_ibd_serious
(2 real changes made)
pre_all
(0 real changes made)
pre_all_serious
(0 real changes made)
pre_spc_all
(48 real changes made)
pre_spc_serious
(21 real changes made)
pre_drug_all
(10 real changes made)
pre_drug_serious
(5 real changes made)
pre_imae_all
(16 real changes made)
pre_imae_serious
(5 real changes made)

. 
. *Generate censor date
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 gen stop_`x'=`x' if fail_`x'==1
  3.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
  4.                 tab drug fail_`x' if stop_`x'!=.
  5.                 format %td stop_`x'
  6. }
(41,471 missing values generated)
(37,348 real changes made)

                      | fail_pre_d
                      | iverticuli
                      |    tis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,183 |     7,183 
           sotrovimab |     2,763 |     2,763 
             paxlovid |     2,794 |     2,794 
         molnupiravir |     2,748 |     2,748 
----------------------+-----------+----------
                Total |    15,488 |    15,488 
(41,456 missing values generated)
(37,370 real changes made)

                      | fail_pre_d
                      |  iarrhoea
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,144 |     7,144 
           sotrovimab |     2,799 |     2,799 
             paxlovid |     2,749 |     2,749 
         molnupiravir |     2,811 |     2,811 
----------------------+-----------+----------
                Total |    15,503 |    15,503 
(46,212 missing values generated)
(41,617 real changes made)

                      | fail_pre_t
                      |    aste
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,037 |     5,037 
           sotrovimab |     1,909 |     1,909 
             paxlovid |     1,890 |     1,890 
         molnupiravir |     1,911 |     1,911 
----------------------+-----------+----------
                Total |    10,747 |    10,747 
(41,443 missing values generated)
(37,335 real changes made)

                      | fail_pre_r
                      |    ash
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,227 |     7,227 
           sotrovimab |     2,739 |     2,739 
             paxlovid |     2,806 |     2,806 
         molnupiravir |     2,744 |     2,744 
----------------------+-----------+----------
                Total |    15,516 |    15,516 
(51,260 missing values generated)
(46,164 real changes made)

                      | fail_pre_b
                      | ronchospas
                      |     m
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,655 |     2,655 
           sotrovimab |     1,032 |     1,032 
             paxlovid |     1,016 |     1,016 
         molnupiravir |       996 |       996 
----------------------+-----------+----------
                Total |     5,699 |     5,699 
(41,460 missing values generated)
(37,379 real changes made)

                      | fail_pre_c
                      | ontactderm
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,167 |     7,167 
           sotrovimab |     2,741 |     2,741 
             paxlovid |     2,826 |     2,826 
         molnupiravir |     2,765 |     2,765 
----------------------+-----------+----------
                Total |    15,499 |    15,499 
(41,418 missing values generated)
(37,332 real changes made)

                      | fail_pre_d
                      |  izziness
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,198 |     7,198 
           sotrovimab |     2,865 |     2,865 
             paxlovid |     2,775 |     2,775 
         molnupiravir |     2,703 |     2,703 
----------------------+-----------+----------
                Total |    15,541 |    15,541 
(46,080 missing values generated)
(41,534 real changes made)

                      | fail_pre_n
                      | ausea_vomi
                      |     t
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,038 |     5,038 
           sotrovimab |     1,901 |     1,901 
             paxlovid |     1,960 |     1,960 
         molnupiravir |     1,980 |     1,980 
----------------------+-----------+----------
                Total |    10,879 |    10,879 
(41,387 missing values generated)
(37,317 real changes made)

                      | fail_pre_h
                      |  eadache
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,257 |     7,257 
           sotrovimab |     2,719 |     2,719 
             paxlovid |     2,765 |     2,765 
         molnupiravir |     2,831 |     2,831 
----------------------+-----------+----------
                Total |    15,572 |    15,572 
(41,445 missing values generated)
(37,399 real changes made)

                      | fail_pre_a
                      | naphylaxis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,215 |     7,215 
           sotrovimab |     2,787 |     2,787 
             paxlovid |     2,756 |     2,756 
         molnupiravir |     2,756 |     2,756 
----------------------+-----------+----------
                Total |    15,514 |    15,514 
(30,348 missing values generated)
(27,386 real changes made)

                      | fail_pre_d
                      | rugreactio
                      |     n
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    12,365 |    12,365 
           sotrovimab |     4,781 |     4,781 
             paxlovid |     4,751 |     4,751 
         molnupiravir |     4,714 |     4,714 
----------------------+-----------+----------
                Total |    26,611 |    26,611 
(42,966 missing values generated)
(38,749 real changes made)

                      | fail_pre_r
                      |     a
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,507 |     6,507 
           sotrovimab |     2,426 |     2,426 
             paxlovid |     2,536 |     2,536 
         molnupiravir |     2,524 |     2,524 
----------------------+-----------+----------
                Total |    13,993 |    13,993 
(43,057 missing values generated)
(38,762 real changes made)

                      | fail_pre_s
                      |     le
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,420 |     6,420 
           sotrovimab |     2,465 |     2,465 
             paxlovid |     2,543 |     2,543 
         molnupiravir |     2,474 |     2,474 
----------------------+-----------+----------
                Total |    13,902 |    13,902 
(42,934 missing values generated)
(38,677 real changes made)

                      | fail_pre_p
                      |  sorasis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,497 |     6,497 
           sotrovimab |     2,553 |     2,553 
             paxlovid |     2,552 |     2,552 
         molnupiravir |     2,423 |     2,423 
----------------------+-----------+----------
                Total |    14,025 |    14,025 
(43,060 missing values generated)
(38,823 real changes made)

                      | fail_pre_p
                      |     sa
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,517 |     6,517 
           sotrovimab |     2,463 |     2,463 
             paxlovid |     2,495 |     2,495 
         molnupiravir |     2,424 |     2,424 
----------------------+-----------+----------
                Total |    13,899 |    13,899 
(43,038 missing values generated)
(38,745 real changes made)

                      | fail_pre_a
                      |    xspa
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,426 |     6,426 
           sotrovimab |     2,462 |     2,462 
             paxlovid |     2,563 |     2,563 
         molnupiravir |     2,470 |     2,470 
----------------------+-----------+----------
                Total |    13,921 |    13,921 
(43,040 missing values generated)
(38,803 real changes made)

                      | fail_pre_i
                      |     bd
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,511 |     6,511 
           sotrovimab |     2,436 |     2,436 
             paxlovid |     2,498 |     2,498 
         molnupiravir |     2,474 |     2,474 
----------------------+-----------+----------
                Total |    13,919 |    13,919 
(51,225 missing values generated)
(46,143 real changes made)

                      | fail_pre_d
                      | iverticuli
                      | tis_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,699 |     2,699 
           sotrovimab |       988 |       988 
             paxlovid |     1,050 |     1,050 
         molnupiravir |       997 |       997 
----------------------+-----------+----------
                Total |     5,734 |     5,734 
(46,087 missing values generated)
(41,498 real changes made)

                      | fail_pre_d
                      | iarrhoea_s
                      |   erious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,038 |     5,038 
           sotrovimab |     1,938 |     1,938 
             paxlovid |     1,923 |     1,923 
         molnupiravir |     1,973 |     1,973 
----------------------+-----------+----------
                Total |    10,872 |    10,872 
(51,335 missing values generated)
(46,221 real changes made)

                      | fail_pre_t
                      | aste_serio
                      |     us
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,650 |     2,650 
           sotrovimab |     1,002 |     1,002 
             paxlovid |       969 |       969 
         molnupiravir |     1,003 |     1,003 
----------------------+-----------+----------
                Total |     5,624 |     5,624 
(51,249 missing values generated)
(46,189 real changes made)

                      | fail_pre_r
                      | ash_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,639 |     2,639 
           sotrovimab |     1,031 |     1,031 
             paxlovid |     1,030 |     1,030 
         molnupiravir |     1,010 |     1,010 
----------------------+-----------+----------
                Total |     5,710 |     5,710 
(41,460 missing values generated)
(37,379 real changes made)

                      | fail_pre_c
                      | ontactderm
                      |  _serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,167 |     7,167 
           sotrovimab |     2,741 |     2,741 
             paxlovid |     2,826 |     2,826 
         molnupiravir |     2,765 |     2,765 
----------------------+-----------+----------
                Total |    15,499 |    15,499 
(51,247 missing values generated)
(46,185 real changes made)

                      | fail_pre_d
                      | izziness_s
                      |   erious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,633 |     2,633 
           sotrovimab |     1,046 |     1,046 
             paxlovid |     1,044 |     1,044 
         molnupiravir |       989 |       989 
----------------------+-----------+----------
                Total |     5,712 |     5,712 
(51,168 missing values generated)
(46,111 real changes made)

                      | fail_pre_n
                      | ausea_vomi
                      | t_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,712 |     2,712 
           sotrovimab |     1,015 |     1,015 
             paxlovid |     1,027 |     1,027 
         molnupiravir |     1,037 |     1,037 
----------------------+-----------+----------
                Total |     5,791 |     5,791 
(51,206 missing values generated)
(46,173 real changes made)

                      | fail_pre_h
                      | eadache_se
                      |   rious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,706 |     2,706 
           sotrovimab |     1,008 |     1,008 
             paxlovid |     1,034 |     1,034 
         molnupiravir |     1,005 |     1,005 
----------------------+-----------+----------
                Total |     5,753 |     5,753 
(51,307 missing values generated)
(46,265 real changes made)

                      | fail_pre_a
                      | naphylaxis
                      |  _serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,598 |     2,598 
           sotrovimab |     1,023 |     1,023 
             paxlovid |     1,037 |     1,037 
         molnupiravir |       994 |       994 
----------------------+-----------+----------
                Total |     5,652 |     5,652 
(46,199 missing values generated)
(41,669 real changes made)

                      | fail_pre_d
                      | rugreactio
                      | n_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,018 |     5,018 
           sotrovimab |     1,922 |     1,922 
             paxlovid |     1,926 |     1,926 
         molnupiravir |     1,894 |     1,894 
----------------------+-----------+----------
                Total |    10,760 |    10,760 
(51,837 missing values generated)
(46,706 real changes made)

                      | fail_pre_r
                      | a_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,386 |     2,386 
           sotrovimab |       910 |       910 
             paxlovid |       934 |       934 
         molnupiravir |       892 |       892 
----------------------+-----------+----------
                Total |     5,122 |     5,122 
(51,772 missing values generated)
(46,621 real changes made)

                      | fail_pre_s
                      | le_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,411 |     2,411 
           sotrovimab |       905 |       905 
             paxlovid |       943 |       943 
         molnupiravir |       928 |       928 
----------------------+-----------+----------
                Total |     5,187 |     5,187 
(51,765 missing values generated)
(46,639 real changes made)

                      | fail_pre_p
                      | sorasis_se
                      |   rious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,390 |     2,390 
           sotrovimab |       964 |       964 
             paxlovid |       962 |       962 
         molnupiravir |       878 |       878 
----------------------+-----------+----------
                Total |     5,194 |     5,194 
(51,806 missing values generated)
(46,665 real changes made)

                      | fail_pre_p
                      | sa_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,428 |     2,428 
           sotrovimab |       871 |       871 
             paxlovid |       935 |       935 
         molnupiravir |       919 |       919 
----------------------+-----------+----------
                Total |     5,153 |     5,153 
(51,839 missing values generated)
(46,717 real changes made)

                      | fail_pre_a
                      | xspa_serio
                      |     us
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,364 |     2,364 
           sotrovimab |       936 |       936 
             paxlovid |       923 |       923 
         molnupiravir |       897 |       897 
----------------------+-----------+----------
                Total |     5,120 |     5,120 
(51,806 missing values generated)
(46,702 real changes made)

                      | fail_pre_i
                      | bd_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,402 |     2,402 
           sotrovimab |       942 |       942 
             paxlovid |       889 |       889 
         molnupiravir |       920 |       920 
----------------------+-----------+----------
                Total |     5,153 |     5,153 
(0 real changes made)

                      | fail_pre_a
                      |     ll
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,417 |    26,417 
           sotrovimab |    10,162 |    10,162 
             paxlovid |    10,223 |    10,223 
         molnupiravir |    10,157 |    10,157 
----------------------+-----------+----------
                Total |    56,959 |    56,959 
(7 missing values generated)
(5 real changes made)

                      | fail_pre_a
                      | ll_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,414 |    26,414 
           sotrovimab |    10,160 |    10,160 
             paxlovid |    10,223 |    10,223 
         molnupiravir |    10,155 |    10,155 
----------------------+-----------+----------
                Total |    56,952 |    56,952 
(1,927 missing values generated)
(1,762 real changes made)

                      | fail_pre_s
                      |   pc_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    25,566 |    25,566 
           sotrovimab |     9,824 |     9,824 
             paxlovid |     9,861 |     9,861 
         molnupiravir |     9,781 |     9,781 
----------------------+-----------+----------
                Total |    55,032 |    55,032 
(17,779 missing values generated)
(16,044 real changes made)

                      | fail_pre_s
                      | pc_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    18,244 |    18,244 
           sotrovimab |     7,003 |     7,003 
             paxlovid |     7,025 |     7,025 
         molnupiravir |     6,908 |     6,908 
----------------------+-----------+----------
                Total |    39,180 |    39,180 
(22,091 missing values generated)
(19,952 real changes made)

                      | fail_pre_d
                      |  rug_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    16,224 |    16,224 
           sotrovimab |     6,247 |     6,247 
             paxlovid |     6,206 |     6,206 
         molnupiravir |     6,191 |     6,191 
----------------------+-----------+----------
                Total |    34,868 |    34,868 
(41,627 missing values generated)
(37,575 real changes made)

                      | fail_pre_d
                      | rug_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,125 |     7,125 
           sotrovimab |     2,751 |     2,751 
             paxlovid |     2,761 |     2,761 
         molnupiravir |     2,695 |     2,695 
----------------------+-----------+----------
                Total |    15,332 |    15,332 
(10,446 missing values generated)
(9,424 real changes made)

                      | fail_pre_i
                      |  mae_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    21,530 |    21,530 
           sotrovimab |     8,360 |     8,360 
             paxlovid |     8,388 |     8,388 
         molnupiravir |     8,235 |     8,235 
----------------------+-----------+----------
                Total |    46,513 |    46,513 
(32,170 missing values generated)
(29,014 real changes made)

                      | fail_pre_i
                      | mae_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    11,470 |    11,470 
           sotrovimab |     4,457 |     4,457 
             paxlovid |     4,477 |     4,477 
         molnupiravir |     4,385 |     4,385 
----------------------+-----------+----------
                Total |    24,789 |    24,789 

. 
. * Follow-up time
. foreach x in $pre_ae_combined{
  2.                 stset stop_`x', id(patient_id) origin(time start_comparato
> r) enter(time start_comparator) exit(time start_comparator_28) failure(fail_`
> x'==1) 
  3.                 tab _st  
  4.                 tab _t drug if fail_`x'==1 & stop_`x'==`x'
  5.                 count if start_comparator>=stop_`x' & _st==0
  6.                 count if start_comparator==stop_`x' & _st==0
  7. }

                id:  patient_id
     failure event:  fail_pre_all == 1
obs. time interval:  (stop_pre_all[_n-1], stop_pre_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,642  ignored because never entered
------------------------------------------------------------------------------
     51,317  observations remaining, representing
     51,317  subjects
          0  failures in single-failure-per-subject data
  1,488,193  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,642        9.91        9.91
          1 |     51,317       90.09      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    23,823      9,161      9,176      9,157 |    51,317 
-----------+--------------------------------------------+----------
     Total |    23,823      9,161      9,176      9,157 |    51,317 
  5,642
  0

                id:  patient_id
     failure event:  fail_pre_all_serious == 1
obs. time interval:  (stop_pre_all_serious[_n-1], stop_pre_all_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
          2  event time missing (stop_pre_all_serious>=.)       PROBABLE ERROR
      5,640  ignored because never entered
------------------------------------------------------------------------------
     51,317  observations remaining, representing
     51,317  subjects
          0  failures in single-failure-per-subject data
  1,488,193  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,642        9.91        9.91
          1 |     51,317       90.09      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    23,822      9,159      9,176      9,155 |    51,312 
-----------+--------------------------------------------+----------
     Total |    23,822      9,159      9,176      9,155 |    51,312 
  5,642
  2

                id:  patient_id
     failure event:  fail_pre_spc_all == 1
obs. time interval:  (stop_pre_spc_all[_n-1], stop_pre_spc_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
        165  event time missing (stop_pre_spc_all>=.)           PROBABLE ERROR
      5,477  ignored because never entered
     15,523  observations end on or before enter()
------------------------------------------------------------------------------
     35,794  observations remaining, representing
     35,794  subjects
      1,192  failures in single-failure-per-subject data
  1,020,690  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,165       37.16       37.16
          1 |     35,794       62.84      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        15         10         11         12 |        48 
         1 |        20          3          6          4 |        33 
         2 |        16          2         10          8 |        36 
         3 |        21          8         12          6 |        47 
         4 |        19          9          5          6 |        39 
         5 |        18         10          4         13 |        45 
         6 |        29          8          5          6 |        48 
         7 |        14          6          8          4 |        32 
         8 |        19          4         11          9 |        43 
         9 |        22          7          6         13 |        48 
        10 |        18          4          4          8 |        34 
        11 |        11          9          5          2 |        27 
        12 |        22          9         10          9 |        50 
        13 |        21          8          3          8 |        40 
        14 |        18          3          7          9 |        37 
        15 |        22          8          8          5 |        43 
        16 |        20          3          6          0 |        29 
        17 |        19         11          2          6 |        38 
        18 |        11          7          5         11 |        34 
        19 |        21          3          9          3 |        36 
        20 |        18          2          6         10 |        36 
        21 |        19          7          3         12 |        41 
        22 |        20          9         11         10 |        50 
        23 |        16          6          5          6 |        33 
        24 |        12          7          3         12 |        34 
        25 |        21          5          7          8 |        41 
        26 |        19          7          7          4 |        37 
        27 |        32          6          8          6 |        52 
        28 |        22          5          8          6 |        41 
        29 |    15,349      5,914      5,849      5,768 |    32,880 
-----------+--------------------------------------------+----------
     Total |    15,904      6,100      6,044      5,984 |    34,032 
  21,165
  165

                id:  patient_id
     failure event:  fail_pre_spc_serious == 1
obs. time interval:  (stop_pre_spc_serious[_n-1], stop_pre_spc_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      1,735  event time missing (stop_pre_spc_serious>=.)       PROBABLE ERROR
      3,907  ignored because never entered
      7,448  observations end on or before enter()
------------------------------------------------------------------------------
     43,869  observations remaining, representing
     43,869  subjects
        622  failures in single-failure-per-subject data
  1,263,438  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,090       22.98       22.98
          1 |     43,869       77.02      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         5          7          3          6 |        21 
         1 |         5          2          6          3 |        16 
         2 |         7          1          4          9 |        21 
         3 |         8          5          2          3 |        18 
         4 |        13          3          0          3 |        19 
         5 |        14          2          1          8 |        25 
         6 |        17          3          2          1 |        23 
         7 |         3          4          2          3 |        12 
         8 |        11          3          5          5 |        24 
         9 |        10          3          2          6 |        21 
        10 |         8          2          2          5 |        17 
        11 |         9          4          3          1 |        17 
        12 |        13          2          8          5 |        28 
        13 |        12          4          1          2 |        19 
        14 |        14          1          4          2 |        21 
        15 |        11          5          4          4 |        24 
        16 |        11          4          2          1 |        18 
        17 |         8          6          1          0 |        15 
        18 |        10          1          4          6 |        21 
        19 |         9          0          9          1 |        19 
        20 |         6          1          3          6 |        16 
        21 |        15          8          1          7 |        31 
        22 |        12          5          6          3 |        26 
        23 |         8          4          3          4 |        19 
        24 |         6          6          1          4 |        17 
        25 |        10          6          3          4 |        23 
        26 |         7          1          5          5 |        18 
        27 |        15          3          6          3 |        27 
        28 |        14          4          6          3 |        27 
        29 |    12,707      4,870      4,876      4,769 |    27,222 
-----------+--------------------------------------------+----------
     Total |    12,998      4,970      4,975      4,882 |    27,825 
  13,090
  1,735

                id:  patient_id
     failure event:  fail_pre_drug_all == 1
obs. time interval:  (stop_pre_drug_all[_n-1], stop_pre_drug_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      2,139  event time missing (stop_pre_drug_all>=.)          PROBABLE ERROR
      3,503  ignored because never entered
      4,663  observations end on or before enter()
------------------------------------------------------------------------------
     46,654  observations remaining, representing
     46,654  subjects
        401  failures in single-failure-per-subject data
  1,347,161  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,305       18.09       18.09
          1 |     46,654       81.91      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         4          0          4          2 |        10 
         1 |        10          2          1          0 |        13 
         2 |         6          0          5          1 |        12 
         3 |         8          2          5          2 |        17 
         4 |         3          4          4          1 |        12 
         5 |         5          5          3          2 |        15 
         6 |        10          2          3          5 |        20 
         7 |         5          1          3          4 |        13 
         8 |         6          3          8          0 |        17 
         9 |         9          3          0          2 |        14 
        10 |         7          0          0          3 |        10 
        11 |         7          4          0          1 |        12 
        12 |         5          2          2          2 |        11 
        13 |         7          2          2          1 |        12 
        14 |         7          2          2          3 |        14 
        15 |         7          2          3          2 |        14 
        16 |         8          1          1          1 |        11 
        17 |         8          3          2          5 |        18 
        18 |         4          2          0          1 |         7 
        19 |        10          1          1          0 |        12 
        20 |         8          3          2          5 |        18 
        21 |         7          0          3          1 |        11 
        22 |         3          2          4          2 |        11 
        23 |         6          2          0          3 |        11 
        24 |         8          1          2          3 |        14 
        25 |         8          2          1          1 |        12 
        26 |         8          4          2          0 |        14 
        27 |        12          3          0          3 |        18 
        28 |         7          4          2          1 |        14 
        29 |    12,323      4,701      4,633      4,658 |    26,315 
-----------+--------------------------------------------+----------
     Total |    12,526      4,763      4,698      4,715 |    26,702 
  10,305
  2,139

                id:  patient_id
     failure event:  fail_pre_drug_serious == 1
obs. time interval:  (stop_pre_drug_serious[_n-1], stop_pre_drug_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,052  event time missing (stop_pre_drug_serious>=.)      PROBABLE ERROR
      1,590  ignored because never entered
      2,410  observations end on or before enter()
------------------------------------------------------------------------------
     48,907  observations remaining, representing
     48,907  subjects
        207  failures in single-failure-per-subject data
  1,415,341  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,052       14.14       14.14
          1 |     48,907       85.86      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         2          0          3          0 |         5 
         1 |         7          2          0          0 |         9 
         2 |         3          0          2          0 |         5 
         3 |         3          2          3          1 |         9 
         4 |         2          0          2          1 |         5 
         5 |         2          4          1          1 |         8 
         6 |         7          1          0          0 |         8 
         7 |         4          0          1          1 |         6 
         8 |         1          3          7          1 |        12 
         9 |         3          1          0          1 |         5 
        10 |         2          0          0          2 |         4 
        11 |         2          3          0          0 |         5 
        12 |         4          2          0          1 |         7 
        13 |         2          1          1          0 |         4 
        14 |         4          1          1          3 |         9 
        15 |         4          0          2          1 |         7 
        16 |         4          1          0          0 |         5 
        17 |         5          1          1          3 |        10 
        18 |         2          0          0          0 |         2 
        19 |         5          1          0          0 |         6 
        20 |         5          0          1          5 |        11 
        21 |         4          0          3          1 |         8 
        22 |         2          2          4          2 |        10 
        23 |         3          0          0          2 |         5 
        24 |         4          0          1          1 |         6 
        25 |         1          0          0          1 |         2 
        26 |         6          4          2          0 |        12 
        27 |         9          1          0          2 |        12 
        28 |         2          2          1          0 |         5 
        29 |     5,198      1,991      1,987      1,954 |    11,130 
-----------+--------------------------------------------+----------
     Total |     5,302      2,023      2,023      1,984 |    11,332 
  8,052
  4,052

                id:  patient_id
     failure event:  fail_pre_imae_all == 1
obs. time interval:  (stop_pre_imae_all[_n-1], stop_pre_imae_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      1,022  event time missing (stop_pre_imae_all>=.)          PROBABLE ERROR
      4,620  ignored because never entered
      7,984  observations end on or before enter()
------------------------------------------------------------------------------
     43,333  observations remaining, representing
     43,333  subjects
        702  failures in single-failure-per-subject data
  1,246,678  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,626       23.92       23.92
          1 |     43,333       76.08      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         8          3          4          1 |        16 
         1 |         9          5          3          4 |        21 
         2 |         9          6          5          4 |        24 
         3 |        12          2          3          1 |        18 
         4 |         9          3          6          4 |        22 
         5 |        15          3          5          5 |        28 
         6 |        12          3          5          3 |        23 
         7 |        10          2          3          7 |        22 
         8 |        11          5          4          7 |        27 
         9 |         6          1          7          3 |        17 
        10 |        12          3          1          5 |        21 
        11 |        12          2          5          7 |        26 
        12 |        13          3          7          6 |        29 
        13 |        13          2          3          9 |        27 
        14 |         7          6          2          6 |        21 
        15 |         7          9          3          4 |        23 
        16 |        12          9          2          5 |        28 
        17 |         9          5          2          8 |        24 
        18 |        16          2          4          4 |        26 
        19 |        14          3          4          5 |        26 
        20 |        10          7          5          2 |        24 
        21 |        11          2          5          4 |        22 
        22 |        13          1          3          5 |        22 
        23 |        10          4          2          4 |        20 
        24 |        13          4         11          2 |        30 
        25 |        14          3          4          4 |        25 
        26 |         7          6          7          0 |        20 
        27 |        12          7          3          4 |        26 
        28 |        12          6          4          4 |        26 
        29 |    15,386      5,982      5,939      5,918 |    33,225 
-----------+--------------------------------------------+----------
     Total |    15,704      6,099      6,061      6,045 |    33,909 
  13,626
  1,022

                id:  patient_id
     failure event:  fail_pre_imae_serious == 1
obs. time interval:  (stop_pre_imae_serious[_n-1], stop_pre_imae_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      3,156  event time missing (stop_pre_imae_serious>=.)      PROBABLE ERROR
      2,486  ignored because never entered
      4,215  observations end on or before enter()
------------------------------------------------------------------------------
     47,102  observations remaining, representing
     47,102  subjects
        386  failures in single-failure-per-subject data
  1,360,405  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,857       17.31       17.31
          1 |     47,102       82.69      100.00
------------+-----------------------------------
      Total |     56,959      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         2          1          1          1 |         5 
         1 |         5          3          3          2 |        13 
         2 |         3          3          4          5 |        15 
         3 |         5          2          1          1 |         9 
         4 |         7          1          1          2 |        11 
         5 |         9          2          2          1 |        14 
         6 |         3          2          4          2 |        11 
         7 |         3          1          1          5 |        10 
         8 |         9          3          2          5 |        19 
         9 |         5          1          3          2 |        11 
        10 |         7          1          1          3 |        12 
        11 |         8          1          0          3 |        12 
        12 |         5          2          6          2 |        15 
        13 |         9          2          1          6 |        18 
        14 |         4          4          1          2 |        11 
        15 |         4          6          2          2 |        14 
        16 |         7          7          1          3 |        18 
        17 |         5          3          1          6 |        15 
        18 |        13          3          1          3 |        20 
        19 |         9          1          2          5 |        17 
        20 |         6          3          4          1 |        14 
        21 |         4          2          3          3 |        12 
        22 |         6          1          3          2 |        12 
        23 |         6          1          1          2 |        10 
        24 |         4          3          6          1 |        14 
        25 |         9          2          1          4 |        16 
        26 |         3          2          2          0 |         7 
        27 |         4          3          2          1 |        10 
        28 |         5          4          2          2 |        13 
        29 |     8,190      3,190      3,190      3,140 |    17,710 
-----------+--------------------------------------------+----------
     Total |     8,359      3,260      3,252      3,217 |    18,088 
  9,857
  3,156

. 
. ********************************************************
. *       RATES OF EVENTS         *
. ********************************************************
. tempname comparator_rates

. postfile `comparator_rates' str20(failure) ///
>                 all_ptime all_events all_rate all_lci all_uci ///
>                 control_ptime control_events control_rate control_lci_ contro
> l_uci ///
>                 sot_ptime sot_events sot_rate sot_lci sot_uci ///
>                 pax_ptime pax_events pax_rate pax_lci pax_uci ///
>                 mol_ptime mol_events mol_rate mol_lci mol_uci ///
>                 using "$projectdir/output/tables/comparator_rates", replace  
>    

.         
. foreach fail in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.         stset stop_`fail', id(patient_id) origin(time start_comparator) en
> ter(time start_comparator) exit(time start_comparator_28) failure(fail_`fail'
> ==1)                     
  3.                 stptime 
  4.                                         local all_rate = `r(rate)'
  5.                                         local all_ptime = `r(ptime)'
  6.                                         local all_lci = `r(lb)'
  7.                                         local all_uci = `r(ub)'
  8.                                         local all_events = `r(failures)'  
>                                       
  9.                 stptime if drug == 0
 10.                                         local control_rate = `r(rate)'
 11.                                         local control_ptime = `r(ptime)'
 12.                                         local control_lci = `r(lb)'
 13.                                         local control_uci = `r(ub)'
 14.                                         local control_events = `r(failures
> )'
 15.                 display "no drug"
 16.                 stptime if drug == 1
 17.                                         local sot_rate = `r(rate)'
 18.                                         local sot_ptime = `r(ptime)'
 19.                                         local sot_lci = `r(lb)'
 20.                                         local sot_uci = `r(ub)'
 21.                                         local sot_events = `r(failures)'
 22.                 display "sotrovimab"
 23.                 stptime if drug == 2
 24.                                         local pax_rate = `r(rate)'
 25.                                         local pax_ptime = `r(ptime)'
 26.                                         local pax_lci = `r(lb)'
 27.                                         local pax_uci = `r(ub)'
 28.                                         local pax_events = `r(failures)'  
>               
 29.                 display "paxlovid"
 30.                 stptime if drug == 3
 31.                                         local mol_rate = `r(rate)'
 32.                                         local mol_ptime = `r(ptime)'
 33.                                         local mol_lci = `r(lb)'
 34.                                         local mol_uci = `r(ub)'
 35.                                         local mol_events = `r(failures)'  
>               
 36.                 display "molnupavir"                    
 37.                 post `comparator_rates' ("`fail'")      (`all_ptime') (`al
> l_events') (`all_rate') (`all_lci') (`all_uci') ///
>                                         (`control_ptime') (`control_events') 
> (`control_rate') (`control_lci') (`control_uci') ///
>                                         (`sot_ptime') (`sot_events') (`sot_ra
> te') (`sot_lci') (`sot_uci') ///
>                                         (`pax_ptime') (`pax_events') (`pax_ra
> te') (`pax_lci') (`pax_uci') ///
>                                         (`mol_ptime') (`mol_events') (`mol_ra
> te') (`mol_lci') (`mol_uci')       
 38.                                         
. }

                id:  patient_id
     failure event:  fail_pre_diverticulitis == 1
obs. time interval:  (stop_pre_diverticulitis[_n-1], stop_pre_diverticulitis]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,123  event time missing (stop_pre_diverticulitis>=.)    PROBABLE ERROR
      1,519  ignored because never entered
      1,584  observations end on or before enter()
------------------------------------------------------------------------------
     49,733  observations remaining, representing
     49,733  subjects
        162  failures in single-failure-per-subject data
  1,439,989  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1439989.3        162    .0001125   .0000964    .0001312

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     668684.5         75   .00011216   .0000894    .0001406
no drug

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       256164         29   .00011321   .0000787    .0001629
sotrovimab

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257540.75         27   .00010484   .0000719    .0001529
paxlovid

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257600         31   .00012034   .0000846    .0001711
molnupavir

                id:  patient_id
     failure event:  fail_pre_diarrhoea == 1
obs. time interval:  (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,086  event time missing (stop_pre_diarrhoea>=.)         PROBABLE ERROR
      1,556  ignored because never entered
      2,402  observations end on or before enter()
------------------------------------------------------------------------------
     48,915  observations remaining, representing
     48,915  subjects
        186  failures in single-failure-per-subject data
  1,415,928  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1415928.3        186   .00013136   .0001138    .0001517

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    657704.75         90   .00013684   .0001113    .0001682
no drug

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    252707.75         36   .00014246   .0001028    .0001975
sotrovimab

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       252939         30   .00011861   .0000829    .0001696
paxlovid

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    252576.75         30   .00011878    .000083    .0001699
molnupavir

                id:  patient_id
     failure event:  fail_pre_taste == 1
obs. time interval:  (stop_pre_taste[_n-1], stop_pre_taste]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,595  event time missing (stop_pre_taste>=.)             PROBABLE ERROR
      1,047  ignored because never entered
      1,595  observations end on or before enter()
------------------------------------------------------------------------------
     49,722  observations remaining, representing
     49,722  subjects
        123  failures in single-failure-per-subject data
  1,440,163  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1440162.8        123   .00008541   .0000716    .0001019

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     668489.5         56   .00008377   .0000645    .0001089
no drug

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257394.75         18   .00006993   .0000441     .000111
sotrovimab

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257167         20   .00007777   .0000502    .0001205
paxlovid

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     257111.5         29   .00011279   .0000784    .0001623
molnupavir

                id:  patient_id
     failure event:  fail_pre_rash == 1
obs. time interval:  (stop_pre_rash[_n-1], stop_pre_rash]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,108  event time missing (stop_pre_rash>=.)              PROBABLE ERROR
      1,534  ignored because never entered
      1,627  observations end on or before enter()
------------------------------------------------------------------------------
     49,690  observations remaining, representing
     49,690  subjects
        142  failures in single-failure-per-subject data
  1,438,884  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438884.3        142   .00009869   .0000837    .0001163

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    668725.75         67   .00010019   .0000789    .0001273
no drug

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257071.75         25   .00009725   .0000657    .0001439
sotrovimab

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     257229.5         29   .00011274   .0000783    .0001622
paxlovid

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    255857.25         21   .00008208   .0000535    .0001259
molnupavir

                id:  patient_id
     failure event:  fail_pre_bronchospasm == 1
obs. time interval:  (stop_pre_bronchospasm[_n-1], stop_pre_bronchospasm]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,096  event time missing (stop_pre_bronchospasm>=.)      PROBABLE ERROR
        546  ignored because never entered
        840  observations end on or before enter()
------------------------------------------------------------------------------
     50,477  observations remaining, representing
     50,477  subjects
         60  failures in single-failure-per-subject data
  1,462,878  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1462878.3         60   .00004102   .0000318    .0000528

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    679301.75         23   .00003386   .0000225     .000051
no drug

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261092         14   .00005362   .0000318    .0000905
sotrovimab

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261809.75         16   .00006111   .0000374    .0000998
paxlovid

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    260674.75          7   .00002685   .0000128    .0000563
molnupavir

                id:  patient_id
     failure event:  fail_pre_contactderm == 1
obs. time interval:  (stop_pre_contactderm[_n-1], stop_pre_contactderm]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,081  event time missing (stop_pre_contactderm>=.)       PROBABLE ERROR
      1,561  ignored because never entered
      1,640  observations end on or before enter()
------------------------------------------------------------------------------
     49,677  observations remaining, representing
     49,677  subjects
        154  failures in single-failure-per-subject data
  1,438,430  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438429.5        154   .00010706   .0000914    .0001254

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     667582.5         73   .00010935   .0000869    .0001375
no drug

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     256933.5         26   .00010119   .0000689    .0001486
sotrovimab

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257539.75         23   .00008931   .0000593    .0001344
paxlovid

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256373.75         32   .00012482   .0000883    .0001765
molnupavir

                id:  patient_id
     failure event:  fail_pre_dizziness == 1
obs. time interval:  (stop_pre_dizziness[_n-1], stop_pre_dizziness]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,086  event time missing (stop_pre_dizziness>=.)         PROBABLE ERROR
      1,556  ignored because never entered
      1,591  observations end on or before enter()
------------------------------------------------------------------------------
     49,726  observations remaining, representing
     49,726  subjects
        145  failures in single-failure-per-subject data
  1,439,980  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1439980        145    .0001007   .0000856    .0001185

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     668482.5         72   .00010771   .0000855    .0001357
no drug

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257150.75         26   .00010111   .0000688    .0001485
sotrovimab

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257545         19   .00007377   .0000471    .0001157
paxlovid

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256801.75         28   .00010903   .0000753    .0001579
molnupavir

                id:  patient_id
     failure event:  fail_pre_nausea_vomit == 1
obs. time interval:  (stop_pre_nausea_vomit[_n-1], stop_pre_nausea_vomit]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,546  event time missing (stop_pre_nausea_vomit>=.)      PROBABLE ERROR
      1,096  ignored because never entered
      1,573  observations end on or before enter()
------------------------------------------------------------------------------
     49,744  observations remaining, representing
     49,744  subjects
        138  failures in single-failure-per-subject data
  1,440,546  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1440545.8        138    .0000958   .0000811    .0001132

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     669776.5         59   .00008809   .0000683    .0001137
no drug

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257792.25         25   .00009698   .0000655    .0001435
sotrovimab

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257187.75         23   .00008943   .0000594    .0001346
paxlovid

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    255789.25         31   .00012119   .0000852    .0001723
molnupavir

                id:  patient_id
     failure event:  fail_pre_headache == 1
obs. time interval:  (stop_pre_headache[_n-1], stop_pre_headache]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,070  event time missing (stop_pre_headache>=.)          PROBABLE ERROR
      1,572  ignored because never entered
      1,630  observations end on or before enter()
------------------------------------------------------------------------------
     49,687  observations remaining, representing
     49,687  subjects
        153  failures in single-failure-per-subject data
  1,438,774  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438773.8        153   .00010634   .0000908    .0001246

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    667022.25         77   .00011544   .0000923    .0001443
no drug

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257127.25         31   .00012056   .0000848    .0001714
sotrovimab

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     257824.5         18   .00006981    .000044    .0001108
paxlovid

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256799.75         27   .00010514   .0000721    .0001533
molnupavir

                id:  patient_id
     failure event:  fail_pre_anaphylaxis == 1
obs. time interval:  (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,046  event time missing (stop_pre_anaphylaxis>=.)       PROBABLE ERROR
      1,596  ignored because never entered
      1,632  observations end on or before enter()
------------------------------------------------------------------------------
     49,685  observations remaining, representing
     49,685  subjects
        145  failures in single-failure-per-subject data
  1,438,686  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438685.8        145   .00010079   .0000856    .0001186

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     669097.5         75   .00011209   .0000894    .0001406
no drug

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256597.75         25   .00009743   .0000658    .0001442
sotrovimab

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     256207.5         25   .00009758   .0000659    .0001444
paxlovid

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       256783         20   .00007789   .0000502    .0001207
molnupavir

                id:  patient_id
     failure event:  fail_pre_drugreaction == 1
obs. time interval:  (stop_pre_drugreaction[_n-1], stop_pre_drugreaction]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      2,962  event time missing (stop_pre_drugreaction>=.)      PROBABLE ERROR
      2,680  ignored because never entered
      3,161  observations end on or before enter()
------------------------------------------------------------------------------
     48,156  observations remaining, representing
     48,156  subjects
        272  failures in single-failure-per-subject data
  1,392,615  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1392614.5        272   .00019532   .0001734      .00022

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     646846.5        147   .00022726   .0001933    .0002671
no drug

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       248108         44   .00017734    .000132    .0002383
sotrovimab

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     248686.5         42   .00016889   .0001248    .0002285
paxlovid

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     248973.5         39   .00015664   .0001144    .0002144
molnupavir

                id:  patient_id
     failure event:  fail_pre_ra == 1
obs. time interval:  (stop_pre_ra[_n-1], stop_pre_ra]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,217  event time missing (stop_pre_ra>=.)                PROBABLE ERROR
      1,425  ignored because never entered
      1,453  observations end on or before enter()
------------------------------------------------------------------------------
     49,864  observations remaining, representing
     49,864  subjects
        138  failures in single-failure-per-subject data
  1,444,172  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1444171.8        138   .00009556   .0000809    .0001129

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       670758         71   .00010585   .0000839    .0001336
no drug

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257304         23   .00008939   .0000594    .0001345
sotrovimab

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258267.75         14   .00005421   .0000321    .0000915
paxlovid

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257842         30   .00011635   .0000814    .0001664
molnupavir

                id:  patient_id
     failure event:  fail_pre_sle == 1
obs. time interval:  (stop_pre_sle[_n-1], stop_pre_sle]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,295  event time missing (stop_pre_sle>=.)               PROBABLE ERROR
      1,347  ignored because never entered
      1,459  observations end on or before enter()
------------------------------------------------------------------------------
     49,858  observations remaining, representing
     49,858  subjects
        135  failures in single-failure-per-subject data
  1,444,050  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1444049.8        135   .00009349    .000079    .0001107

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    669568.75         55   .00008214   .0000631     .000107
no drug

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258770.75         29   .00011207   .0000779    .0001613
sotrovimab

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     257550.5         30   .00011648   .0000814    .0001666
paxlovid

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258159.75         21   .00008134    .000053    .0001248
molnupavir

                id:  patient_id
     failure event:  fail_pre_psorasis == 1
obs. time interval:  (stop_pre_psorasis[_n-1], stop_pre_psorasis]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,257  event time missing (stop_pre_psorasis>=.)          PROBABLE ERROR
      1,385  ignored because never entered
      1,424  observations end on or before enter()
------------------------------------------------------------------------------
     49,893  observations remaining, representing
     49,893  subjects
        126  failures in single-failure-per-subject data
  1,445,109  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1445109.3        126   .00008719   .0000732    .0001038

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     670567.5         61   .00009097   .0000708    .0001169
no drug

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257945.75         19   .00007366    .000047    .0001155
sotrovimab

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258041         21   .00008138   .0000531    .0001248
paxlovid

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258555         25   .00009669   .0000653    .0001431
molnupavir

                id:  patient_id
     failure event:  fail_pre_psa == 1
obs. time interval:  (stop_pre_psa[_n-1], stop_pre_psa]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,237  event time missing (stop_pre_psa>=.)               PROBABLE ERROR
      1,405  ignored because never entered
      1,439  observations end on or before enter()
------------------------------------------------------------------------------
     49,878  observations remaining, representing
     49,878  subjects
        150  failures in single-failure-per-subject data
  1,444,337  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1444337        150   .00010385   .0000885    .0001219

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    670766.25         63   .00009392   .0000734    .0001202
no drug

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257870         23   .00008919   .0000593    .0001342
sotrovimab

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258072.75         31   .00012012   .0000845    .0001708
paxlovid

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257628         33   .00012809   .0000911    .0001802
molnupavir

                id:  patient_id
     failure event:  fail_pre_axspa == 1
obs. time interval:  (stop_pre_axspa[_n-1], stop_pre_axspa]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,293  event time missing (stop_pre_axspa>=.)             PROBABLE ERROR
      1,349  ignored because never entered
      1,490  observations end on or before enter()
------------------------------------------------------------------------------
     49,827  observations remaining, representing
     49,827  subjects
        126  failures in single-failure-per-subject data
  1,443,129  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1443128.5        126   .00008731   .0000733     .000104

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    669657.75         71   .00010602    .000084    .0001338
no drug

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257705         16   .00006209    .000038    .0001013
sotrovimab

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258365         19   .00007354   .0000469    .0001153
paxlovid

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257400.75         20    .0000777   .0000501    .0001204
molnupavir

                id:  patient_id
     failure event:  fail_pre_ibd == 1
obs. time interval:  (stop_pre_ibd[_n-1], stop_pre_ibd]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,237  event time missing (stop_pre_ibd>=.)               PROBABLE ERROR
      1,405  ignored because never entered
      1,471  observations end on or before enter()
------------------------------------------------------------------------------
     49,846  observations remaining, representing
     49,846  subjects
        138  failures in single-failure-per-subject data
  1,443,521  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1443521        138    .0000956   .0000809     .000113

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    670263.25         60   .00008952   .0000695    .0001153
no drug

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256880.75         28     .000109   .0000753    .0001579
sotrovimab

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258444         32   .00012382   .0000876    .0001751
paxlovid

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257933         18   .00006979    .000044    .0001108
molnupavir

                id:  patient_id
     failure event:  fail_pre_diverticulitis_serious == 1
obs. time interval:  (stop_pre_diverticulitis_serious[_n-1], stop_pre_diverticu
> litis_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,082  event time missing (stop_pre_diverticulitis_serious>=.)PROBABLE ER
> ROR
        560  ignored because never entered
        833  observations end on or before enter()
------------------------------------------------------------------------------
     50,484  observations remaining, representing
     50,484  subjects
         77  failures in single-failure-per-subject data
  1,462,950  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1462949.5         77   .00005263   .0000421    .0000658

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     678778.5         40   .00005893   .0000432    .0000803
no drug

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260864         12     .000046   .0000261     .000081
sotrovimab

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261925         10   .00003818   .0000205     .000071
paxlovid

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261382         15   .00005739   .0000346    .0000952
molnupavir

                id:  patient_id
     failure event:  fail_pre_diarrhoea_serious == 1
obs. time interval:  (stop_pre_diarrhoea_serious[_n-1], stop_pre_diarrhoea_seri
> ous]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,589  event time missing (stop_pre_diarrhoea_serious>=.) PROBABLE ERROR
      1,053  ignored because never entered
      1,604  observations end on or before enter()
------------------------------------------------------------------------------
     49,713  observations remaining, representing
     49,713  subjects
        127  failures in single-failure-per-subject data
  1,440,014  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1440013.5        127   .00008819   .0000741    .0001049

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       669107         62   .00009266   .0000722    .0001188
no drug

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256600.75         26   .00010132    .000069    .0001488
sotrovimab

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257395         22   .00008547   .0000563    .0001298
paxlovid

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256910.75         17   .00006617   .0000411    .0001064
molnupavir

                id:  patient_id
     failure event:  fail_pre_taste_serious == 1
obs. time interval:  (stop_pre_taste_serious[_n-1], stop_pre_taste_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,114  event time missing (stop_pre_taste_serious>=.)     PROBABLE ERROR
        528  ignored because never entered
        818  observations end on or before enter()
------------------------------------------------------------------------------
     50,499  observations remaining, representing
     50,499  subjects
         62  failures in single-failure-per-subject data
  1,463,597  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463596.5         62   .00004236    .000033    .0000543

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       679243         27   .00003975   .0000273     .000058
no drug

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261525          5   .00001912   7.96e-06    .0000459
sotrovimab

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261622         11   .00004205   .0000233    .0000759
paxlovid

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     261206.5         19   .00007274   .0000464     .000114
molnupavir

                id:  patient_id
     failure event:  fail_pre_rash_serious == 1
obs. time interval:  (stop_pre_rash_serious[_n-1], stop_pre_rash_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,060  event time missing (stop_pre_rash_serious>=.)      PROBABLE ERROR
        582  ignored because never entered
        832  observations end on or before enter()
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
         67  failures in single-failure-per-subject data
  1,463,067  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1463067         67   .00004579    .000036    .0000582

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       679808         30   .00004413   .0000309    .0000631
no drug

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261168.75         13   .00004978   .0000289    .0000857
sotrovimab

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261429.75         16    .0000612   .0000375    .0000999
paxlovid

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     260660.5          8   .00003069   .0000153    .0000614
molnupavir

                id:  patient_id
     failure event:  fail_pre_contactderm_serious == 1
obs. time interval:  (stop_pre_contactderm_serious[_n-1], stop_pre_contactderm_
> serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,081  event time missing (stop_pre_contactderm_serious>=.)PROBABLE ERROR
      1,561  ignored because never entered
      1,640  observations end on or before enter()
------------------------------------------------------------------------------
     49,677  observations remaining, representing
     49,677  subjects
        154  failures in single-failure-per-subject data
  1,438,430  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438429.5        154   .00010706   .0000914    .0001254

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     667582.5         73   .00010935   .0000869    .0001375
no drug

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     256933.5         26   .00010119   .0000689    .0001486
sotrovimab

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257539.75         23   .00008931   .0000593    .0001344
paxlovid

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256373.75         32   .00012482   .0000883    .0001765
molnupavir

                id:  patient_id
     failure event:  fail_pre_dizziness_serious == 1
obs. time interval:  (stop_pre_dizziness_serious[_n-1], stop_pre_dizziness_seri
> ous]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,062  event time missing (stop_pre_dizziness_serious>=.) PROBABLE ERROR
        580  ignored because never entered
        813  observations end on or before enter()
------------------------------------------------------------------------------
     50,504  observations remaining, representing
     50,504  subjects
         75  failures in single-failure-per-subject data
  1,463,615  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463614.5         75   .00005124   .0000409    .0000643

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    679149.75         40    .0000589   .0000432    .0000803
no drug

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261841         10   .00003819   .0000205     .000071
sotrovimab

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261469         13   .00004972   .0000289    .0000856
paxlovid

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261154.75         12   .00004595   .0000261    .0000809
molnupavir

                id:  patient_id
     failure event:  fail_pre_nausea_vomit_serious == 1
obs. time interval:  (stop_pre_nausea_vomit_serious[_n-1], stop_pre_nausea_vomi
> t_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,057  event time missing (stop_pre_nausea_vomit_serious>=.)PROBABLE ERRO
> R
        585  ignored because never entered
        777  observations end on or before enter()
------------------------------------------------------------------------------
     50,540  observations remaining, representing
     50,540  subjects
         78  failures in single-failure-per-subject data
  1,464,429  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1464429.3         78   .00005326   .0000427    .0000665

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    680440.75         34   .00004997   .0000357    .0000699
no drug

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261371.75         17   .00006504   .0000404    .0001046
sotrovimab

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261792         12   .00004584    .000026    .0000807
paxlovid

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    260824.75         15   .00005751   .0000347    .0000954
molnupavir

                id:  patient_id
     failure event:  fail_pre_headache_serious == 1
obs. time interval:  (stop_pre_headache_serious[_n-1], stop_pre_headache_seriou
> s]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,033  event time missing (stop_pre_headache_serious>=.)  PROBABLE ERROR
        609  ignored because never entered
        802  observations end on or before enter()
------------------------------------------------------------------------------
     50,515  observations remaining, representing
     50,515  subjects
         80  failures in single-failure-per-subject data
  1,463,879  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463879.3         80   .00005465   .0000439     .000068

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       678825         36   .00005303   .0000383    .0000735
no drug

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     261252.5         17   .00006507   .0000405    .0001047
sotrovimab

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262128.75         10   .00003815   .0000205    .0000709
paxlovid

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261673         17   .00006497   .0000404    .0001045
molnupavir

                id:  patient_id
     failure event:  fail_pre_anaphylaxis_serious == 1
obs. time interval:  (stop_pre_anaphylaxis_serious[_n-1], stop_pre_anaphylaxis_
> serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,042  event time missing (stop_pre_anaphylaxis_serious>=.)PROBABLE ERROR
        600  ignored because never entered
        803  observations end on or before enter()
------------------------------------------------------------------------------
     50,514  observations remaining, representing
     50,514  subjects
         85  failures in single-failure-per-subject data
  1,463,596  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463596.3         85   .00005808    .000047    .0000718

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    679870.75         46   .00006766   .0000507    .0000903
no drug

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260916         14   .00005366   .0000318    .0000906
sotrovimab

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     261588.5         14   .00005352   .0000317    .0000904
paxlovid

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261221         11   .00004211   .0000233     .000076
molnupavir

                id:  patient_id
     failure event:  fail_pre_drugreaction_serious == 1
obs. time interval:  (stop_pre_drugreaction_serious[_n-1], stop_pre_drugreactio
> n_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,530  event time missing (stop_pre_drugreaction_serious>=.)PROBABLE ERRO
> R
      1,112  ignored because never entered
      1,641  observations end on or before enter()
------------------------------------------------------------------------------
     49,676  observations remaining, representing
     49,676  subjects
        127  failures in single-failure-per-subject data
  1,438,870  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438869.5        127   .00008826   .0000742     .000105

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    667647.75         65   .00009736   .0000763    .0001241
no drug

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       256699         20   .00007791   .0000503    .0001208
sotrovimab

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256878.75         23   .00008954   .0000595    .0001347
paxlovid

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257644         19   .00007375    .000047    .0001156
molnupavir

                id:  patient_id
     failure event:  fail_pre_ra_serious == 1
obs. time interval:  (stop_pre_ra_serious[_n-1], stop_pre_ra_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,131  event time missing (stop_pre_ra_serious>=.)        PROBABLE ERROR
        511  ignored because never entered
        741  observations end on or before enter()
------------------------------------------------------------------------------
     50,576  observations remaining, representing
     50,576  subjects
         69  failures in single-failure-per-subject data
  1,465,661  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1465660.8         69   .00004708   .0000372    .0000596

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       680231         32   .00004704   .0000333    .0000665
no drug

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261714         16   .00006114   .0000375    .0000998
sotrovimab

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262293.75          6   .00002288   .0000103    .0000509
paxlovid

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261422         15   .00005738   .0000346    .0000952
molnupavir

                id:  patient_id
     failure event:  fail_pre_sle_serious == 1
obs. time interval:  (stop_pre_sle_serious[_n-1], stop_pre_sle_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,151  event time missing (stop_pre_sle_serious>=.)       PROBABLE ERROR
        491  ignored because never entered
        754  observations end on or before enter()
------------------------------------------------------------------------------
     50,563  observations remaining, representing
     50,563  subjects
         74  failures in single-failure-per-subject data
  1,465,380  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1465380         74    .0000505   .0000402    .0000634

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       679425         28   .00004121   .0000285    .0000597
no drug

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262013         16   .00006107   .0000374    .0000997
sotrovimab

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262035         16   .00006106   .0000374    .0000997
paxlovid

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261907         14   .00005345   .0000317    .0000903
molnupavir

                id:  patient_id
     failure event:  fail_pre_psorasis_serious == 1
obs. time interval:  (stop_pre_psorasis_serious[_n-1], stop_pre_psorasis_seriou
> s]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,126  event time missing (stop_pre_psorasis_serious>=.)  PROBABLE ERROR
        516  ignored because never entered
        690  observations end on or before enter()
------------------------------------------------------------------------------
     50,627  observations remaining, representing
     50,627  subjects
         73  failures in single-failure-per-subject data
  1,467,150  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1467149.8         73   .00004976   .0000396    .0000626

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    681640.75         32   .00004695   .0000332    .0000664
no drug

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261754         11   .00004202   .0000233    .0000759
sotrovimab

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262070         13   .00004961   .0000288    .0000854
paxlovid

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261685         17   .00006496   .0000404    .0001045
molnupavir

                id:  patient_id
     failure event:  fail_pre_psa_serious == 1
obs. time interval:  (stop_pre_psa_serious[_n-1], stop_pre_psa_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,141  event time missing (stop_pre_psa_serious>=.)       PROBABLE ERROR
        501  ignored because never entered
        722  observations end on or before enter()
------------------------------------------------------------------------------
     50,595  observations remaining, representing
     50,595  subjects
         76  failures in single-failure-per-subject data
  1,466,141  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1466140.8         76   .00005184   .0000414    .0000649

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    680450.75         29   .00004262   .0000296    .0000613
no drug

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261871         11   .00004201   .0000233    .0000758
sotrovimab

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262492         16   .00006095   .0000373    .0000995
paxlovid

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261327         20   .00007653   .0000494    .0001186
molnupavir

                id:  patient_id
     failure event:  fail_pre_axspa_serious == 1
obs. time interval:  (stop_pre_axspa_serious[_n-1], stop_pre_axspa_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,122  event time missing (stop_pre_axspa_serious>=.)     PROBABLE ERROR
        520  ignored because never entered
        760  observations end on or before enter()
------------------------------------------------------------------------------
     50,557  observations remaining, representing
     50,557  subjects
         56  failures in single-failure-per-subject data
  1,465,320  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1465319.8         56   .00003822   .0000294    .0000497

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       679958         32   .00004706   .0000333    .0000665
no drug

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261442          8    .0000306   .0000153    .0000612
sotrovimab

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262318          5   .00001906   7.93e-06    .0000458
paxlovid

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261601.75         11   .00004205   .0000233    .0000759
molnupavir

                id:  patient_id
     failure event:  fail_pre_ibd_serious == 1
obs. time interval:  (stop_pre_ibd_serious[_n-1], stop_pre_ibd_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,104  event time missing (stop_pre_ibd_serious>=.)       PROBABLE ERROR
        538  ignored because never entered
        732  observations end on or before enter()
------------------------------------------------------------------------------
     50,585  observations remaining, representing
     50,585  subjects
         72  failures in single-failure-per-subject data
  1,465,948  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1465947.5         72   .00004911    .000039    .0000619

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    681006.75         33   .00004846   .0000344    .0000682
no drug

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261176.75         16   .00006126   .0000375       .0001
sotrovimab

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261831         13   .00004965   .0000288    .0000855
paxlovid

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       261933         10   .00003818   .0000205     .000071
molnupavir

                id:  patient_id
     failure event:  fail_pre_all == 1
obs. time interval:  (stop_pre_all[_n-1], stop_pre_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      5,642  ignored because never entered
------------------------------------------------------------------------------
     51,317  observations remaining, representing
     51,317  subjects
          0  failures in single-failure-per-subject data
  1,488,193  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1488193          0           0          .           .

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       690867          0           0          .           .
no drug

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       265669          0           0          .           .
sotrovimab

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       266104          0           0          .           .
paxlovid

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       265553          0           0          .           .
molnupavir

                id:  patient_id
     failure event:  fail_pre_all_serious == 1
obs. time interval:  (stop_pre_all_serious[_n-1], stop_pre_all_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
          2  event time missing (stop_pre_all_serious>=.)       PROBABLE ERROR
      5,640  ignored because never entered
------------------------------------------------------------------------------
     51,317  observations remaining, representing
     51,317  subjects
          0  failures in single-failure-per-subject data
  1,488,193  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1488193          0           0          .           .

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       690867          0           0          .           .
no drug

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       265669          0           0          .           .
sotrovimab

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       266104          0           0          .           .
paxlovid

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       265553          0           0          .           .
molnupavir

                id:  patient_id
     failure event:  fail_pre_spc_all == 1
obs. time interval:  (stop_pre_spc_all[_n-1], stop_pre_spc_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
        165  event time missing (stop_pre_spc_all>=.)           PROBABLE ERROR
      5,477  ignored because never entered
     15,523  observations end on or before enter()
------------------------------------------------------------------------------
     35,794  observations remaining, representing
     35,794  subjects
      1,192  failures in single-failure-per-subject data
  1,020,690  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1020690       1192   .00116784   .0011034    .0012361

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    475350.25        575   .00120963   .0011147    .0013127
no drug

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     183268.5        195   .00106401   .0009247    .0012243
sotrovimab

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    181511.25        199   .00109635   .0009541    .0012598
paxlovid

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       180560        223   .00123505   .0010831    .0014083
molnupavir

                id:  patient_id
     failure event:  fail_pre_spc_serious == 1
obs. time interval:  (stop_pre_spc_serious[_n-1], stop_pre_spc_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      1,735  event time missing (stop_pre_spc_serious>=.)       PROBABLE ERROR
      3,907  ignored because never entered
      7,448  observations end on or before enter()
------------------------------------------------------------------------------
     43,869  observations remaining, representing
     43,869  subjects
        622  failures in single-failure-per-subject data
  1,263,438  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1263437.8        622   .00049231   .0004551    .0005326

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    586444.75        297   .00050644    .000452    .0005674
no drug

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    225629.25        106    .0004698   .0003884    .0005683
sotrovimab

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    226301.25        102   .00045073   .0003712    .0005473
paxlovid

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     225062.5        117   .00051986   .0004337    .0006231
molnupavir

                id:  patient_id
     failure event:  fail_pre_drug_all == 1
obs. time interval:  (stop_pre_drug_all[_n-1], stop_pre_drug_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      2,139  event time missing (stop_pre_drug_all>=.)          PROBABLE ERROR
      3,503  ignored because never entered
      4,663  observations end on or before enter()
------------------------------------------------------------------------------
     46,654  observations remaining, representing
     46,654  subjects
        401  failures in single-failure-per-subject data
  1,347,161  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1347160.5        401   .00029766   .0002699    .0003283

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       626903        213   .00033977   .0002971    .0003886
no drug

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       239816         63    .0002627   .0002052    .0003363
sotrovimab

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       239629         66   .00027543   .0002164    .0003506
paxlovid

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     240812.5         59     .000245   .0001898    .0003162
molnupavir

                id:  patient_id
     failure event:  fail_pre_drug_serious == 1
obs. time interval:  (stop_pre_drug_serious[_n-1], stop_pre_drug_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      4,052  event time missing (stop_pre_drug_serious>=.)      PROBABLE ERROR
      1,590  ignored because never entered
      2,410  observations end on or before enter()
------------------------------------------------------------------------------
     48,907  observations remaining, representing
     48,907  subjects
        207  failures in single-failure-per-subject data
  1,415,341  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1415340.8        207   .00014625   .0001276    .0001676

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     657192.5        108   .00016434   .0001361    .0001984
no drug

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       252067         32   .00012695   .0000898    .0001795
sotrovimab

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    252537.25         37   .00014651   .0001062    .0002022
paxlovid

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       253544         30   .00011832   .0000827    .0001692
molnupavir

                id:  patient_id
     failure event:  fail_pre_imae_all == 1
obs. time interval:  (stop_pre_imae_all[_n-1], stop_pre_imae_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      1,022  event time missing (stop_pre_imae_all>=.)          PROBABLE ERROR
      4,620  ignored because never entered
      7,984  observations end on or before enter()
------------------------------------------------------------------------------
     43,333  observations remaining, representing
     43,333  subjects
        702  failures in single-failure-per-subject data
  1,246,678  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1246678        702    .0005631   .0005229    .0006063

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       578272        328   .00056721    .000509     .000632
no drug

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    222110.25        122   .00054928     .00046    .0006559
sotrovimab

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       222441        125   .00056195   .0004716    .0006696
paxlovid

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    223854.75        127   .00056733   .0004768    .0006751
molnupavir

                id:  patient_id
     failure event:  fail_pre_imae_serious == 1
obs. time interval:  (stop_pre_imae_serious[_n-1], stop_pre_imae_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,959  total observations
      3,156  event time missing (stop_pre_imae_serious>=.)      PROBABLE ERROR
      2,486  ignored because never entered
      4,215  observations end on or before enter()
------------------------------------------------------------------------------
     47,102  observations remaining, representing
     47,102  subjects
        386  failures in single-failure-per-subject data
  1,360,405  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1360404.8        386   .00028374   .0002568    .0003135

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     630976.5        173   .00027418   .0002362    .0003182
no drug

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    242618.75         72   .00029676   .0002356    .0003739
sotrovimab

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    243507.75         64   .00026283   .0002057    .0003358
paxlovid

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    243301.75         77   .00031648   .0002531    .0003957
molnupavir

. postclose `comparator_rates'

. use "$projectdir/output/tables/comparator_rates", clear

. order failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates", replace
file /workspace/output/tables/comparator_rates.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates.csv", repl
> ace
(note: file /workspace/output/tables/comparator_rates.csv not found)
file /workspace/output/tables/comparator_rates.csv saved

. 
. ** Redact and round rates
. use "$projectdir/output/tables/comparator_rates", clear

. foreach var of varlist *events *ptime  {
  2. gen `var'_midpoint = (ceil(`var'/6)*6) - (floor(6/2) * (`var'!=0))
  3. }

. foreach var in all control sot pax mol {
  2. gen `var'_rate_midpoint = (`var'_events_midpoint/`var'_ptime_midpoint)*100
> 0
  3. gen `var'_lci_midpoint = (invpoisson(`var'_events_midpoint,.975)/`var'_pti
> me_midpoint)*1000
  4. gen `var'_uci_midpoint = (invpoisson(`var'_events_midpoint,.025)/`var'_pti
> me_midpoint)*1000
  5. }  

. keep failure *_midpoint

. order   failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates_round", replace
file /workspace/output/tables/comparator_rates_round.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates_round.csv"
> , replace
(note: file /workspace/output/tables/comparator_rates_round.csv not found)
file /workspace/output/tables/comparator_rates_round.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 closed on:  31 Oct 2023, 22:15:41
-------------------------------------------------------------------------------
