-------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\Ope
> nSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupirav
> ir/logs/preceed_rate.log
  log type:  text
 opened on:  31 Oct 2023, 13:07:03

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Ka
> tie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Mol
> nupiravir/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for
>  comparative rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prio
> r
. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 
(51,850 missing values generated)

. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0
>  
(51,722 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snome
> d_new==0 
(51,687 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 
(51,740 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 
(51,771 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 
(51,709 missing values generated)

. gen new_pre_psoriasis_icd = pre_psoriasis_icd_prim if pre_psoriasis_sno
> med_new==0 
(51,769 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_sn
> omed_new==0 
(51,678 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new
> ==0
(51,719 missing values generated)

. gen new_pre_psa_icd = pre_psa_icd_prim if pre_psa_snomed_new==0
(51,684 missing values generated)

. gen new_pre_psa_ae = pre_psa_ae if pre_psa_snomed_new==0 
(51,738 missing values generated)

. gen new_pre_psa_snomed = pre_psa_snomed if pre_psa_snomed_new==0 
(51,705 missing values generated)

. gen new_pre_axspa_icd = pre_axspa_icd_prim if pre_axspa_ctv_new==0
(51,795 missing values generated)

. gen new_pre_axspa_ctv = pre_axspa_ctv if pre_axspa_ctv_new==0 
(51,674 missing values generated)

. gen new_pre_axspa_ae = pre_axspa_ae if pre_axspa_ctv_new==0
(51,738 missing values generated)

. gen new_pre_ibd_icd = pre_ibd_icd_prim if pre_ibd_ctv_new==0
(51,634 missing values generated)

. gen new_pre_ibd_ctv = pre_ibd_ctv if pre_ibd_ctv_new==0
(51,649 missing values generated)

. gen new_pre_ibd_ae = pre_ibd_ae if pre_ibd_ctv_new==0
(51,799 missing values generated)

. 
. *** combined all AEs from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_divertic
> ulitis_snomed pre_diverticulitis_ae)      
(41,368 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_icd_prim pre_diarrhoea_snomed  
> pre_diarrhoeal_icd_prim)
(41,463 missing values generated)

. egen pre_taste = rmin(pre_taste_icd_prim pre_taste_snomed )
(46,148 missing values generated)

. egen pre_rash = rmin(pre_rash_icd_prim pre_rash_snomed pre_rash_ae)
(41,392 missing values generated)

. egen pre_bronchospasm = rmin(pre_bronchospasm_snomed)
(51,128 missing values generated)

. egen pre_contactderm = rmin(pre_contactderm_snomed pre_contactderm_icd_
> prim pre_contactderm_ae)
(41,421 missing values generated)

. egen pre_dizziness = rmin(pre_dizziness_snomed pre_dizziness_ae pre_diz
> ziness_icd_prim)
(41,496 missing values generated)

. egen pre_nausea_vomit = rmin(pre_nausea_vomit_snomed pre_nausea_vomit_i
> cd_prim)
(46,069 missing values generated)

. egen pre_headache = rmin(pre_headache_snomed pre_headache_ae pre_headac
> he_icd_prim)
(41,392 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_sn
> omed     pre_anaphlaxis_ae)
(41,485 missing values generated)

. egen pre_drugreaction = rmin(pre_severedrug_icd_prim pre_severedrug_sjs
> _icd_prim pre_severedrug_snomed pre_severedrug_ae pre_nonsevere_drug_sn
> omed pre_nonsevere_drug_ae)
(30,162 missing values generated)

. egen pre_ra = rmin(new_pre_ra_icd new_pre_ra_ae new_pre_ra_snomed )
(42,988 missing values generated)

. egen pre_sle = rmin(new_pre_sle_icd new_pre_sle_ctv new_pre_sle_ae)
(43,037 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_icd new_pre_psoriasis_snomed
>   new_pre_psoriasis_ae)
(43,008 missing values generated)

. egen pre_psa = rmin(new_pre_psa_icd new_pre_psa_ae new_pre_psa_snomed)
(42,966 missing values generated)

. egen pre_axspa = rmin(new_pre_axspa_icd  new_pre_axspa_ae new_pre_axspa
> _ctv)
(43,027 missing values generated)

. egen pre_ibd = rmin(new_pre_ibd_icd new_pre_ibd_ctv new_pre_ibd_ae)
(42,933 missing values generated)

. 
. *** combined serious AEs from hosp and A&E
. egen pre_diverticulitis_serious = rmin(pre_diverticulitis_icd_prim)    
>   
(51,163 missing values generated)

. egen pre_diarrhoea_serious = rmin(pre_diarrhoea_icd_prim pre_diarrhoeal
> _icd_prim)
(46,030 missing values generated)

. egen pre_taste_serious = rmin(pre_taste_icd_prim)
(51,250 missing values generated)

. egen pre_rash_serious = rmin(pre_rash_icd_prim)
(51,100 missing values generated)

. egen pre_contactderm_serious = rmin(pre_contactderm_snomed pre_contactd
> erm_icd_prim pre_contactderm_ae)
(41,421 missing values generated)

. egen pre_dizziness_serious = rmin(pre_dizziness_icd_prim)
(51,147 missing values generated)

. egen pre_nausea_vomit_serious = rmin(pre_nausea_vomit_icd_prim)
(51,095 missing values generated)

. egen pre_headache_serious = rmin(pre_headache_icd_prim)
(51,084 missing values generated)

. egen pre_anaphylaxis_serious = rmin(pre_anaphylaxis_icd_prim)
(51,148 missing values generated)

. egen pre_drugreaction_serious = rmin(pre_severedrug_icd_prim pre_severe
> drug_sjs_icd_prim)
(46,032 missing values generated)

. egen pre_ra_serious = rmin(new_pre_ra_icd)
(51,850 missing values generated)

. egen pre_sle_serious = rmin(new_pre_sle_icd)
(51,771 missing values generated)

. egen pre_psorasis_serious = rmin(new_pre_psoriasis_icd)
(51,769 missing values generated)

. egen pre_psa_serious = rmin(new_pre_psa_icd)
(51,684 missing values generated)

. egen pre_axspa_serious = rmin(new_pre_axspa_icd)
(51,795 missing values generated)

. egen pre_ibd_serious = rmin(new_pre_ibd_icd)
(51,634 missing values generated)

. 
. *** combined AEs by spc, drug and imae                          
. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste pre_
> rash pre_contactderm pre_bronchospasm pre_dizziness pre_nausea_vomit pr
> e_headache pre_anaphylaxis pre_drugreaction)
(2,007 missing values generated)

. egen pre_spc_serious = rmin(pre_diverticulitis_serious pre_diarrhoea_se
> rious pre_taste_serious pre_rash_serious pre_contactderm_serious pre_di
> zziness_serious pre_nausea_vomit_serious pre_headache_serious)
(17,949 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_drugreaction)
(21,970 missing values generated)

. egen pre_drug_serious = rmin(pre_anaphylaxis_serious pre_drugreaction_s
> erious)
(41,462 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_ibd pr
> e_axspa)
(10,597 missing values generated)

. egen pre_imae_serious = rmin(pre_ra_serious pre_sle_serious pre_psorasi
> s_serious pre_psa_serious pre_axspa_serious pre_ibd_serious)
(32,396 missing values generated)

. egen pre_all = rmin(ae_spc_all ae_drug_all ae_imae_all )

. egen pre_all_serious = rmin(ae_spc_serious ae_drug_serious ae_imae_seri
> ous)
(5 missing values generated)

. 
. global pre_ae_disease                   pre_diverticulitis             
>                  ///
>                                                                 pre_dia
> rrhoea                                   ///
>                                                                 pre_tas
> te                                               ///
>                                                                 pre_ras
> h                                                ///
>                                                                 pre_bro
> nchospasm                                ///
>                                                                 pre_con
> tactderm                                 ///
>                                                                 pre_diz
> ziness                                   ///
>                                                                 pre_nau
> sea_vomit                                ///
>                                                                 pre_hea
> dache                                    ///
>                                                                 pre_ana
> phylaxis                                 ///
>                                                                 pre_dru
> greaction                                ///
>                                                                 pre_ra 
>                                                  ///
>                                                                 pre_sle
>                                                  ///
>                                                                 pre_pso
> rasis                                    ///
>                                                                 pre_psa
>                                                  ///
>                                                                 pre_axs
> pa                                               ///
>                                                                 pre_ibd
>  

. global pre_ae_disease_serious   pre_diverticulitis_serious             
>  ///
>                                                                 pre_dia
> rrhoea_serious                   ///
>                                                                 pre_tas
> te_serious                               ///
>                                                                 pre_ras
> h_serious                                ///
>                                                                 pre_con
> tactderm_serious                 ///
>                                                                 pre_diz
> ziness_serious                   ///
>                                                                 pre_nau
> sea_vomit_serious                ///
>                                                                 pre_hea
> dache_serious                    ///
>                                                                 pre_ana
> phylaxis_serious                 ///
>                                                                 pre_dru
> greaction_serious                ///
>                                                                 pre_ra_
> serious                                  ///
>                                                                 pre_sle
> _serious                                 ///
>                                                                 pre_pso
> rasis_serious                    ///
>                                                                 pre_psa
> _serious                                 ///
>                                                                 pre_axs
> pa_serious                               ///
>                                                                 pre_ibd
> _serious                                                         

. global pre_ae_combined                  pre_all                        
>                          ///
>                                                                 pre_all
> _serious                                 ///
>                                                                 pre_spc
> _all                                     ///
>                                                                 pre_spc
> _serious                                 ///
>                                                                 pre_dru
> g_all                                    ///
>                                                                 pre_dru
> g_serious                                ///
>                                                                 pre_ima
> e_all                                    ///     
>                                                                 pre_ima
> e_serious                                                        

. 
. ********************************************************
. *       A. START DATE           *
. ********************************************************
. gen start_comparator = start_date-1460
(3,039 missing values generated)

. gen start_comparator_28 = start_date - 1431
(3,039 missing values generated)

. 
. ********************************************************
. *       A. COX MODEL            *
. ********************************************************
. * Generate failure 
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparato
> r_28) & `x'!=.  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparato
> r_28) & `x'!=.  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8. }
pre_diverticulitis
  15,462
  15,313
  137
(41,368 missing values generated)

                      | fail_pre_diverticulit
                      |          is
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,187     19,194 |    26,381 
           sotrovimab |     2,764      7,424 |    10,188 
             paxlovid |     2,793      7,429 |    10,222 
         molnupiravir |     2,718      7,321 |    10,039 
----------------------+----------------------+----------
                Total |    15,462     41,368 |    56,830 
pre_diarrhoea
  15,367
  15,144
  209
(41,463 missing values generated)

                      |  fail_pre_diarrhoea
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,097     19,284 |    26,381 
           sotrovimab |     2,784      7,404 |    10,188 
             paxlovid |     2,740      7,482 |    10,222 
         molnupiravir |     2,746      7,293 |    10,039 
----------------------+----------------------+----------
                Total |    15,367     41,463 |    56,830 
pre_taste
  10,682
  10,513
  161
(46,148 missing values generated)

                      |    fail_pre_taste
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     4,933     21,448 |    26,381 
           sotrovimab |     1,950      8,238 |    10,188 
             paxlovid |     1,908      8,314 |    10,222 
         molnupiravir |     1,891      8,148 |    10,039 
----------------------+----------------------+----------
                Total |    10,682     46,148 |    56,830 
pre_rash
  15,438
  15,286
  142
(41,392 missing values generated)

                      |     fail_pre_rash
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,135     19,246 |    26,381 
           sotrovimab |     2,818      7,370 |    10,188 
             paxlovid |     2,792      7,430 |    10,222 
         molnupiravir |     2,693      7,346 |    10,039 
----------------------+----------------------+----------
                Total |    15,438     41,392 |    56,830 
pre_bronchospasm
  5,702
  5,611
  85
(51,128 missing values generated)

                      | fail_pre_bronchospasm
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,640     23,741 |    26,381 
           sotrovimab |     1,043      9,145 |    10,188 
             paxlovid |     1,006      9,216 |    10,222 
         molnupiravir |     1,013      9,026 |    10,039 
----------------------+----------------------+----------
                Total |     5,702     51,128 |    56,830 
pre_contactderm
  15,409
  15,259
  138
(41,421 missing values generated)

                      | fail_pre_contactderm
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,154     19,227 |    26,381 
           sotrovimab |     2,749      7,439 |    10,188 
             paxlovid |     2,738      7,484 |    10,222 
         molnupiravir |     2,768      7,271 |    10,039 
----------------------+----------------------+----------
                Total |    15,409     41,421 |    56,830 
pre_dizziness
  15,334
  15,188
  140
(41,496 missing values generated)

                      |  fail_pre_dizziness
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,131     19,250 |    26,381 
           sotrovimab |     2,794      7,394 |    10,188 
             paxlovid |     2,770      7,452 |    10,222 
         molnupiravir |     2,639      7,400 |    10,039 
----------------------+----------------------+----------
                Total |    15,334     41,496 |    56,830 
pre_nausea_vomit
  10,761
  10,613
  131
(46,069 missing values generated)

                      | fail_pre_nausea_vomit
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,061     21,320 |    26,381 
           sotrovimab |     1,942      8,246 |    10,188 
             paxlovid |     1,906      8,316 |    10,222 
         molnupiravir |     1,852      8,187 |    10,039 
----------------------+----------------------+----------
                Total |    10,761     46,069 |    56,830 
pre_headache
  15,438
  15,304
  128
(41,392 missing values generated)

                      |   fail_pre_headache
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,194     19,187 |    26,381 
           sotrovimab |     2,714      7,474 |    10,188 
             paxlovid |     2,822      7,400 |    10,222 
         molnupiravir |     2,708      7,331 |    10,039 
----------------------+----------------------+----------
                Total |    15,438     41,392 |    56,830 
pre_anaphylaxis
  15,345
  15,207
  125
(41,485 missing values generated)

                      | fail_pre_anaphylaxis
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,127     19,254 |    26,381 
           sotrovimab |     2,722      7,466 |    10,188 
             paxlovid |     2,780      7,442 |    10,222 
         molnupiravir |     2,716      7,323 |    10,039 
----------------------+----------------------+----------
                Total |    15,345     41,485 |    56,830 
pre_drugreaction
  26,668
  26,372
  283
(30,162 missing values generated)

                      | fail_pre_drugreaction
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    12,401     13,980 |    26,381 
           sotrovimab |     4,750      5,438 |    10,188 
             paxlovid |     4,810      5,412 |    10,222 
         molnupiravir |     4,707      5,332 |    10,039 
----------------------+----------------------+----------
                Total |    26,668     30,162 |    56,830 
pre_ra
  13,842
  13,737
  97
(42,988 missing values generated)

                      |      fail_pre_ra
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,435     19,946 |    26,381 
           sotrovimab |     2,450      7,738 |    10,188 
             paxlovid |     2,437      7,785 |    10,222 
         molnupiravir |     2,520      7,519 |    10,039 
----------------------+----------------------+----------
                Total |    13,842     42,988 |    56,830 
pre_sle
  13,793
  13,676
  109
(43,037 missing values generated)

                      |     fail_pre_sle
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,393     19,988 |    26,381 
           sotrovimab |     2,419      7,769 |    10,188 
             paxlovid |     2,507      7,715 |    10,222 
         molnupiravir |     2,474      7,565 |    10,039 
----------------------+----------------------+----------
                Total |    13,793     43,037 |    56,830 
pre_psorasis
  13,822
  13,698
  113
(43,008 missing values generated)

                      |   fail_pre_psorasis
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,446     19,935 |    26,381 
           sotrovimab |     2,507      7,681 |    10,188 
             paxlovid |     2,430      7,792 |    10,222 
         molnupiravir |     2,439      7,600 |    10,039 
----------------------+----------------------+----------
                Total |    13,822     43,008 |    56,830 
pre_psa
  13,864
  13,759
  96
(42,966 missing values generated)

                      |     fail_pre_psa
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,495     19,886 |    26,381 
           sotrovimab |     2,471      7,717 |    10,188 
             paxlovid |     2,471      7,751 |    10,222 
         molnupiravir |     2,427      7,612 |    10,039 
----------------------+----------------------+----------
                Total |    13,864     42,966 |    56,830 
pre_axspa
  13,803
  13,671
  126
(43,027 missing values generated)

                      |    fail_pre_axspa
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,499     19,882 |    26,381 
           sotrovimab |     2,476      7,712 |    10,188 
             paxlovid |     2,440      7,782 |    10,222 
         molnupiravir |     2,388      7,651 |    10,039 
----------------------+----------------------+----------
                Total |    13,803     43,027 |    56,830 
pre_ibd
  13,897
  13,747
  137
(42,933 missing values generated)

                      |     fail_pre_ibd
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,436     19,945 |    26,381 
           sotrovimab |     2,491      7,697 |    10,188 
             paxlovid |     2,520      7,702 |    10,222 
         molnupiravir |     2,450      7,589 |    10,039 
----------------------+----------------------+----------
                Total |    13,897     42,933 |    56,830 
pre_diverticulitis_serious
  5,667
  5,588
  71
(51,163 missing values generated)

                      | fail_pre_diverticulit
                      |      is_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,662     23,719 |    26,381 
           sotrovimab |     1,000      9,188 |    10,188 
             paxlovid |     1,006      9,216 |    10,222 
         molnupiravir |       999      9,040 |    10,039 
----------------------+----------------------+----------
                Total |     5,667     51,163 |    56,830 
pre_diarrhoea_serious
  10,800
  10,655
  137
(46,030 missing values generated)

                      | fail_pre_diarrhoea_se
                      |         rious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,015     21,366 |    26,381 
           sotrovimab |     1,951      8,237 |    10,188 
             paxlovid |     1,908      8,314 |    10,222 
         molnupiravir |     1,926      8,113 |    10,039 
----------------------+----------------------+----------
                Total |    10,800     46,030 |    56,830 
pre_taste_serious
  5,580
  5,489
  88
(51,250 missing values generated)

                      | fail_pre_taste_seriou
                      |           s
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,567     23,814 |    26,381 
           sotrovimab |     1,006      9,182 |    10,188 
             paxlovid |     1,003      9,219 |    10,222 
         molnupiravir |     1,004      9,035 |    10,039 
----------------------+----------------------+----------
                Total |     5,580     51,250 |    56,830 
pre_rash_serious
  5,730
  5,642
  82
(51,100 missing values generated)

                      | fail_pre_rash_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,620     23,761 |    26,381 
           sotrovimab |     1,085      9,103 |    10,188 
             paxlovid |     1,032      9,190 |    10,222 
         molnupiravir |       993      9,046 |    10,039 
----------------------+----------------------+----------
                Total |     5,730     51,100 |    56,830 
pre_contactderm_serious
  15,409
  15,259
  138
(41,421 missing values generated)

                      | fail_pre_contactderm_
                      |        serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,154     19,227 |    26,381 
           sotrovimab |     2,749      7,439 |    10,188 
             paxlovid |     2,738      7,484 |    10,222 
         molnupiravir |     2,768      7,271 |    10,039 
----------------------+----------------------+----------
                Total |    15,409     41,421 |    56,830 
pre_dizziness_serious
  5,683
  5,605
  74
(51,147 missing values generated)

                      | fail_pre_dizziness_se
                      |         rious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,647     23,734 |    26,381 
           sotrovimab |       999      9,189 |    10,188 
             paxlovid |     1,062      9,160 |    10,222 
         molnupiravir |       975      9,064 |    10,039 
----------------------+----------------------+----------
                Total |     5,683     51,147 |    56,830 
pre_nausea_vomit_serious
  5,735
  5,675
  53
(51,095 missing values generated)

                      | fail_pre_nausea_vomit
                      |       _serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,700     23,681 |    26,381 
           sotrovimab |     1,017      9,171 |    10,188 
             paxlovid |     1,020      9,202 |    10,222 
         molnupiravir |       998      9,041 |    10,039 
----------------------+----------------------+----------
                Total |     5,735     51,095 |    56,830 
pre_headache_serious
  5,746
  5,672
  70
(51,084 missing values generated)

                      | fail_pre_headache_ser
                      |         ious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,660     23,721 |    26,381 
           sotrovimab |     1,011      9,177 |    10,188 
             paxlovid |     1,060      9,162 |    10,222 
         molnupiravir |     1,015      9,024 |    10,039 
----------------------+----------------------+----------
                Total |     5,746     51,084 |    56,830 
pre_anaphylaxis_serious
  5,682
  5,616
  58
(51,148 missing values generated)

                      | fail_pre_anaphylaxis_
                      |        serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,653     23,728 |    26,381 
           sotrovimab |       997      9,191 |    10,188 
             paxlovid |     1,058      9,164 |    10,222 
         molnupiravir |       974      9,065 |    10,039 
----------------------+----------------------+----------
                Total |     5,682     51,148 |    56,830 
pre_drugreaction_serious
  10,798
  10,643
  150
(46,032 missing values generated)

                      | fail_pre_drugreaction
                      |       _serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,025     21,356 |    26,381 
           sotrovimab |     1,946      8,242 |    10,188 
             paxlovid |     1,970      8,252 |    10,222 
         molnupiravir |     1,857      8,182 |    10,039 
----------------------+----------------------+----------
                Total |    10,798     46,032 |    56,830 
pre_ra_serious
  4,980
  4,933
  44
(51,850 missing values generated)

                      |  fail_pre_ra_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,295     24,086 |    26,381 
           sotrovimab |       897      9,291 |    10,188 
             paxlovid |       878      9,344 |    10,222 
         molnupiravir |       910      9,129 |    10,039 
----------------------+----------------------+----------
                Total |     4,980     51,850 |    56,830 
pre_sle_serious
  5,059
  5,011
  44
(51,771 missing values generated)

                      | fail_pre_sle_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,374     24,007 |    26,381 
           sotrovimab |       912      9,276 |    10,188 
             paxlovid |       913      9,309 |    10,222 
         molnupiravir |       860      9,179 |    10,039 
----------------------+----------------------+----------
                Total |     5,059     51,771 |    56,830 
pre_psorasis_serious
  5,061
  5,002
  52
(51,769 missing values generated)

                      | fail_pre_psorasis_ser
                      |         ious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,355     24,026 |    26,381 
           sotrovimab |       919      9,269 |    10,188 
             paxlovid |       895      9,327 |    10,222 
         molnupiravir |       892      9,147 |    10,039 
----------------------+----------------------+----------
                Total |     5,061     51,769 |    56,830 
pre_psa_serious
  5,146
  5,096
  45
(51,684 missing values generated)

                      | fail_pre_psa_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,453     23,928 |    26,381 
           sotrovimab |       886      9,302 |    10,188 
             paxlovid |       936      9,286 |    10,222 
         molnupiravir |       871      9,168 |    10,039 
----------------------+----------------------+----------
                Total |     5,146     51,684 |    56,830 
pre_axspa_serious
  5,035
  4,971
  61
(51,795 missing values generated)

                      | fail_pre_axspa_seriou
                      |           s
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,308     24,073 |    26,381 
           sotrovimab |       924      9,264 |    10,188 
             paxlovid |       905      9,317 |    10,222 
         molnupiravir |       898      9,141 |    10,039 
----------------------+----------------------+----------
                Total |     5,035     51,795 |    56,830 
pre_ibd_serious
  5,196
  5,122
  68
(51,634 missing values generated)

                      | fail_pre_ibd_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,407     23,974 |    26,381 
           sotrovimab |       928      9,260 |    10,188 
             paxlovid |       932      9,290 |    10,222 
         molnupiravir |       929      9,110 |    10,039 
----------------------+----------------------+----------
                Total |     5,196     51,634 |    56,830 
pre_all
  56,830
  56,830
  0

                      | fail_pre_a
                      |     ll
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,381 |    26,381 
           sotrovimab |    10,188 |    10,188 
             paxlovid |    10,222 |    10,222 
         molnupiravir |    10,039 |    10,039 
----------------------+-----------+----------
                Total |    56,830 |    56,830 
pre_all_serious
  56,825
  56,825
  0
(5 missing values generated)

                      | fail_pre_all_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    26,379          2 |    26,381 
           sotrovimab |    10,188          0 |    10,188 
             paxlovid |    10,220          2 |    10,222 
         molnupiravir |    10,038          1 |    10,039 
----------------------+----------------------+----------
                Total |    56,825          5 |    56,830 
pre_spc_all
  54,823
  53,551
  1,189
(2,007 missing values generated)

                      |   fail_pre_spc_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    25,436        945 |    26,381 
           sotrovimab |     9,814        374 |    10,188 
             paxlovid |     9,878        344 |    10,222 
         molnupiravir |     9,695        344 |    10,039 
----------------------+----------------------+----------
                Total |    54,823      2,007 |    56,830 
pre_spc_serious
  38,881
  38,216
  621
(17,949 missing values generated)

                      | fail_pre_spc_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    18,018      8,363 |    26,381 
           sotrovimab |     7,015      3,173 |    10,188 
             paxlovid |     6,936      3,286 |    10,222 
         molnupiravir |     6,912      3,127 |    10,039 
----------------------+----------------------+----------
                Total |    38,881     17,949 |    56,830 
pre_drug_all
  34,860
  34,449
  386
(21,970 missing values generated)

                      |   fail_pre_drug_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    16,171     10,210 |    26,381 
           sotrovimab |     6,235      3,953 |    10,188 
             paxlovid |     6,308      3,914 |    10,222 
         molnupiravir |     6,146      3,893 |    10,039 
----------------------+----------------------+----------
                Total |    34,860     21,970 |    56,830 
pre_drug_serious
  15,368
  15,155
  200
(41,462 missing values generated)

                      | fail_pre_drug_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,135     19,246 |    26,381 
           sotrovimab |     2,759      7,429 |    10,188 
             paxlovid |     2,814      7,408 |    10,222 
         molnupiravir |     2,660      7,379 |    10,039 
----------------------+----------------------+----------
                Total |    15,368     41,462 |    56,830 
pre_imae_all
  46,233
  45,607
  577
(10,597 missing values generated)

                      |   fail_pre_imae_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    21,512      4,869 |    26,381 
           sotrovimab |     8,261      1,927 |    10,188 
             paxlovid |     8,283      1,939 |    10,222 
         molnupiravir |     8,177      1,862 |    10,039 
----------------------+----------------------+----------
                Total |    46,233     10,597 |    56,830 
pre_imae_serious
  24,434
  24,115
  292
(32,396 missing values generated)

                      | fail_pre_imae_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    11,407     14,974 |    26,381 
           sotrovimab |     4,366      5,822 |    10,188 
             paxlovid |     4,358      5,864 |    10,222 
         molnupiravir |     4,303      5,736 |    10,039 
----------------------+----------------------+----------
                Total |    24,434     32,396 |    56,830 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 replace `x'=`x'+0.75 if `x'==start_comparator
  4. }
pre_diverticulitis
(3 real changes made)
pre_diarrhoea
(5 real changes made)
pre_taste
(7 real changes made)
pre_rash
(6 real changes made)
pre_bronchospasm
(4 real changes made)
pre_contactderm
(4 real changes made)
pre_dizziness
(3 real changes made)
pre_nausea_vomit
(8 real changes made)
pre_headache
(5 real changes made)
pre_anaphylaxis
(10 real changes made)
pre_drugreaction
(6 real changes made)
pre_ra
(3 real changes made)
pre_sle
(2 real changes made)
pre_psorasis
(6 real changes made)
pre_psa
(6 real changes made)
pre_axspa
(4 real changes made)
pre_ibd
(10 real changes made)
pre_diverticulitis_serious
(2 real changes made)
pre_diarrhoea_serious
(3 real changes made)
pre_taste_serious
(2 real changes made)
pre_rash_serious
(3 real changes made)
pre_contactderm_serious
(4 real changes made)
pre_dizziness_serious
(1 real change made)
pre_nausea_vomit_serious
(3 real changes made)
pre_headache_serious
(3 real changes made)
pre_anaphylaxis_serious
(6 real changes made)
pre_drugreaction_serious
(3 real changes made)
pre_ra_serious
(1 real change made)
pre_sle_serious
(1 real change made)
pre_psorasis_serious
(4 real changes made)
pre_psa_serious
(2 real changes made)
pre_axspa_serious
(3 real changes made)
pre_ibd_serious
(4 real changes made)
pre_all
(0 real changes made)
pre_all_serious
(0 real changes made)
pre_spc_all
(42 real changes made)
pre_spc_serious
(16 real changes made)
pre_drug_all
(15 real changes made)
pre_drug_serious
(9 real changes made)
pre_imae_all
(27 real changes made)
pre_imae_serious
(14 real changes made)

. 
. *Generate censor date
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 gen stop_`x'=`x' if fail_`x'==1
  3.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
  4.                 tab drug fail_`x' if stop_`x'!=.
  5.                 format %td stop_`x'
  6. }
(41,368 missing values generated)
(39,134 real changes made)

                      | fail_pre_d
                      | iverticuli
                      |    tis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,187 |     7,187 
           sotrovimab |     2,764 |     2,764 
             paxlovid |     2,793 |     2,793 
         molnupiravir |     2,718 |     2,718 
----------------------+-----------+----------
                Total |    15,462 |    15,462 
(41,463 missing values generated)
(39,304 real changes made)

                      | fail_pre_d
                      |  iarrhoea
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,097 |     7,097 
           sotrovimab |     2,784 |     2,784 
             paxlovid |     2,740 |     2,740 
         molnupiravir |     2,746 |     2,746 
----------------------+-----------+----------
                Total |    15,367 |    15,367 
(46,148 missing values generated)
(43,684 real changes made)

                      | fail_pre_t
                      |    aste
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     4,933 |     4,933 
           sotrovimab |     1,950 |     1,950 
             paxlovid |     1,908 |     1,908 
         molnupiravir |     1,891 |     1,891 
----------------------+-----------+----------
                Total |    10,682 |    10,682 
(41,392 missing values generated)
(39,165 real changes made)

                      | fail_pre_r
                      |    ash
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,135 |     7,135 
           sotrovimab |     2,818 |     2,818 
             paxlovid |     2,792 |     2,792 
         molnupiravir |     2,693 |     2,693 
----------------------+-----------+----------
                Total |    15,438 |    15,438 
(51,128 missing values generated)
(48,399 real changes made)

                      | fail_pre_b
                      | ronchospas
                      |     m
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,640 |     2,640 
           sotrovimab |     1,043 |     1,043 
             paxlovid |     1,006 |     1,006 
         molnupiravir |     1,013 |     1,013 
----------------------+-----------+----------
                Total |     5,702 |     5,702 
(41,421 missing values generated)
(39,195 real changes made)

                      | fail_pre_c
                      | ontactderm
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,154 |     7,154 
           sotrovimab |     2,749 |     2,749 
             paxlovid |     2,738 |     2,738 
         molnupiravir |     2,768 |     2,768 
----------------------+-----------+----------
                Total |    15,409 |    15,409 
(41,496 missing values generated)
(39,257 real changes made)

                      | fail_pre_d
                      |  izziness
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,131 |     7,131 
           sotrovimab |     2,794 |     2,794 
             paxlovid |     2,770 |     2,770 
         molnupiravir |     2,639 |     2,639 
----------------------+-----------+----------
                Total |    15,334 |    15,334 
(46,069 missing values generated)
(43,579 real changes made)

                      | fail_pre_n
                      | ausea_vomi
                      |     t
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,061 |     5,061 
           sotrovimab |     1,942 |     1,942 
             paxlovid |     1,906 |     1,906 
         molnupiravir |     1,852 |     1,852 
----------------------+-----------+----------
                Total |    10,761 |    10,761 
(41,392 missing values generated)
(39,173 real changes made)

                      | fail_pre_h
                      |  eadache
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,194 |     7,194 
           sotrovimab |     2,714 |     2,714 
             paxlovid |     2,822 |     2,822 
         molnupiravir |     2,708 |     2,708 
----------------------+-----------+----------
                Total |    15,438 |    15,438 
(41,485 missing values generated)
(39,297 real changes made)

                      | fail_pre_a
                      | naphylaxis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,127 |     7,127 
           sotrovimab |     2,722 |     2,722 
             paxlovid |     2,780 |     2,780 
         molnupiravir |     2,716 |     2,716 
----------------------+-----------+----------
                Total |    15,345 |    15,345 
(30,162 missing values generated)
(28,552 real changes made)

                      | fail_pre_d
                      | rugreactio
                      |     n
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    12,401 |    12,401 
           sotrovimab |     4,750 |     4,750 
             paxlovid |     4,810 |     4,810 
         molnupiravir |     4,707 |     4,707 
----------------------+-----------+----------
                Total |    26,668 |    26,668 
(42,988 missing values generated)
(40,683 real changes made)

                      | fail_pre_r
                      |     a
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,435 |     6,435 
           sotrovimab |     2,450 |     2,450 
             paxlovid |     2,437 |     2,437 
         molnupiravir |     2,520 |     2,520 
----------------------+-----------+----------
                Total |    13,842 |    13,842 
(43,037 missing values generated)
(40,735 real changes made)

                      | fail_pre_s
                      |     le
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,393 |     6,393 
           sotrovimab |     2,419 |     2,419 
             paxlovid |     2,507 |     2,507 
         molnupiravir |     2,474 |     2,474 
----------------------+-----------+----------
                Total |    13,793 |    13,793 
(43,008 missing values generated)
(40,720 real changes made)

                      | fail_pre_p
                      |  sorasis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,446 |     6,446 
           sotrovimab |     2,507 |     2,507 
             paxlovid |     2,430 |     2,430 
         molnupiravir |     2,439 |     2,439 
----------------------+-----------+----------
                Total |    13,822 |    13,822 
(42,966 missing values generated)
(40,693 real changes made)

                      | fail_pre_p
                      |     sa
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,495 |     6,495 
           sotrovimab |     2,471 |     2,471 
             paxlovid |     2,471 |     2,471 
         molnupiravir |     2,427 |     2,427 
----------------------+-----------+----------
                Total |    13,864 |    13,864 
(43,027 missing values generated)
(40,726 real changes made)

                      | fail_pre_a
                      |    xspa
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,499 |     6,499 
           sotrovimab |     2,476 |     2,476 
             paxlovid |     2,440 |     2,440 
         molnupiravir |     2,388 |     2,388 
----------------------+-----------+----------
                Total |    13,803 |    13,803 
(42,933 missing values generated)
(40,639 real changes made)

                      | fail_pre_i
                      |     bd
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,436 |     6,436 
           sotrovimab |     2,491 |     2,491 
             paxlovid |     2,520 |     2,520 
         molnupiravir |     2,450 |     2,450 
----------------------+-----------+----------
                Total |    13,897 |    13,897 
(51,163 missing values generated)
(48,411 real changes made)

                      | fail_pre_d
                      | iverticuli
                      | tis_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,662 |     2,662 
           sotrovimab |     1,000 |     1,000 
             paxlovid |     1,006 |     1,006 
         molnupiravir |       999 |       999 
----------------------+-----------+----------
                Total |     5,667 |     5,667 
(46,030 missing values generated)
(43,599 real changes made)

                      | fail_pre_d
                      | iarrhoea_s
                      |   erious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,015 |     5,015 
           sotrovimab |     1,951 |     1,951 
             paxlovid |     1,908 |     1,908 
         molnupiravir |     1,926 |     1,926 
----------------------+-----------+----------
                Total |    10,800 |    10,800 
(51,250 missing values generated)
(48,519 real changes made)

                      | fail_pre_t
                      | aste_serio
                      |     us
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,567 |     2,567 
           sotrovimab |     1,006 |     1,006 
             paxlovid |     1,003 |     1,003 
         molnupiravir |     1,004 |     1,004 
----------------------+-----------+----------
                Total |     5,580 |     5,580 
(51,100 missing values generated)
(48,373 real changes made)

                      | fail_pre_r
                      | ash_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,620 |     2,620 
           sotrovimab |     1,085 |     1,085 
             paxlovid |     1,032 |     1,032 
         molnupiravir |       993 |       993 
----------------------+-----------+----------
                Total |     5,730 |     5,730 
(41,421 missing values generated)
(39,195 real changes made)

                      | fail_pre_c
                      | ontactderm
                      |  _serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,154 |     7,154 
           sotrovimab |     2,749 |     2,749 
             paxlovid |     2,738 |     2,738 
         molnupiravir |     2,768 |     2,768 
----------------------+-----------+----------
                Total |    15,409 |    15,409 
(51,147 missing values generated)
(48,409 real changes made)

                      | fail_pre_d
                      | izziness_s
                      |   erious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,647 |     2,647 
           sotrovimab |       999 |       999 
             paxlovid |     1,062 |     1,062 
         molnupiravir |       975 |       975 
----------------------+-----------+----------
                Total |     5,683 |     5,683 
(51,095 missing values generated)
(48,358 real changes made)

                      | fail_pre_n
                      | ausea_vomi
                      | t_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,700 |     2,700 
           sotrovimab |     1,017 |     1,017 
             paxlovid |     1,020 |     1,020 
         molnupiravir |       998 |       998 
----------------------+-----------+----------
                Total |     5,735 |     5,735 
(51,084 missing values generated)
(48,352 real changes made)

                      | fail_pre_h
                      | eadache_se
                      |   rious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,660 |     2,660 
           sotrovimab |     1,011 |     1,011 
             paxlovid |     1,060 |     1,060 
         molnupiravir |     1,015 |     1,015 
----------------------+-----------+----------
                Total |     5,746 |     5,746 
(51,148 missing values generated)
(48,421 real changes made)

                      | fail_pre_a
                      | naphylaxis
                      |  _serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,653 |     2,653 
           sotrovimab |       997 |       997 
             paxlovid |     1,058 |     1,058 
         molnupiravir |       974 |       974 
----------------------+-----------+----------
                Total |     5,682 |     5,682 
(46,032 missing values generated)
(43,577 real changes made)

                      | fail_pre_d
                      | rugreactio
                      | n_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,025 |     5,025 
           sotrovimab |     1,946 |     1,946 
             paxlovid |     1,970 |     1,970 
         molnupiravir |     1,857 |     1,857 
----------------------+-----------+----------
                Total |    10,798 |    10,798 
(51,850 missing values generated)
(49,073 real changes made)

                      | fail_pre_r
                      | a_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,295 |     2,295 
           sotrovimab |       897 |       897 
             paxlovid |       878 |       878 
         molnupiravir |       910 |       910 
----------------------+-----------+----------
                Total |     4,980 |     4,980 
(51,771 missing values generated)
(49,018 real changes made)

                      | fail_pre_s
                      | le_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,374 |     2,374 
           sotrovimab |       912 |       912 
             paxlovid |       913 |       913 
         molnupiravir |       860 |       860 
----------------------+-----------+----------
                Total |     5,059 |     5,059 
(51,769 missing values generated)
(49,006 real changes made)

                      | fail_pre_p
                      | sorasis_se
                      |   rious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,355 |     2,355 
           sotrovimab |       919 |       919 
             paxlovid |       895 |       895 
         molnupiravir |       892 |       892 
----------------------+-----------+----------
                Total |     5,061 |     5,061 
(51,684 missing values generated)
(48,941 real changes made)

                      | fail_pre_p
                      | sa_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,453 |     2,453 
           sotrovimab |       886 |       886 
             paxlovid |       936 |       936 
         molnupiravir |       871 |       871 
----------------------+-----------+----------
                Total |     5,146 |     5,146 
(51,795 missing values generated)
(49,024 real changes made)

                      | fail_pre_a
                      | xspa_serio
                      |     us
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,308 |     2,308 
           sotrovimab |       924 |       924 
             paxlovid |       905 |       905 
         molnupiravir |       898 |       898 
----------------------+-----------+----------
                Total |     5,035 |     5,035 
(51,634 missing values generated)
(48,886 real changes made)

                      | fail_pre_i
                      | bd_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,407 |     2,407 
           sotrovimab |       928 |       928 
             paxlovid |       932 |       932 
         molnupiravir |       929 |       929 
----------------------+-----------+----------
                Total |     5,196 |     5,196 
(0 real changes made)

                      | fail_pre_a
                      |     ll
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,381 |    26,381 
           sotrovimab |    10,188 |    10,188 
             paxlovid |    10,222 |    10,222 
         molnupiravir |    10,039 |    10,039 
----------------------+-----------+----------
                Total |    56,830 |    56,830 
(5 missing values generated)
(5 real changes made)

                      | fail_pre_a
                      | ll_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,379 |    26,379 
           sotrovimab |    10,188 |    10,188 
             paxlovid |    10,220 |    10,220 
         molnupiravir |    10,038 |    10,038 
----------------------+-----------+----------
                Total |    56,825 |    56,825 
(2,007 missing values generated)
(1,913 real changes made)

                      | fail_pre_s
                      |   pc_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    25,436 |    25,436 
           sotrovimab |     9,814 |     9,814 
             paxlovid |     9,878 |     9,878 
         molnupiravir |     9,695 |     9,695 
----------------------+-----------+----------
                Total |    54,823 |    54,823 
(17,949 missing values generated)
(17,015 real changes made)

                      | fail_pre_s
                      | pc_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    18,018 |    18,018 
           sotrovimab |     7,015 |     7,015 
             paxlovid |     6,936 |     6,936 
         molnupiravir |     6,912 |     6,912 
----------------------+-----------+----------
                Total |    38,881 |    38,881 
(21,970 missing values generated)
(20,840 real changes made)

                      | fail_pre_d
                      |  rug_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    16,171 |    16,171 
           sotrovimab |     6,235 |     6,235 
             paxlovid |     6,308 |     6,308 
         molnupiravir |     6,146 |     6,146 
----------------------+-----------+----------
                Total |    34,860 |    34,860 
(41,462 missing values generated)
(39,255 real changes made)

                      | fail_pre_d
                      | rug_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,135 |     7,135 
           sotrovimab |     2,759 |     2,759 
             paxlovid |     2,814 |     2,814 
         molnupiravir |     2,660 |     2,660 
----------------------+-----------+----------
                Total |    15,368 |    15,368 
(10,597 missing values generated)
(10,024 real changes made)

                      | fail_pre_i
                      |  mae_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    21,512 |    21,512 
           sotrovimab |     8,261 |     8,261 
             paxlovid |     8,283 |     8,283 
         molnupiravir |     8,177 |     8,177 
----------------------+-----------+----------
                Total |    46,233 |    46,233 
(32,396 missing values generated)
(30,674 real changes made)

                      | fail_pre_i
                      | mae_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    11,407 |    11,407 
           sotrovimab |     4,366 |     4,366 
             paxlovid |     4,358 |     4,358 
         molnupiravir |     4,303 |     4,303 
----------------------+-----------+----------
                Total |    24,434 |    24,434 

. 
. * Follow-up time
. foreach x in $pre_ae_combined{
  2.                 stset stop_`x', id(patient_id) origin(time start_com
> parator) enter(time start_comparator) exit(time start_comparator_28) fa
> ilure(fail_`x'==1) 
  3.                 tab _st  
  4.                 tab _t drug if fail_`x'==1 & stop_`x'==`x'
  5.                 count if start_comparator>=stop_`x' & _st==0
  6.                 count if start_comparator==stop_`x' & _st==0
  7. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all==1
Observed time interval: (stop_pre_all[_n-1], stop_pre_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      3,039  ignored because never entered
-------------------------------------------------------------------------
> -
     53,791  observations remaining, representing
     53,791  subjects
          0  failures in single-failure-per-subject data
  1,559,939  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,039        5.35        5.35
          1 |     53,791       94.65      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    26,381      9,154      9,205      9,051 |    53,791 
-----------+--------------------------------------------+----------
     Total |    26,381      9,154      9,205      9,051 |    53,791 
  3,039
  0

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all_serious==1
Observed time interval: (stop_pre_all_serious[_n-1], stop_pre_all_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      3,039  ignored because never entered
-------------------------------------------------------------------------
> -
     53,791  observations remaining, representing
     53,791  subjects
          0  failures in single-failure-per-subject data
  1,559,939  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,039        5.35        5.35
          1 |     53,791       94.65      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    26,379      9,154      9,203      9,050 |    53,786 
-----------+--------------------------------------------+----------
     Total |    26,379      9,154      9,203      9,050 |    53,786 
  3,039
  0

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_all==1
Observed time interval: (stop_pre_spc_all[_n-1], stop_pre_spc_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
         94  event time missing (stop_pre_spc_all>=.)       PROBABLE ERRO
> R
      2,945  ignored because never entered
     16,087  observations end on or before enter()
-------------------------------------------------------------------------
> -
     37,704  observations remaining, representing
     37,704  subjects
      1,272  failures in single-failure-per-subject data
  1,074,801  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,126       33.65       33.65
          1 |     37,704       66.35      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        19          9          9          5 |        42 
         1 |        29         12          7         10 |        58 
         2 |        27          5          4          9 |        45 
         3 |        20          6          9          5 |        40 
         4 |        17          3          7          5 |        32 
         5 |        14         11          8          8 |        41 
         6 |        24          6          7          5 |        42 
         7 |        10          6          8          4 |        28 
         8 |        11          9          7         10 |        37 
         9 |        28          4         11          9 |        52 
        10 |        24          6          5          7 |        42 
        11 |        16          7         10          8 |        41 
        12 |        27          9          7          9 |        52 
        13 |        13          6          8          9 |        36 
        14 |        23          8         10          7 |        48 
        15 |        23          8         10          8 |        49 
        16 |        26          9          4          7 |        46 
        17 |        27         10          3          5 |        45 
        18 |        30         12          7         11 |        60 
        19 |        17          8          6         10 |        41 
        20 |        20          6         10          3 |        39 
        21 |        14         10         10          6 |        40 
        22 |        17          7          4          4 |        32 
        23 |        19          7          8          9 |        43 
        24 |        17         15          6          4 |        42 
        25 |        18          9          6          9 |        42 
        26 |        18          9          8          5 |        40 
        27 |        10          6          5          9 |        30 
        28 |        32          5          2          7 |        46 
        29 |    16,959      5,888      5,860      5,853 |    34,560 
-----------+--------------------------------------------+----------
     Total |    17,549      6,116      6,066      6,060 |    35,791 
  19,126
  94

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_serious==1
Observed time interval: (stop_pre_spc_serious[_n-1], stop_pre_spc_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
        934  event time missing (stop_pre_spc_serious>=.)   PROBABLE ERRO
> R
      2,105  ignored because never entered
      7,585  observations end on or before enter()
-------------------------------------------------------------------------
> -
     46,206  observations remaining, representing
     46,206  subjects
        665  failures in single-failure-per-subject data
  1,329,957  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,624       18.69       18.69
          1 |     46,206       81.31      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         6          3          4          3 |        16 
         1 |        16          8          4          8 |        36 
         2 |        14          4          3          6 |        27 
         3 |        11          3          2          4 |        20 
         4 |        12          4          4          6 |        26 
         5 |        10          5          7          5 |        27 
         6 |        20          1          7          2 |        30 
         7 |         7          3          4          3 |        17 
         8 |         8          2          4          5 |        19 
         9 |        16          4          2          3 |        25 
        10 |        12          2          5          3 |        22 
        11 |         8          8          7          4 |        27 
        12 |        12          5          4          4 |        25 
        13 |         9          3          2          5 |        19 
        14 |         7          5          6          4 |        22 
        15 |         7          2          5          3 |        17 
        16 |        12          3          3          5 |        23 
        17 |        13          3          1          1 |        18 
        18 |        17          4          6          4 |        31 
        19 |         8          5          3          3 |        19 
        20 |         6          4          2          2 |        14 
        21 |         3          5          7          2 |        17 
        22 |         3          2          3          4 |        12 
        23 |         6          4          6          2 |        18 
        24 |        13          6          6          1 |        26 
        25 |        12          3          6          4 |        25 
        26 |        15          2          3          3 |        23 
        27 |         0          5          2          4 |        11 
        28 |        18          2          2          3 |        25 
        29 |    13,986      4,913      4,807      4,848 |    28,554 
-----------+--------------------------------------------+----------
     Total |    14,287      5,023      4,927      4,954 |    29,191 
  10,624
  934

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_all==1
Observed time interval: (stop_pre_drug_all[_n-1], stop_pre_drug_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      1,130  event time missing (stop_pre_drug_all>=.)      PROBABLE ERRO
> R
      1,909  ignored because never entered
      4,792  observations end on or before enter()
-------------------------------------------------------------------------
> -
     48,999  observations remaining, representing
     48,999  subjects
        411  failures in single-failure-per-subject data
  1,414,892  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,831       13.78       13.78
          1 |     48,999       86.22      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         7          4          2          2 |        15 
         1 |         9          3          3          2 |        17 
         2 |        10          2          1          2 |        15 
         3 |         7          2          5          1 |        15 
         4 |         4          0          4          2 |        10 
         5 |         6          3          2          1 |        12 
         6 |         8          1          2          0 |        11 
         7 |         2          1          5          0 |         8 
         8 |         5          3          5          3 |        16 
         9 |        11          0          4          1 |        16 
        10 |         8          3          1          2 |        14 
        11 |         7          0          4          3 |        14 
        12 |         8          2          1          1 |        12 
        13 |         6          4          2          2 |        14 
        14 |         6          3          3          4 |        16 
        15 |         9          3          2          3 |        17 
        16 |         9          5          1          4 |        19 
        17 |         8          5          2          3 |        18 
        18 |         6          4          0          5 |        15 
        19 |         3          3          6          4 |        16 
        20 |         4          2          4          0 |        10 
        21 |         4          2          1          2 |         9 
        22 |        11          2          2          1 |        16 
        23 |        11          3          2          2 |        18 
        24 |         1          3          1          4 |         9 
        25 |         3          6          1          4 |        14 
        26 |         3          4          3          0 |        10 
        27 |         4          2          3          2 |        11 
        28 |         9          2          0          3 |        14 
        29 |    13,686      4,699      4,720      4,653 |    27,758 
-----------+--------------------------------------------+----------
     Total |    13,875      4,776      4,792      4,716 |    28,159 
  7,831
  1,130

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_serious==1
Observed time interval: (stop_pre_drug_serious[_n-1], stop_pre_drug_serio
> us]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,207  event time missing (stop_pre_drug_serious>=.)  PROBABLE ERRO
> R
        832  ignored because never entered
      2,456  observations end on or before enter()
-------------------------------------------------------------------------
> -
     51,335  observations remaining, representing
     51,335  subjects
        213  failures in single-failure-per-subject data
  1,485,568  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,495        9.67        9.67
          1 |     51,335       90.33      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         5          2          1          1 |         9 
         1 |         6          2          1          0 |         9 
         2 |         2          1          1          2 |         6 
         3 |         2          1          2          1 |         6 
         4 |         1          0          1          3 |         5 
         5 |         4          2          1          0 |         7 
         6 |         3          1          1          0 |         5 
         7 |         0          0          4          0 |         4 
         8 |         3          2          2          0 |         7 
         9 |         8          0          0          1 |         9 
        10 |         5          2          0          0 |         7 
        11 |         4          0          2          1 |         7 
        12 |         4          1          0          0 |         5 
        13 |         3          3          0          2 |         8 
        14 |         3          3          0          1 |         7 
        15 |         4          1          1          3 |         9 
        16 |         6          4          1          2 |        13 
        17 |         5          3          2          3 |        13 
        18 |         6          2          0          4 |        12 
        19 |         1          3          3          1 |         8 
        20 |         1          1          2          1 |         5 
        21 |         2          1          0          0 |         3 
        22 |         4          1          2          0 |         7 
        23 |         7          1          0          0 |         8 
        24 |         1          2          2          3 |         8 
        25 |         2          3          0          0 |         5 
        26 |         1          1          3          1 |         6 
        27 |         2          1          1          1 |         5 
        28 |         3          2          0          1 |         6 
        29 |     5,862      2,011      2,040      1,958 |    11,871 
-----------+--------------------------------------------+----------
     Total |     5,960      2,057      2,073      1,990 |    12,080 
  5,495
  2,207

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_all==1
Observed time interval: (stop_pre_imae_all[_n-1], stop_pre_imae_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
        573  event time missing (stop_pre_imae_all>=.)      PROBABLE ERRO
> R
      2,466  ignored because never entered
      8,407  observations end on or before enter()
-------------------------------------------------------------------------
> -
     45,384  observations remaining, representing
     45,384  subjects
        626  failures in single-failure-per-subject data
  1,307,051  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,446       20.14       20.14
          1 |     45,384       79.86      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        14          5          3          5 |        27 
         1 |        13          5          3          4 |        25 
         2 |         7          2          6          6 |        21 
         3 |         8          7          3          5 |        23 
         4 |         6          2          5          5 |        18 
         5 |        14          4          1          7 |        26 
         6 |        10          4          2          4 |        20 
         7 |         5          6          4          4 |        19 
         8 |         7          2          3          6 |        18 
         9 |        11          1          1          1 |        14 
        10 |        11          2          6          3 |        22 
        11 |        11          2          1          3 |        17 
        12 |        11          1          3          2 |        17 
        13 |         8          5          1          3 |        17 
        14 |        12          3          5          3 |        23 
        15 |        13          3          4          5 |        25 
        16 |         9          2          3          6 |        20 
        17 |        18          7          3          2 |        30 
        18 |         7          4          1          0 |        12 
        19 |        12          4          4          6 |        26 
        20 |         6          2          2          3 |        13 
        21 |         7          6          4          5 |        22 
        22 |         6          2          1          5 |        14 
        23 |         8          5          7          2 |        22 
        24 |         9          2          2          4 |        17 
        25 |        17          2          3          3 |        25 
        26 |        11          5          6          4 |        26 
        27 |        10          8          3          3 |        24 
        28 |        12          0          3          6 |        21 
        29 |    17,104      5,894      5,958      5,800 |    34,756 
-----------+--------------------------------------------+----------
     Total |    17,397      5,997      6,051      5,915 |    35,360 
  11,446
  573

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_serious==1
Observed time interval: (stop_pre_imae_serious[_n-1], stop_pre_imae_serio
> us]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      1,722  event time missing (stop_pre_imae_serious>=.)  PROBABLE ERRO
> R
      1,317  ignored because never entered
      4,446  observations end on or before enter()
-------------------------------------------------------------------------
> -
     49,345  observations remaining, representing
     49,345  subjects
        319  failures in single-failure-per-subject data
  1,426,366  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,485       13.17       13.17
          1 |     49,345       86.83      100.00
------------+-----------------------------------
      Total |     56,830      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         7          3          2          2 |        14 
         1 |         7          2          2          2 |        13 
         2 |         4          1          2          2 |         9 
         3 |         4          1          2          4 |        11 
         4 |         3          0          3          2 |         8 
         5 |         5          0          1          4 |        10 
         6 |         8          1          2          1 |        12 
         7 |         5          4          2          2 |        13 
         8 |         4          1          3          4 |        12 
         9 |         5          2          1          1 |         9 
        10 |         4          1          3          2 |        10 
        11 |         4          1          2          2 |         9 
        12 |         7          1          1          2 |        11 
        13 |         2          4          1          1 |         8 
        14 |         5          1          2          1 |         9 
        15 |         3          1          3          3 |        10 
        16 |         5          0          2          3 |        10 
        17 |        10          4          2          1 |        17 
        18 |         3          1          0          0 |         4 
        19 |         6          1          2          2 |        11 
        20 |         6          2          1          1 |        10 
        21 |         4          4          0          4 |        12 
        22 |         6          1          1          5 |        13 
        23 |         5          2          3          2 |        12 
        24 |         3          2          0          2 |         7 
        25 |         7          1          2          0 |        10 
        26 |         3          2          2          3 |        10 
        27 |         2          5          2          2 |        11 
        28 |         5          1          1          4 |        11 
        29 |     9,063      3,118      3,137      3,047 |    18,365 
-----------+--------------------------------------------+----------
     Total |     9,205      3,168      3,187      3,111 |    18,671 
  7,485
  1,722

. 
. ********************************************************
. *       RATES OF EVENTS         *
. ********************************************************
. tempname comparator_rates

. postfile `comparator_rates' str20(failure) ///
>                 all_ptime all_events all_rate all_lci all_uci ///
>                 control_ptime control_events control_rate control_lci_ 
> control_uci ///
>                 sot_ptime sot_events sot_rate sot_lci sot_uci ///
>                 pax_ptime pax_events pax_rate pax_lci pax_uci ///
>                 mol_ptime mol_events mol_rate mol_lci mol_uci ///
>                 using "$projectdir/output/tables/comparator_rates", rep
> lace     

.         
. foreach fail in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combine
> d{
  2.         stset stop_`fail', id(patient_id) origin(time start_comparat
> or) enter(time start_comparator) exit(time start_comparator_28) failure
> (fail_`fail'==1)                     
  3.                 stptime 
  4.                                         local all_rate = `r(rate)'
  5.                                         local all_ptime = `r(ptime)'
  6.                                         local all_lci = `r(lb)'
  7.                                         local all_uci = `r(ub)'
  8.                                         local all_events = `r(failur
> es)'                                        
  9.                 stptime if drug == 0
 10.                                         local control_rate = `r(rate
> )'
 11.                                         local control_ptime = `r(pti
> me)'
 12.                                         local control_lci = `r(lb)'
 13.                                         local control_uci = `r(ub)'
 14.                                         local control_events = `r(fa
> ilures)'
 15.                 display "no drug"
 16.                 stptime if drug == 1
 17.                                         local sot_rate = `r(rate)'
 18.                                         local sot_ptime = `r(ptime)'
 19.                                         local sot_lci = `r(lb)'
 20.                                         local sot_uci = `r(ub)'
 21.                                         local sot_events = `r(failur
> es)'
 22.                 display "sotrovimab"
 23.                 stptime if drug == 2
 24.                                         local pax_rate = `r(rate)'
 25.                                         local pax_ptime = `r(ptime)'
 26.                                         local pax_lci = `r(lb)'
 27.                                         local pax_uci = `r(ub)'
 28.                                         local pax_events = `r(failur
> es)'                
 29.                 display "paxlovid"
 30.                 stptime if drug == 3
 31.                                         local mol_rate = `r(rate)'
 32.                                         local mol_ptime = `r(ptime)'
 33.                                         local mol_lci = `r(lb)'
 34.                                         local mol_uci = `r(ub)'
 35.                                         local mol_events = `r(failur
> es)'                
 36.                 display "molnupavir"                    
 37.                 post `comparator_rates' ("`fail'")      (`all_ptime'
> ) (`all_events') (`all_rate') (`all_lci') (`all_uci') ///
>                                         (`control_ptime') (`control_eve
> nts') (`control_rate') (`control_lci') (`control_uci') ///
>                                         (`sot_ptime') (`sot_events') (`
> sot_rate') (`sot_lci') (`sot_uci') ///
>                                         (`pax_ptime') (`pax_events') (`
> pax_rate') (`pax_lci') (`pax_uci') ///
>                                         (`mol_ptime') (`mol_events') (`
> mol_rate') (`mol_lci') (`mol_uci')       
 38.                                         
. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diverticulitis==1
Observed time interval: (stop_pre_diverticulitis[_n-1], stop_pre_divertic
> ulitis]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,234  event time missing (stop_pre_diverticulitis>=.)PROBABLE ERRO
> R
        805  ignored because never entered
      1,629  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,162  observations remaining, representing
     52,162  subjects
        149  failures in single-failure-per-subject data
  1,510,724  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1510724.3        149   .00009863    .000084    .0001158

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    740812.75         77   .00010394   .0000831      .00013
no drug

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257300.75         21   .00008162   .0000532    .0001252
sotrovimab

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258373         20   .00007741   .0000499      .00012
paxlovid

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    254237.75         31   .00012193   .0000858    .0001734
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diarrhoea==1
Observed time interval: (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,159  event time missing (stop_pre_diarrhoea>=.)     PROBABLE ERRO
> R
        880  ignored because never entered
      2,452  observations end on or before enter()
-------------------------------------------------------------------------
> -
     51,339  observations remaining, representing
     51,339  subjects
        223  failures in single-failure-per-subject data
  1,485,646  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1485645.8        223    .0001501   .0001316    .0001712

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       729137        103   .00014126   .0001165    .0001714
no drug

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       252468         42   .00016636   .0001229    .0002251
sotrovimab

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    253708.75         37   .00014584   .0001057    .0002013
paxlovid

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       250332         41   .00016378   .0001206    .0002224
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_taste==1
Observed time interval: (stop_pre_taste[_n-1], stop_pre_taste]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,464  event time missing (stop_pre_taste>=.)         PROBABLE ERRO
> R
        575  ignored because never entered
      1,633  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,158  observations remaining, representing
     52,158  subjects
        169  failures in single-failure-per-subject data
  1,510,132  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1510132.3        169   .00011191   .0000962    .0001301

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       740520         76   .00010263    .000082    .0001285
no drug

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257370.75         31   .00012045   .0000847    .0001713
sotrovimab

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     258833.5         28   .00010818   .0000747    .0001567
paxlovid

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       253408         34   .00013417   .0000959    .0001878
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_rash==1
Observed time interval: (stop_pre_rash[_n-1], stop_pre_rash]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,227  event time missing (stop_pre_rash>=.)          PROBABLE ERRO
> R
        812  ignored because never entered
      1,684  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,107  observations remaining, representing
     52,107  subjects
        152  failures in single-failure-per-subject data
  1,508,649  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1508648.5        152   .00010075   .0000859    .0001181

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     739965.5         70    .0000946   .0000748    .0001196
no drug

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     256816.5         30   .00011681   .0000817    .0001671
sotrovimab

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     258232.5         33   .00012779   .0000909    .0001798
paxlovid

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       253634         19   .00007491   .0000478    .0001174
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_bronchospasm==1
Observed time interval: (stop_pre_bronchospasm[_n-1], stop_pre_bronchospa
> sm]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,729  event time missing (stop_pre_bronchospasm>=.)  PROBABLE ERRO
> R
        310  ignored because never entered
        845  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,946  observations remaining, representing
     52,946  subjects
         91  failures in single-failure-per-subject data
  1,534,137  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1534137         91   .00005932   .0000483    .0000728

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    752344.25         48    .0000638   .0000481    .0000847
no drug

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       260622         11   .00004221   .0000234    .0000762
sotrovimab

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    263224.75         16   .00006078   .0000372    .0000992
paxlovid

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257946         16   .00006203    .000038    .0001012
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_contactderm==1
Observed time interval: (stop_pre_contactderm[_n-1], stop_pre_contactderm
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,226  event time missing (stop_pre_contactderm>=.)   PROBABLE ERRO
> R
        813  ignored because never entered
      1,655  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,136  observations remaining, representing
     52,136  subjects
        150  failures in single-failure-per-subject data
  1,509,511  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1509511        150   .00009937   .0000847    .0001166

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    741607.75         68   .00009169   .0000723    .0001163
no drug

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257024         16   .00006225   .0000381    .0001016
sotrovimab

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257751.25         36   .00013967   .0001007    .0001936
paxlovid

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       253128         30   .00011852   .0000829    .0001695
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_dizziness==1
Observed time interval: (stop_pre_dizziness[_n-1], stop_pre_dizziness]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,239  event time missing (stop_pre_dizziness>=.)     PROBABLE ERRO
> R
        800  ignored because never entered
      1,717  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,074  observations remaining, representing
     52,074  subjects
        146  failures in single-failure-per-subject data
  1,508,185  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1508185.3        146   .00009681   .0000823    .0001139

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     739396.5         76   .00010279   .0000821    .0001287
no drug

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    256369.75         28   .00010922   .0000754    .0001582
sotrovimab

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257703         22   .00008537   .0000562    .0001297
paxlovid

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       254716         20   .00007852   .0000507    .0001217
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_nausea_vomit==1
Observed time interval: (stop_pre_nausea_vomit[_n-1], stop_pre_nausea_vom
> it]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,490  event time missing (stop_pre_nausea_vomit>=.)  PROBABLE ERRO
> R
        549  ignored because never entered
      1,705  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,086  observations remaining, representing
     52,086  subjects
        148  failures in single-failure-per-subject data
  1,508,385  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1508385        148   .00009812   .0000835    .0001153

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    738819.25         71    .0000961   .0000762    .0001213
no drug

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     257088.5         27   .00010502    .000072    .0001531
sotrovimab

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257977.75         33   .00012792   .0000909    .0001799
paxlovid

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     254499.5         17    .0000668   .0000415    .0001075
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_headache==1
Observed time interval: (stop_pre_headache[_n-1], stop_pre_headache]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,219  event time missing (stop_pre_headache>=.)      PROBABLE ERRO
> R
        820  ignored because never entered
      1,712  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,079  observations remaining, representing
     52,079  subjects
        134  failures in single-failure-per-subject data
  1,508,397  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1508396.8        134   .00008884    .000075    .0001052

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    739321.75         62   .00008386   .0000654    .0001076
no drug

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    256871.75         20   .00007786   .0000502    .0001207
sotrovimab

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258214         23   .00008907   .0000592     .000134
paxlovid

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    253989.25         29   .00011418   .0000793    .0001643
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_anaphylaxis==1
Observed time interval: (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,188  event time missing (stop_pre_anaphylaxis>=.)   PROBABLE ERRO
> R
        851  ignored because never entered
      1,631  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,160  observations remaining, representing
     52,160  subjects
        138  failures in single-failure-per-subject data
  1,510,611  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1510610.5        138   .00009135   .0000773    .0001079

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     741919.5         64   .00008626   .0000675    .0001102
no drug

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    256802.25         30   .00011682   .0000817    .0001671
sotrovimab

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257721         23   .00008924   .0000593    .0001343
paxlovid

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    254167.75         21   .00008262   .0000539    .0001267
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drugreaction==1
Observed time interval: (stop_pre_drugreaction[_n-1], stop_pre_drugreacti
> on]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      1,610  event time missing (stop_pre_drugreaction>=.)  PROBABLE ERRO
> R
      1,429  ignored because never entered
      3,264  observations end on or before enter()
-------------------------------------------------------------------------
> -
     50,527  observations remaining, representing
     50,527  subjects
        296  failures in single-failure-per-subject data
  1,460,885  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1460884.5        296   .00020262   .0001808    .0002271

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    717133.75        139   .00019383   .0001641    .0002289
no drug

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     249505.5         56   .00022444   .0001727    .0002916
sotrovimab

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     249003.5         50    .0002008   .0001522    .0002649
paxlovid

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    245241.75         51   .00020796    .000158    .0002736
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ra==1
Observed time interval: (stop_pre_ra[_n-1], stop_pre_ra]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,305  event time missing (stop_pre_ra>=.)            PROBABLE ERRO
> R
        734  ignored because never entered
      1,518  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,273  observations remaining, representing
     52,273  subjects
        105  failures in single-failure-per-subject data
  1,514,442  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1514442.3        105   .00006933   .0000573    .0000839

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    742058.75         51   .00006873   .0000522    .0000904
no drug

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257748.75         16   .00006208    .000038    .0001013
sotrovimab

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    259670.75         15   .00005777   .0000348    .0000958
paxlovid

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       254964         23   .00009021   .0000599    .0001357
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_sle==1
Observed time interval: (stop_pre_sle[_n-1], stop_pre_sle]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,302  event time missing (stop_pre_sle>=.)           PROBABLE ERRO
> R
        737  ignored because never entered
      1,510  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,281  observations remaining, representing
     52,281  subjects
        117  failures in single-failure-per-subject data
  1,514,530  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1514529.5        117   .00007725   .0000644    .0000926

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    742391.75         56   .00007543   .0000581     .000098
no drug

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257693.75         22   .00008537   .0000562    .0001297
sotrovimab

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       259325         16    .0000617   .0000378    .0001007
paxlovid

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       255119         23   .00009015   .0000599    .0001357
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psorasis==1
Observed time interval: (stop_pre_psorasis[_n-1], stop_pre_psorasis]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,288  event time missing (stop_pre_psorasis>=.)      PROBABLE ERRO
> R
        751  ignored because never entered
      1,509  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,282  observations remaining, representing
     52,282  subjects
        124  failures in single-failure-per-subject data
  1,514,374  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1514373.5        124   .00008188   .0000687    .0000976

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    742583.25         55   .00007407   .0000569    .0000965
no drug

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     257836.5         19   .00007369    .000047    .0001155
sotrovimab

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       259267         24   .00009257    .000062    .0001381
paxlovid

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    254686.75         26   .00010209   .0000695    .0001499
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psa==1
Observed time interval: (stop_pre_psa[_n-1], stop_pre_psa]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,273  event time missing (stop_pre_psa>=.)           PROBABLE ERRO
> R
        766  ignored because never entered
      1,505  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,286  observations remaining, representing
     52,286  subjects
        105  failures in single-failure-per-subject data
  1,514,768  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1514767.5        105   .00006932   .0000572    .0000839

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     742800.5         57   .00007674   .0000592    .0000995
no drug

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257778.75         23   .00008922   .0000593    .0001343
sotrovimab

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    259660.75         10   .00003851   .0000207    .0000716
paxlovid

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     254527.5         15   .00005893   .0000355    .0000978
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_axspa==1
Observed time interval: (stop_pre_axspa[_n-1], stop_pre_axspa]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,301  event time missing (stop_pre_axspa>=.)         PROBABLE ERRO
> R
        738  ignored because never entered
      1,545  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,246  observations remaining, representing
     52,246  subjects
        132  failures in single-failure-per-subject data
  1,513,109  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1513109        132   .00008724   .0000736    .0001035

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    742766.25         58   .00007809   .0000604     .000101
no drug

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257667         25   .00009702   .0000656    .0001436
sotrovimab

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258297         29   .00011227    .000078    .0001616
paxlovid

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    254378.75         20   .00007862   .0000507    .0001219
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ibd==1
Observed time interval: (stop_pre_ibd[_n-1], stop_pre_ibd]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,294  event time missing (stop_pre_ibd>=.)           PROBABLE ERRO
> R
        745  ignored because never entered
      1,617  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,174  observations remaining, representing
     52,174  subjects
        150  failures in single-failure-per-subject data
  1,510,910  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1510909.5        150   .00009928   .0000846    .0001165

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     741126.5         83   .00011199   .0000903    .0001389
no drug

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257042.75         23   .00008948   .0000595    .0001347
sotrovimab

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     259091.5         15   .00005789   .0000349     .000096
paxlovid

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    253648.75         29   .00011433   .0000795    .0001645
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diverticulitis_serious==1
Observed time interval: (stop_pre_diverticulitis_serious[_n-1], stop_pre_
> diverticulitis_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,752  event time missing (stop_pre_diverticulitis_serious>=.)PROBA
> BLE ERROR
        287  ignored because never entered
        788  observations end on or before enter()
-------------------------------------------------------------------------
> -
     53,003  observations remaining, representing
     53,003  subjects
         79  failures in single-failure-per-subject data
  1,536,117  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1536116.5         79   .00005143   .0000413    .0000641

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    753331.75         42   .00005575   .0000412    .0000754
no drug

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    261624.75         12   .00004587    .000026    .0000808
sotrovimab

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262623         14   .00005331   .0000316      .00009
paxlovid

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258537         11   .00004255   .0000236    .0000768
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diarrhoea_serious==1
Observed time interval: (stop_pre_diarrhoea_serious[_n-1], stop_pre_diarr
> hoea_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,431  event time missing (stop_pre_diarrhoea_serious>=.)PROBABLE E
> RROR
        608  ignored because never entered
      1,645  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,146  observations remaining, representing
     52,146  subjects
        145  failures in single-failure-per-subject data
  1,510,003  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1510003.3        145   .00009603   .0000816     .000113

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    740996.25         70   .00009447   .0000747    .0001194
no drug

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       256771         27   .00010515   .0000721    .0001533
sotrovimab

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258104         23   .00008911   .0000592    .0001341
paxlovid

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       254132         25   .00009837   .0000665    .0001456
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_taste_serious==1
Observed time interval: (stop_pre_taste_serious[_n-1], stop_pre_taste_ser
> ious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,731  event time missing (stop_pre_taste_serious>=.) PROBABLE ERRO
> R
        308  ignored because never entered
        805  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,986  observations remaining, representing
     52,986  subjects
         91  failures in single-failure-per-subject data
  1,535,200  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1535199.5         91   .00005928   .0000483    .0000728

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     752466.5         45    .0000598   .0000447    .0000801
no drug

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261682         17   .00006496   .0000404    .0001045
sotrovimab

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262975         13   .00004943   .0000287    .0000851
paxlovid

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258076         16     .000062    .000038    .0001012
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_rash_serious==1
Observed time interval: (stop_pre_rash_serious[_n-1], stop_pre_rash_serio
> us]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,727  event time missing (stop_pre_rash_serious>=.)  PROBABLE ERRO
> R
        312  ignored because never entered
        818  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,973  observations remaining, representing
     52,973  subjects
         88  failures in single-failure-per-subject data
  1,534,756  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1534756.3         88   .00005734   .0000465    .0000707

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       752862         37   .00004915   .0000356    .0000678
no drug

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     260995.5         23   .00008812   .0000586    .0001326
sotrovimab

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    262346.75         17    .0000648   .0000403    .0001042
paxlovid

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258552         11   .00004254   .0000236    .0000768
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_contactderm_serious==1
Observed time interval: (stop_pre_contactderm_serious[_n-1], stop_pre_con
> tactderm_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,226  event time missing (stop_pre_contactderm_serious>=.)PROBABLE
>  ERROR
        813  ignored because never entered
      1,655  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,136  observations remaining, representing
     52,136  subjects
        150  failures in single-failure-per-subject data
  1,509,511  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1509511        150   .00009937   .0000847    .0001166

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    741607.75         68   .00009169   .0000723    .0001163
no drug

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257024         16   .00006225   .0000381    .0001016
sotrovimab

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257751.25         36   .00013967   .0001007    .0001936
paxlovid

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       253128         30   .00011852   .0000829    .0001695
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_dizziness_serious==1
Observed time interval: (stop_pre_dizziness_serious[_n-1], stop_pre_dizzi
> ness_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,738  event time missing (stop_pre_dizziness_serious>=.)PROBABLE E
> RROR
        301  ignored because never entered
        877  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,914  observations remaining, representing
     52,914  subjects
         78  failures in single-failure-per-subject data
  1,533,470  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1533469.8         78   .00005087   .0000407    .0000635

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    751555.75         40   .00005322    .000039    .0000726
no drug

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261061         11   .00004214   .0000233    .0000761
sotrovimab

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262132         17   .00006485   .0000403    .0001043
paxlovid

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258721         10   .00003865   .0000208    .0000718
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_nausea_vomit_serious==1
Observed time interval: (stop_pre_nausea_vomit_serious[_n-1], stop_pre_na
> usea_vomit_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,737  event time missing (stop_pre_nausea_vomit_serious>=.)PROBABL
> E ERROR
        302  ignored because never entered
        864  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,927  observations remaining, representing
     52,927  subjects
         60  failures in single-failure-per-subject data
  1,533,986  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1533986.3         60   .00003911   .0000304    .0000504

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    751842.75         24   .00003192   .0000214    .0000476
no drug

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261245          9   .00003445   .0000179    .0000662
sotrovimab

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262564         17   .00006475   .0000403    .0001042
paxlovid

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     258334.5         10   .00003871   .0000208    .0000719
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_headache_serious==1
Observed time interval: (stop_pre_headache_serious[_n-1], stop_pre_headac
> he_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,732  event time missing (stop_pre_headache_serious>=.)PROBABLE ER
> ROR
        307  ignored because never entered
        851  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,940  observations remaining, representing
     52,940  subjects
         74  failures in single-failure-per-subject data
  1,534,200  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1534200.3         74   .00004823   .0000384    .0000606

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    752431.75         37   .00004917   .0000356    .0000679
no drug

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    260874.75         11   .00004217   .0000234    .0000761
sotrovimab

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262663         10   .00003807   .0000205    .0000708
paxlovid

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    258230.75         16   .00006196    .000038    .0001011
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_anaphylaxis_serious==1
Observed time interval: (stop_pre_anaphylaxis_serious[_n-1], stop_pre_ana
> phylaxis_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,727  event time missing (stop_pre_anaphylaxis_serious>=.)PROBABLE
>  ERROR
        312  ignored because never entered
        812  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,979  observations remaining, representing
     52,979  subjects
         66  failures in single-failure-per-subject data
  1,535,421  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1535420.5         66   .00004298   .0000338    .0000547

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       753479         30   .00003982   .0000278    .0000569
no drug

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    261064.75         14   .00005363   .0000318    .0000905
sotrovimab

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262117         11   .00004197   .0000232    .0000758
paxlovid

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    258759.75         11   .00004251   .0000235    .0000768
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drugreaction_serious==1
Observed time interval: (stop_pre_drugreaction_serious[_n-1], stop_pre_dr
> ugreaction_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,455  event time missing (stop_pre_drugreaction_serious>=.)PROBABL
> E ERROR
        584  ignored because never entered
      1,664  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,127  observations remaining, representing
     52,127  subjects
        155  failures in single-failure-per-subject data
  1,509,406  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1509406.3        155   .00010269   .0000877    .0001202

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    740614.75         72   .00009722   .0000772    .0001225
no drug

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257378.75         36   .00013987   .0001009    .0001939
sotrovimab

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    257722.75         22   .00008536   .0000562    .0001296
paxlovid

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       253690         25   .00009855   .0000666    .0001458
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ra_serious==1
Observed time interval: (stop_pre_ra_serious[_n-1], stop_pre_ra_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,777  event time missing (stop_pre_ra_serious>=.)    PROBABLE ERRO
> R
        262  ignored because never entered
        740  observations end on or before enter()
-------------------------------------------------------------------------
> -
     53,051  observations remaining, representing
     53,051  subjects
         47  failures in single-failure-per-subject data
  1,537,905  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1537904.8         47   .00003056    .000023    .0000407

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       753907         21   .00002785   .0000182    .0000427
no drug

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    261752.75          7   .00002674   .0000127    .0000561
sotrovimab

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       263393          9   .00003417   .0000178    .0000657
paxlovid

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258852         10   .00003863   .0000208    .0000718
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_sle_serious==1
Observed time interval: (stop_pre_sle_serious[_n-1], stop_pre_sle_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,753  event time missing (stop_pre_sle_serious>=.)   PROBABLE ERRO
> R
        286  ignored because never entered
        753  observations end on or before enter()
-------------------------------------------------------------------------
> -
     53,038  observations remaining, representing
     53,038  subjects
         48  failures in single-failure-per-subject data
  1,537,413  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1537412.8         48   .00003122   .0000235    .0000414

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    753637.75         27   .00003583   .0000246    .0000522
no drug

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261507          4    .0000153   5.74e-06    .0000408
sotrovimab

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       263413          6   .00002278   .0000102    .0000507
paxlovid

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258855         11   .00004249   .0000235    .0000767
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psorasis_serious==1
Observed time interval: (stop_pre_psorasis_serious[_n-1], stop_pre_psoras
> is_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,763  event time missing (stop_pre_psorasis_serious>=.)PROBABLE ER
> ROR
        276  ignored because never entered
        775  observations end on or before enter()
-------------------------------------------------------------------------
> -
     53,016  observations remaining, representing
     53,016  subjects
         59  failures in single-failure-per-subject data
  1,536,642  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1536642         59    .0000384   .0000297    .0000496

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    753291.25         26   .00003452   .0000235    .0000507
no drug

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261683          7   .00002675   .0000128    .0000561
sotrovimab

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       263176         12    .0000456   .0000259    .0000803
paxlovid

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    258491.75         14   .00005416   .0000321    .0000914
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psa_serious==1
Observed time interval: (stop_pre_psa_serious[_n-1], stop_pre_psa_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,743  event time missing (stop_pre_psa_serious>=.)   PROBABLE ERRO
> R
        296  ignored because never entered
        762  observations end on or before enter()
-------------------------------------------------------------------------
> -
     53,029  observations remaining, representing
     53,029  subjects
         50  failures in single-failure-per-subject data
  1,537,157  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1537156.5         50   .00003253   .0000247    .0000429

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       753343         25   .00003319   .0000224    .0000491
no drug

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    261780.75         12   .00004584    .000026    .0000807
sotrovimab

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    263144.75          6    .0000228   .0000102    .0000508
paxlovid

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       258888          7   .00002704   .0000129    .0000567
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_axspa_serious==1
Observed time interval: (stop_pre_axspa_serious[_n-1], stop_pre_axspa_ser
> ious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,771  event time missing (stop_pre_axspa_serious>=.) PROBABLE ERRO
> R
        268  ignored because never entered
        777  observations end on or before enter()
-------------------------------------------------------------------------
> -
     53,014  observations remaining, representing
     53,014  subjects
         64  failures in single-failure-per-subject data
  1,536,387  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1536387.3         64   .00004166   .0000326    .0000532

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     754239.5         24   .00003182   .0000213    .0000475
no drug

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       261082         13   .00004979   .0000289    .0000858
sotrovimab

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262655         13   .00004949   .0000287    .0000852
paxlovid

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    258410.75         14   .00005418   .0000321    .0000915
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ibd_serious==1
Observed time interval: (stop_pre_ibd_serious[_n-1], stop_pre_ibd_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,748  event time missing (stop_pre_ibd_serious>=.)   PROBABLE ERRO
> R
        291  ignored because never entered
        844  observations end on or before enter()
-------------------------------------------------------------------------
> -
     52,947  observations remaining, representing
     52,947  subjects
         74  failures in single-failure-per-subject data
  1,534,321  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1534321         74   .00004823   .0000384    .0000606

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    752536.75         38    .0000505   .0000367    .0000694
no drug

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    260950.75         13   .00004982   .0000289    .0000858
sotrovimab

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     263142.5          8    .0000304   .0000152    .0000608
paxlovid

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       257691         15   .00005821   .0000351    .0000966
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all==1
Observed time interval: (stop_pre_all[_n-1], stop_pre_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      3,039  ignored because never entered
-------------------------------------------------------------------------
> -
     53,791  observations remaining, representing
     53,791  subjects
          0  failures in single-failure-per-subject data
  1,559,939  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1559939          0           0          .           .

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       765049          0           0          .           .
no drug

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       265466          0           0          .           .
sotrovimab

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       266945          0           0          .           .
paxlovid

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262479          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all_serious==1
Observed time interval: (stop_pre_all_serious[_n-1], stop_pre_all_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      3,039  ignored because never entered
-------------------------------------------------------------------------
> -
     53,791  observations remaining, representing
     53,791  subjects
          0  failures in single-failure-per-subject data
  1,559,939  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1559939          0           0          .           .

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       765049          0           0          .           .
no drug

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       265466          0           0          .           .
sotrovimab

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       266945          0           0          .           .
paxlovid

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       262479          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_all==1
Observed time interval: (stop_pre_spc_all[_n-1], stop_pre_spc_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
         94  event time missing (stop_pre_spc_all>=.)       PROBABLE ERRO
> R
      2,945  ignored because never entered
     16,087  observations end on or before enter()
-------------------------------------------------------------------------
> -
     37,704  observations remaining, representing
     37,704  subjects
      1,272  failures in single-failure-per-subject data
  1,074,801  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1074800.5       1272   .00118348   .0011202    .0012503

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    527376.25        612   .00116046   .0010721    .0012561
no drug

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    184001.75        231   .00125542   .0011035    .0014282
sotrovimab

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    181841.75        213   .00117135   .0010241    .0013397
paxlovid

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    181580.75        216   .00118955    .001041    .0013593
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_serious==1
Observed time interval: (stop_pre_spc_serious[_n-1], stop_pre_spc_serious
> ]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
        934  event time missing (stop_pre_spc_serious>=.)   PROBABLE ERRO
> R
      2,105  ignored because never entered
      7,585  observations end on or before enter()
-------------------------------------------------------------------------
> -
     46,206  observations remaining, representing
     46,206  subjects
        665  failures in single-failure-per-subject data
  1,329,957  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1329957        665   .00050002   .0004634    .0005395

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     652113.5        314   .00048151   .0004311    .0005378
no drug

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    227152.25        112   .00049306   .0004097    .0005934
sotrovimab

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       226519        126   .00055624   .0004671    .0006624
paxlovid

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    224172.25        113   .00050408   .0004192    .0006061
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_all==1
Observed time interval: (stop_pre_drug_all[_n-1], stop_pre_drug_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      1,130  event time missing (stop_pre_drug_all>=.)      PROBABLE ERRO
> R
      1,909  ignored because never entered
      4,792  observations end on or before enter()
-------------------------------------------------------------------------
> -
     48,999  observations remaining, representing
     48,999  subjects
        411  failures in single-failure-per-subject data
  1,414,892  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1414892.3        411   .00029048   .0002637      .00032

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    695477.25        195   .00028038   .0002437    .0003226
no drug

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       241393         78   .00032312   .0002588    .0004034
sotrovimab

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     240524.5         72   .00029935   .0002376    .0003771
paxlovid

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     237497.5         66    .0002779   .0002183    .0003537
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_serious==1
Observed time interval: (stop_pre_drug_serious[_n-1], stop_pre_drug_serio
> us]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      2,207  event time missing (stop_pre_drug_serious>=.)  PROBABLE ERRO
> R
        832  ignored because never entered
      2,456  observations end on or before enter()
-------------------------------------------------------------------------
> -
     51,335  observations remaining, representing
     51,335  subjects
        213  failures in single-failure-per-subject data
  1,485,568  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1485567.8        213   .00014338   .0001254     .000164

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    729429.75         99   .00013572   .0001115    .0001653
no drug

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     253110.5         47   .00018569   .0001395    .0002471
sotrovimab

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    253010.75         33   .00013043   .0000927    .0001835
paxlovid

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    250016.75         34   .00013599   .0000972    .0001903
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_all==1
Observed time interval: (stop_pre_imae_all[_n-1], stop_pre_imae_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
        573  event time missing (stop_pre_imae_all>=.)      PROBABLE ERRO
> R
      2,466  ignored because never entered
      8,407  observations end on or before enter()
-------------------------------------------------------------------------
> -
     45,384  observations remaining, representing
     45,384  subjects
        626  failures in single-failure-per-subject data
  1,307,051  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1307051.3        626   .00047894   .0004429     .000518

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     641372.5        305   .00047554   .0004251     .000532
no drug

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    222464.75        108   .00048547    .000402    .0005862
sotrovimab

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    224241.25         95   .00042365   .0003465     .000518
paxlovid

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    218972.75        118   .00053888   .0004499    .0006454
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_serious==1
Observed time interval: (stop_pre_imae_serious[_n-1], stop_pre_imae_serio
> us]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

-------------------------------------------------------------------------
> -
     56,830  total observations
      1,722  event time missing (stop_pre_imae_serious>=.)  PROBABLE ERRO
> R
      1,317  ignored because never entered
      4,446  observations end on or before enter()
-------------------------------------------------------------------------
> -
     49,345  observations remaining, representing
     49,345  subjects
        319  failures in single-failure-per-subject data
  1,426,366  total analysis time at risk and under observation
                                                At risk from t =         
> 0
                                     Earliest observed entry t =         
> 0
                                          Last observed exit t =        2
> 9

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    1426365.5        319   .00022365   .0002004    .0002496

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    698999.25        150   .00021459   .0001829    .0002518
no drug

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    242512.25         53   .00021855    .000167    .0002861
sotrovimab

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     245079.5         51    .0002081   .0001582    .0002738
paxlovid

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     239774.5         65   .00027109   .0002126    .0003457
molnupavir

. postclose `comparator_rates'

. use "$projectdir/output/tables/comparator_rates", clear

. order failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates", replace
file C:\Users\k1635179\OneDrive - King's College
    London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/co
    > mparator_rates.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates.csv"
> , replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\
> Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/outpu
> t/tables/comparator_rates.csv saved

. 
. ** Redact and round rates
. use "$projectdir/output/tables/comparator_rates", clear

. foreach var of varlist *events *ptime  {
  2. gen `var'_midpoint = (ceil(`var'/6)*6) - (floor(6/2) * (`var'!=0))
  3. }

. foreach var in all control sot pax mol {
  2. gen `var'_rate_midpoint = (`var'_events_midpoint/`var'_ptime_midpoin
> t)*1000
  3. gen `var'_lci_midpoint = (invpoisson(`var'_events_midpoint,.975)/`va
> r'_ptime_midpoint)*1000
  4. gen `var'_uci_midpoint = (invpoisson(`var'_events_midpoint,.025)/`va
> r'_ptime_midpoint)*1000
  5. }  

. keep failure *_midpoint

. order   failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates_round", replace
file C:\Users\k1635179\OneDrive - King's College
    London\Katie\OpenSafely\Safety mAB and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/co
    > mparator_rates_round.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates_roun
> d.csv", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\
> Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/outpu
> t/tables/comparator_rates_round.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\Ope
> nSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupirav
> ir/logs/preceed_rate.log
  log type:  text
 closed on:  31 Oct 2023, 13:10:00
-------------------------------------------------------------------------
