--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safet
> y mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/preceed_rate.log
  log type:  text
 opened on:   8 Nov 2023, 20:56:27

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafel
> y\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/sensitivity_analysis.dta", clear

. tab pre_drug_test drug

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
               0 days |         0         15         16         26 |        57 
               1 days |         0         11         13         17 |        41 
               2 days |         0         23         14         12 |        49 
               3 days |         0         14         17         17 |        48 
               4 days |         0         12          9         13 |        34 
               5 days |         0         11         12         13 |        36 
             6-7 days |         0         19         11         16 |        46 
   >7 days & <21 days |         0        213        217        222 |       652 
treatment >21 day or  |    26,554      9,899      9,902      9,807 |    56,162 
no test date / no tre |         0      1,147      1,107      1,106 |     3,360 
----------------------+--------------------------------------------+----------
                Total |    26,554     11,364     11,318     11,249 |    60,485 

. drop if  covid_test_5d!=1 & drug >0
(33,666 observations deleted)

. tab pre_drug_test drug

                      |                    drug
        pre_drug_test |   control  sotrovima   paxlovid  molnupira |     Total
----------------------+--------------------------------------------+----------
               0 days |         0         15         16         26 |        57 
               1 days |         0         11         13         17 |        41 
               2 days |         0         23         14         12 |        49 
               3 days |         0         14         17         17 |        48 
               4 days |         0         12          9         13 |        34 
               5 days |         0         11         12         13 |        36 
treatment >21 day or  |    26,554          0          0          0 |    26,554 
----------------------+--------------------------------------------+----------
                Total |    26,554         86         81         98 |    26,819 

. tab drug paxlovid_contraindicated

             | paxlovid_contraindica
             |          ted
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    11,086     15,468 |    26,554 
  sotrovimab |        49         37 |        86 
    paxlovid |        40         41 |        81 
molnupiravir |        39         59 |        98 
-------------+----------------------+----------
       Total |    11,214     15,605 |    26,819 

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for comparative 
> rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prior
. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 
(24,440 missing values generated)

. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0 
(24,431 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snomed_new==0 
(24,404 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 
(24,429 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 
(24,398 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 
(24,379 missing values generated)

. gen new_pre_psoriasis_icd = pre_psoriasis_icd_prim if pre_psoriasis_snomed_new==0 
(24,402 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_snomed_new==0 
(24,367 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new==0
(24,378 missing values generated)

. gen new_pre_psa_icd = pre_psa_icd_prim if pre_psa_snomed_new==0
(24,427 missing values generated)

. gen new_pre_psa_ae = pre_psa_ae if pre_psa_snomed_new==0 
(24,432 missing values generated)

. gen new_pre_psa_snomed = pre_psa_snomed if pre_psa_snomed_new==0 
(24,406 missing values generated)

. gen new_pre_axspa_icd = pre_axspa_icd_prim if pre_axspa_ctv_new==0
(24,399 missing values generated)

. gen new_pre_axspa_ctv = pre_axspa_ctv if pre_axspa_ctv_new==0 
(24,363 missing values generated)

. gen new_pre_axspa_ae = pre_axspa_ae if pre_axspa_ctv_new==0
(24,389 missing values generated)

. gen new_pre_ibd_icd = pre_ibd_icd_prim if pre_ibd_ctv_new==0
(24,381 missing values generated)

. gen new_pre_ibd_ctv = pre_ibd_ctv if pre_ibd_ctv_new==0
(24,385 missing values generated)

. gen new_pre_ibd_ae = pre_ibd_ae if pre_ibd_ctv_new==0
(24,473 missing values generated)

. 
. *** combined all AEs from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_diverticulitis_snomed
>  pre_diverticulitis_ae)      
(19,534 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_icd_prim pre_diarrhoea_snomed  pre_diarrhoea
> l_icd_prim)
(19,563 missing values generated)

. egen pre_taste = rmin(pre_taste_icd_prim pre_taste_snomed )
(21,714 missing values generated)

. egen pre_rash = rmin(pre_rash_icd_prim pre_rash_snomed pre_rash_ae)
(19,511 missing values generated)

. egen pre_bronchospasm = rmin(pre_bronchospasm_snomed)
(24,110 missing values generated)

. egen pre_contactderm = rmin(pre_contactderm_snomed pre_contactderm_icd_prim pre_cont
> actderm_ae)
(19,636 missing values generated)

. egen pre_dizziness = rmin(pre_dizziness_snomed pre_dizziness_ae pre_dizziness_icd_pr
> im)
(19,536 missing values generated)

. egen pre_nausea_vomit = rmin(pre_nausea_vomit_snomed pre_nausea_vomit_icd_prim)
(21,783 missing values generated)

. egen pre_headache = rmin(pre_headache_snomed pre_headache_ae pre_headache_icd_prim)
(19,626 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_snomed     pre_
> anaphlaxis_ae)
(19,562 missing values generated)

. egen pre_drugreaction = rmin(pre_severedrug_icd_prim pre_severedrug_sjs_icd_prim pre
> _severedrug_snomed pre_severedrug_ae pre_nonsevere_drug_snomed pre_nonsevere_drug_ae
> )
(14,240 missing values generated)

. egen pre_ra = rmin(new_pre_ra_icd new_pre_ra_ae new_pre_ra_snomed )
(20,276 missing values generated)

. egen pre_sle = rmin(new_pre_sle_icd new_pre_sle_ctv new_pre_sle_ae)
(20,257 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_icd new_pre_psoriasis_snomed  new_pre_pso
> riasis_ae)
(20,186 missing values generated)

. egen pre_psa = rmin(new_pre_psa_icd new_pre_psa_ae new_pre_psa_snomed)
(20,314 missing values generated)

. egen pre_axspa = rmin(new_pre_axspa_icd  new_pre_axspa_ae new_pre_axspa_ctv)
(20,239 missing values generated)

. egen pre_ibd = rmin(new_pre_ibd_icd new_pre_ibd_ctv new_pre_ibd_ae)
(20,286 missing values generated)

. 
. *** combined serious AEs from hosp and A&E
. egen pre_diverticulitis_serious = rmin(pre_diverticulitis_icd_prim)      
(24,124 missing values generated)

. egen pre_diarrhoea_serious = rmin(pre_diarrhoea_icd_prim pre_diarrhoeal_icd_prim)
(21,701 missing values generated)

. egen pre_taste_serious = rmin(pre_taste_icd_prim)
(24,119 missing values generated)

. egen pre_rash_serious = rmin(pre_rash_icd_prim)
(24,106 missing values generated)

. egen pre_contactderm_serious = rmin(pre_contactderm_snomed pre_contactderm_icd_prim 
> pre_contactderm_ae)
(19,636 missing values generated)

. egen pre_dizziness_serious = rmin(pre_dizziness_icd_prim)
(24,165 missing values generated)

. egen pre_nausea_vomit_serious = rmin(pre_nausea_vomit_icd_prim)
(24,159 missing values generated)

. egen pre_headache_serious = rmin(pre_headache_icd_prim)
(24,170 missing values generated)

. egen pre_anaphylaxis_serious = rmin(pre_anaphylaxis_icd_prim)
(24,146 missing values generated)

. egen pre_drugreaction_serious = rmin(pre_severedrug_icd_prim pre_severedrug_sjs_icd_
> prim)
(21,674 missing values generated)

. egen pre_ra_serious = rmin(new_pre_ra_icd)
(24,440 missing values generated)

. egen pre_sle_serious = rmin(new_pre_sle_icd)
(24,398 missing values generated)

. egen pre_psorasis_serious = rmin(new_pre_psoriasis_icd)
(24,402 missing values generated)

. egen pre_psa_serious = rmin(new_pre_psa_icd)
(24,427 missing values generated)

. egen pre_axspa_serious = rmin(new_pre_axspa_icd)
(24,399 missing values generated)

. egen pre_ibd_serious = rmin(new_pre_ibd_icd)
(24,381 missing values generated)

. 
. *** combined AEs by spc, drug and imae                          
. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste pre_rash pre_cont
> actderm pre_bronchospasm pre_dizziness pre_nausea_vomit pre_headache pre_anaphylaxis
>  pre_drugreaction)
(957 missing values generated)

. egen pre_spc_serious = rmin(pre_diverticulitis_serious pre_diarrhoea_serious pre_tas
> te_serious pre_rash_serious pre_contactderm_serious pre_dizziness_serious pre_nausea
> _vomit_serious pre_headache_serious)
(8,514 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_drugreaction)
(10,392 missing values generated)

. egen pre_drug_serious = rmin(pre_anaphylaxis_serious pre_drugreaction_serious)
(19,507 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_ibd pre_axspa)
(4,894 missing values generated)

. egen pre_imae_serious = rmin(pre_ra_serious pre_sle_serious pre_psorasis_serious pre
> _psa_serious pre_axspa_serious pre_ibd_serious)
(15,233 missing values generated)

. egen pre_all = rmin(ae_spc_all ae_drug_all ae_imae_all )

. egen pre_all_serious = rmin(ae_spc_serious ae_drug_serious ae_imae_serious)
(6 missing values generated)

. 
. global pre_ae_disease                   pre_diverticulitis                          
>     ///
>                                                                 pre_diarrhoea       
>                             ///
>                                                                 pre_taste           
>                                     ///
>                                                                 pre_rash            
>                                     ///
>                                                                 pre_bronchospasm    
>                             ///
>                                                                 pre_contactderm     
>                             ///
>                                                                 pre_dizziness       
>                             ///
>                                                                 pre_nausea_vomit    
>                             ///
>                                                                 pre_headache        
>                             ///
>                                                                 pre_anaphylaxis     
>                             ///
>                                                                 pre_drugreaction    
>                             ///
>                                                                 pre_ra              
>                                     ///
>                                                                 pre_sle             
>                                     ///
>                                                                 pre_psorasis        
>                             ///
>                                                                 pre_psa             
>                                     ///
>                                                                 pre_axspa           
>                                     ///
>                                                                 pre_ibd 

. global pre_ae_disease_serious   pre_diverticulitis_serious              ///
>                                                                 pre_diarrhoea_seriou
> s                   ///
>                                                                 pre_taste_serious   
>                             ///
>                                                                 pre_rash_serious    
>                             ///
>                                                                 pre_contactderm_seri
> ous                 ///
>                                                                 pre_dizziness_seriou
> s                   ///
>                                                                 pre_nausea_vomit_ser
> ious                ///
>                                                                 pre_headache_serious
>                     ///
>                                                                 pre_anaphylaxis_seri
> ous                 ///
>                                                                 pre_drugreaction_ser
> ious                ///
>                                                                 pre_ra_serious      
>                             ///
>                                                                 pre_sle_serious     
>                             ///
>                                                                 pre_psorasis_serious
>                     ///
>                                                                 pre_psa_serious     
>                             ///
>                                                                 pre_axspa_serious   
>                             ///
>                                                                 pre_ibd_serious     
>                                                     

. global pre_ae_combined                  pre_all                                     
>             ///
>                                                                 pre_all_serious     
>                             ///
>                                                                 pre_spc_all         
>                             ///
>                                                                 pre_spc_serious     
>                             ///
>                                                                 pre_drug_all        
>                             ///
>                                                                 pre_drug_serious    
>                             ///
>                                                                 pre_imae_all        
>                             ///     
>                                                                 pre_imae_serious    
>                                                     

. 
. ********************************************************
. *       A. START DATE           *
. ********************************************************
. ** Start day for treatment group is date treated & start date for control group is d
> ate test + 2 days
. count if start_date!=covid_test_positive_date & drug==0
  26,512

. count if start_date!=date_treated & drug>0
  0

. gen start_comparator = start_date-1460
(2,624 missing values generated)

. gen start_comparator_28 = start_date-1431
(2,624 missing values generated)

. 
. ********************************************************
. *       A. COX MODEL            *
. ********************************************************
. * Generate failure 
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparator_28) & `x'!=
> .  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparator_28) & `x'!=
> .  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8. }
pre_diverticulitis
  7,285
  7,214
  65
(19,534 missing values generated)

             | fail_pre_diverticulit
             |          is
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,215     19,339 |    26,554 
  sotrovimab |        24         62 |        86 
    paxlovid |        17         64 |        81 
molnupiravir |        29         69 |        98 
-------------+----------------------+----------
       Total |     7,285     19,534 |    26,819 
pre_diarrhoea
  7,256
  7,154
  97
(19,563 missing values generated)

             |  fail_pre_diarrhoea
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,195     19,359 |    26,554 
  sotrovimab |        27         59 |        86 
    paxlovid |        14         67 |        81 
molnupiravir |        20         78 |        98 
-------------+----------------------+----------
       Total |     7,256     19,563 |    26,819 
pre_taste
  5,105
  5,030
  69
(21,714 missing values generated)

             |    fail_pre_taste
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,052     21,502 |    26,554 
  sotrovimab |        18         68 |        86 
    paxlovid |        13         68 |        81 
molnupiravir |        22         76 |        98 
-------------+----------------------+----------
       Total |     5,105     21,714 |    26,819 
pre_rash
  7,308
  7,254
  49
(19,511 missing values generated)

             |     fail_pre_rash
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,228     19,326 |    26,554 
  sotrovimab |        24         62 |        86 
    paxlovid |        29         52 |        81 
molnupiravir |        27         71 |        98 
-------------+----------------------+----------
       Total |     7,308     19,511 |    26,819 
pre_bronchospasm
  2,709
  2,669
  35
(24,110 missing values generated)

             | fail_pre_bronchospasm
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,691     23,863 |    26,554 
  sotrovimab |         6         80 |        86 
    paxlovid |         4         77 |        81 
molnupiravir |         8         90 |        98 
-------------+----------------------+----------
       Total |     2,709     24,110 |    26,819 
pre_contactderm
  7,183
  7,115
  62
(19,636 missing values generated)

             | fail_pre_contactderm
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,114     19,440 |    26,554 
  sotrovimab |        20         66 |        86 
    paxlovid |        20         61 |        81 
molnupiravir |        29         69 |        98 
-------------+----------------------+----------
       Total |     7,183     19,636 |    26,819 
pre_dizziness
  7,283
  7,214
  67
(19,536 missing values generated)

             |  fail_pre_dizziness
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,205     19,349 |    26,554 
  sotrovimab |        31         55 |        86 
    paxlovid |        19         62 |        81 
molnupiravir |        28         70 |        98 
-------------+----------------------+----------
       Total |     7,283     19,536 |    26,819 
pre_nausea_vomit
  5,036
  4,976
  56
(21,783 missing values generated)

             | fail_pre_nausea_vomit
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,990     21,564 |    26,554 
  sotrovimab |        14         72 |        86 
    paxlovid |        14         67 |        81 
molnupiravir |        18         80 |        98 
-------------+----------------------+----------
       Total |     5,036     21,783 |    26,819 
pre_headache
  7,193
  7,128
  56
(19,626 missing values generated)

             |   fail_pre_headache
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,119     19,435 |    26,554 
  sotrovimab |        28         58 |        86 
    paxlovid |        21         60 |        81 
molnupiravir |        25         73 |        98 
-------------+----------------------+----------
       Total |     7,193     19,626 |    26,819 
pre_anaphylaxis
  7,257
  7,182
  72
(19,562 missing values generated)

             | fail_pre_anaphylaxis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,186     19,368 |    26,554 
  sotrovimab |        26         60 |        86 
    paxlovid |        26         55 |        81 
molnupiravir |        19         79 |        98 
-------------+----------------------+----------
       Total |     7,257     19,562 |    26,819 
pre_drugreaction
  12,579
  12,456
  117
(14,240 missing values generated)

             | fail_pre_drugreaction
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    12,453     14,101 |    26,554 
  sotrovimab |        35         51 |        86 
    paxlovid |        45         36 |        81 
molnupiravir |        46         52 |        98 
-------------+----------------------+----------
       Total |    12,579     14,240 |    26,819 
pre_ra
  6,543
  6,478
  61
(20,276 missing values generated)

             |      fail_pre_ra
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,471     20,083 |    26,554 
  sotrovimab |        23         63 |        86 
    paxlovid |        23         58 |        81 
molnupiravir |        26         72 |        98 
-------------+----------------------+----------
       Total |     6,543     20,276 |    26,819 
pre_sle
  6,562
  6,496
  61
(20,257 missing values generated)

             |     fail_pre_sle
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,495     20,059 |    26,554 
  sotrovimab |        20         66 |        86 
    paxlovid |        15         66 |        81 
molnupiravir |        32         66 |        98 
-------------+----------------------+----------
       Total |     6,562     20,257 |    26,819 
pre_psorasis
  6,633
  6,569
  60
(20,186 missing values generated)

             |   fail_pre_psorasis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,566     19,988 |    26,554 
  sotrovimab |        24         62 |        86 
    paxlovid |        22         59 |        81 
molnupiravir |        21         77 |        98 
-------------+----------------------+----------
       Total |     6,633     20,186 |    26,819 
pre_psa
  6,505
  6,446
  53
(20,314 missing values generated)

             |     fail_pre_psa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,448     20,106 |    26,554 
  sotrovimab |        23         63 |        86 
    paxlovid |        14         67 |        81 
molnupiravir |        20         78 |        98 
-------------+----------------------+----------
       Total |     6,505     20,314 |    26,819 
pre_axspa
  6,580
  6,532
  44
(20,239 missing values generated)

             |    fail_pre_axspa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,519     20,035 |    26,554 
  sotrovimab |        22         64 |        86 
    paxlovid |        16         65 |        81 
molnupiravir |        23         75 |        98 
-------------+----------------------+----------
       Total |     6,580     20,239 |    26,819 
pre_ibd
  6,533
  6,461
  65
(20,286 missing values generated)

             |     fail_pre_ibd
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,475     20,079 |    26,554 
  sotrovimab |        21         65 |        86 
    paxlovid |        15         66 |        81 
molnupiravir |        22         76 |        98 
-------------+----------------------+----------
       Total |     6,533     20,286 |    26,819 
pre_diverticulitis_serious
  2,695
  2,653
  39
(24,124 missing values generated)

             | fail_pre_diverticulit
             |      is_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,664     23,890 |    26,554 
  sotrovimab |         9         77 |        86 
    paxlovid |        10         71 |        81 
molnupiravir |        12         86 |        98 
-------------+----------------------+----------
       Total |     2,695     24,124 |    26,819 
pre_diarrhoea_serious
  5,118
  5,053
  62
(21,701 missing values generated)

             | fail_pre_diarrhoea_se
             |         rious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,077     21,477 |    26,554 
  sotrovimab |        17         69 |        86 
    paxlovid |         9         72 |        81 
molnupiravir |        15         83 |        98 
-------------+----------------------+----------
       Total |     5,118     21,701 |    26,819 
pre_taste_serious
  2,700
  2,671
  28
(24,119 missing values generated)

             | fail_pre_taste_seriou
             |           s
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,672     23,882 |    26,554 
  sotrovimab |         9         77 |        86 
    paxlovid |         7         74 |        81 
molnupiravir |        12         86 |        98 
-------------+----------------------+----------
       Total |     2,700     24,119 |    26,819 
pre_rash_serious
  2,713
  2,679
  31
(24,106 missing values generated)

             | fail_pre_rash_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,684     23,870 |    26,554 
  sotrovimab |         7         79 |        86 
    paxlovid |        10         71 |        81 
molnupiravir |        12         86 |        98 
-------------+----------------------+----------
       Total |     2,713     24,106 |    26,819 
pre_contactderm_serious
  7,183
  7,115
  62
(19,636 missing values generated)

             | fail_pre_contactderm_
             |        serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,114     19,440 |    26,554 
  sotrovimab |        20         66 |        86 
    paxlovid |        20         61 |        81 
molnupiravir |        29         69 |        98 
-------------+----------------------+----------
       Total |     7,183     19,636 |    26,819 
pre_dizziness_serious
  2,654
  2,627
  27
(24,165 missing values generated)

             | fail_pre_dizziness_se
             |         rious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,633     23,921 |    26,554 
  sotrovimab |         7         79 |        86 
    paxlovid |         4         77 |        81 
molnupiravir |        10         88 |        98 
-------------+----------------------+----------
       Total |     2,654     24,165 |    26,819 
pre_nausea_vomit_serious
  2,660
  2,628
  30
(24,159 missing values generated)

             | fail_pre_nausea_vomit
             |       _serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,640     23,914 |    26,554 
  sotrovimab |         7         79 |        86 
    paxlovid |         7         74 |        81 
molnupiravir |         6         92 |        98 
-------------+----------------------+----------
       Total |     2,660     24,159 |    26,819 
pre_headache_serious
  2,649
  2,615
  31
(24,170 missing values generated)

             | fail_pre_headache_ser
             |         ious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,620     23,934 |    26,554 
  sotrovimab |         9         77 |        86 
    paxlovid |         9         72 |        81 
molnupiravir |        11         87 |        98 
-------------+----------------------+----------
       Total |     2,649     24,170 |    26,819 
pre_anaphylaxis_serious
  2,673
  2,640
  33
(24,146 missing values generated)

             | fail_pre_anaphylaxis_
             |        serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,652     23,902 |    26,554 
  sotrovimab |         8         78 |        86 
    paxlovid |         7         74 |        81 
molnupiravir |         6         92 |        98 
-------------+----------------------+----------
       Total |     2,673     24,146 |    26,819 
pre_drugreaction_serious
  5,145
  5,074
  69
(21,674 missing values generated)

             | fail_pre_drugreaction
             |       _serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,095     21,459 |    26,554 
  sotrovimab |        15         71 |        86 
    paxlovid |        17         64 |        81 
molnupiravir |        18         80 |        98 
-------------+----------------------+----------
       Total |     5,145     21,674 |    26,819 
pre_ra_serious
  2,379
  2,351
  27
(24,440 missing values generated)

             |  fail_pre_ra_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,350     24,204 |    26,554 
  sotrovimab |        10         76 |        86 
    paxlovid |         9         72 |        81 
molnupiravir |        10         88 |        98 
-------------+----------------------+----------
       Total |     2,379     24,440 |    26,819 
pre_sle_serious
  2,421
  2,386
  32
(24,398 missing values generated)

             | fail_pre_sle_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,407     24,147 |    26,554 
  sotrovimab |         5         81 |        86 
    paxlovid |         5         76 |        81 
molnupiravir |         4         94 |        98 
-------------+----------------------+----------
       Total |     2,421     24,398 |    26,819 
pre_psorasis_serious
  2,417
  2,391
  24
(24,402 missing values generated)

             | fail_pre_psorasis_ser
             |         ious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,396     24,158 |    26,554 
  sotrovimab |         6         80 |        86 
    paxlovid |         8         73 |        81 
molnupiravir |         7         91 |        98 
-------------+----------------------+----------
       Total |     2,417     24,402 |    26,819 
pre_psa_serious
  2,392
  2,364
  24
(24,427 missing values generated)

             | fail_pre_psa_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,372     24,182 |    26,554 
  sotrovimab |         6         80 |        86 
    paxlovid |         7         74 |        81 
molnupiravir |         7         91 |        98 
-------------+----------------------+----------
       Total |     2,392     24,427 |    26,819 
pre_axspa_serious
  2,420
  2,401
  17
(24,399 missing values generated)

             | fail_pre_axspa_seriou
             |           s
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,399     24,155 |    26,554 
  sotrovimab |         7         79 |        86 
    paxlovid |         6         75 |        81 
molnupiravir |         8         90 |        98 
-------------+----------------------+----------
       Total |     2,420     24,399 |    26,819 
pre_ibd_serious
  2,438
  2,406
  30
(24,381 missing values generated)

             | fail_pre_ibd_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     2,414     24,140 |    26,554 
  sotrovimab |         7         79 |        86 
    paxlovid |        11         70 |        81 
molnupiravir |         6         92 |        98 
-------------+----------------------+----------
       Total |     2,438     24,381 |    26,819 
pre_all
  26,819
  26,819
  0

             | fail_pre_a
             |     ll
        drug |         1 |     Total
-------------+-----------+----------
     control |    26,554 |    26,554 
  sotrovimab |        86 |        86 
    paxlovid |        81 |        81 
molnupiravir |        98 |        98 
-------------+-----------+----------
       Total |    26,819 |    26,819 
pre_all_serious
  26,813
  26,813
  0
(6 missing values generated)

             | fail_pre_all_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    26,548          6 |    26,554 
  sotrovimab |        86          0 |        86 
    paxlovid |        81          0 |        81 
molnupiravir |        98          0 |        98 
-------------+----------------------+----------
       Total |    26,813          6 |    26,819 
pre_spc_all
  25,862
  25,291
  523
(957 missing values generated)

             |   fail_pre_spc_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    25,607        947 |    26,554 
  sotrovimab |        81          5 |        86 
    paxlovid |        78          3 |        81 
molnupiravir |        96          2 |        98 
-------------+----------------------+----------
       Total |    25,862        957 |    26,819 
pre_spc_serious
  18,305
  18,019
  266
(8,514 missing values generated)

             | fail_pre_spc_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    18,118      8,436 |    26,554 
  sotrovimab |        62         24 |        86 
    paxlovid |        53         28 |        81 
molnupiravir |        72         26 |        98 
-------------+----------------------+----------
       Total |    18,305      8,514 |    26,819 
pre_drug_all
  16,427
  16,241
  177
(10,392 missing values generated)

             |   fail_pre_drug_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    16,264     10,290 |    26,554 
  sotrovimab |        51         35 |        86 
    paxlovid |        56         25 |        81 
molnupiravir |        56         42 |        98 
-------------+----------------------+----------
       Total |    16,427     10,392 |    26,819 
pre_drug_serious
  7,312
  7,212
  98
(19,507 missing values generated)

             | fail_pre_drug_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     7,244     19,310 |    26,554 
  sotrovimab |        22         64 |        86 
    paxlovid |        24         57 |        81 
molnupiravir |        22         76 |        98 
-------------+----------------------+----------
       Total |     7,312     19,507 |    26,819 
pre_imae_all
  21,925
  21,602
  297
(4,894 missing values generated)

             |   fail_pre_imae_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    21,719      4,835 |    26,554 
  sotrovimab |        72         14 |        86 
    paxlovid |        59         22 |        81 
molnupiravir |        75         23 |        98 
-------------+----------------------+----------
       Total |    21,925      4,894 |    26,819 
pre_imae_serious
  11,586
  11,432
  142
(15,233 missing values generated)

             | fail_pre_imae_serious
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    11,479     15,075 |    26,554 
  sotrovimab |        34         52 |        86 
    paxlovid |        38         43 |        81 
molnupiravir |        35         63 |        98 
-------------+----------------------+----------
       Total |    11,586     15,233 |    26,819 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 replace `x'=`x'+0.75 if `x'==start_comparator
  4. }
pre_diverticulitis
(1 real change made)
pre_diarrhoea
(0 real changes made)
pre_taste
(1 real change made)
pre_rash
(3 real changes made)
pre_bronchospasm
(0 real changes made)
pre_contactderm
(4 real changes made)
pre_dizziness
(1 real change made)
pre_nausea_vomit
(4 real changes made)
pre_headache
(5 real changes made)
pre_anaphylaxis
(0 real changes made)
pre_drugreaction
(4 real changes made)
pre_ra
(2 real changes made)
pre_sle
(2 real changes made)
pre_psorasis
(3 real changes made)
pre_psa
(5 real changes made)
pre_axspa
(2 real changes made)
pre_ibd
(3 real changes made)
pre_diverticulitis_serious
(1 real change made)
pre_diarrhoea_serious
(0 real changes made)
pre_taste_serious
(0 real changes made)
pre_rash_serious
(1 real change made)
pre_contactderm_serious
(4 real changes made)
pre_dizziness_serious
(0 real changes made)
pre_nausea_vomit_serious
(2 real changes made)
pre_headache_serious
(3 real changes made)
pre_anaphylaxis_serious
(0 real changes made)
pre_drugreaction_serious
(1 real change made)
pre_ra_serious
(1 real change made)
pre_sle_serious
(2 real changes made)
pre_psorasis_serious
(2 real changes made)
pre_psa_serious
(3 real changes made)
pre_axspa_serious
(1 real change made)
pre_ibd_serious
(0 real changes made)
pre_all
(0 real changes made)
pre_all_serious
(0 real changes made)
pre_spc_all
(21 real changes made)
pre_spc_serious
(10 real changes made)
pre_drug_all
(4 real changes made)
pre_drug_serious
(1 real change made)
pre_imae_all
(13 real changes made)
pre_imae_serious
(7 real changes made)

. 
. *Generate censor date
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 gen stop_`x'=`x' if fail_`x'==1
  3.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
  4.                 tab drug fail_`x' if stop_`x'!=.
  5.                 format %td stop_`x'
  6. }
(19,534 missing values generated)
(17,600 real changes made)

             | fail_pre_d
             | iverticuli
             |    tis
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,215 |     7,215 
  sotrovimab |        24 |        24 
    paxlovid |        17 |        17 
molnupiravir |        29 |        29 
-------------+-----------+----------
       Total |     7,285 |     7,285 
(19,563 missing values generated)
(17,702 real changes made)

             | fail_pre_d
             |  iarrhoea
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,195 |     7,195 
  sotrovimab |        27 |        27 
    paxlovid |        14 |        14 
molnupiravir |        20 |        20 
-------------+-----------+----------
       Total |     7,256 |     7,256 
(21,714 missing values generated)
(19,585 real changes made)

             | fail_pre_t
             |    aste
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,052 |     5,052 
  sotrovimab |        18 |        18 
    paxlovid |        13 |        13 
molnupiravir |        22 |        22 
-------------+-----------+----------
       Total |     5,105 |     5,105 
(19,511 missing values generated)
(17,619 real changes made)

             | fail_pre_r
             |    ash
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,228 |     7,228 
  sotrovimab |        24 |        24 
    paxlovid |        29 |        29 
molnupiravir |        27 |        27 
-------------+-----------+----------
       Total |     7,308 |     7,308 
(24,110 missing values generated)
(21,756 real changes made)

             | fail_pre_b
             | ronchospas
             |     m
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,691 |     2,691 
  sotrovimab |         6 |         6 
    paxlovid |         4 |         4 
molnupiravir |         8 |         8 
-------------+-----------+----------
       Total |     2,709 |     2,709 
(19,636 missing values generated)
(17,754 real changes made)

             | fail_pre_c
             | ontactderm
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,114 |     7,114 
  sotrovimab |        20 |        20 
    paxlovid |        20 |        20 
molnupiravir |        29 |        29 
-------------+-----------+----------
       Total |     7,183 |     7,183 
(19,536 missing values generated)
(17,630 real changes made)

             | fail_pre_d
             |  izziness
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,205 |     7,205 
  sotrovimab |        31 |        31 
    paxlovid |        19 |        19 
molnupiravir |        28 |        28 
-------------+-----------+----------
       Total |     7,283 |     7,283 
(21,783 missing values generated)
(19,659 real changes made)

             | fail_pre_n
             | ausea_vomi
             |     t
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,990 |     4,990 
  sotrovimab |        14 |        14 
    paxlovid |        14 |        14 
molnupiravir |        18 |        18 
-------------+-----------+----------
       Total |     5,036 |     5,036 
(19,626 missing values generated)
(17,712 real changes made)

             | fail_pre_h
             |  eadache
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,119 |     7,119 
  sotrovimab |        28 |        28 
    paxlovid |        21 |        21 
molnupiravir |        25 |        25 
-------------+-----------+----------
       Total |     7,193 |     7,193 
(19,562 missing values generated)
(17,623 real changes made)

             | fail_pre_a
             | naphylaxis
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,186 |     7,186 
  sotrovimab |        26 |        26 
    paxlovid |        26 |        26 
molnupiravir |        19 |        19 
-------------+-----------+----------
       Total |     7,257 |     7,257 
(14,240 missing values generated)
(12,872 real changes made)

             | fail_pre_d
             | rugreactio
             |     n
        drug |         1 |     Total
-------------+-----------+----------
     control |    12,453 |    12,453 
  sotrovimab |        35 |        35 
    paxlovid |        45 |        45 
molnupiravir |        46 |        46 
-------------+-----------+----------
       Total |    12,579 |    12,579 
(20,276 missing values generated)
(18,291 real changes made)

             | fail_pre_r
             |     a
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,471 |     6,471 
  sotrovimab |        23 |        23 
    paxlovid |        23 |        23 
molnupiravir |        26 |        26 
-------------+-----------+----------
       Total |     6,543 |     6,543 
(20,257 missing values generated)
(18,267 real changes made)

             | fail_pre_s
             |     le
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,495 |     6,495 
  sotrovimab |        20 |        20 
    paxlovid |        15 |        15 
molnupiravir |        32 |        32 
-------------+-----------+----------
       Total |     6,562 |     6,562 
(20,186 missing values generated)
(18,209 real changes made)

             | fail_pre_p
             |  sorasis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,566 |     6,566 
  sotrovimab |        24 |        24 
    paxlovid |        22 |        22 
molnupiravir |        21 |        21 
-------------+-----------+----------
       Total |     6,633 |     6,633 
(20,314 missing values generated)
(18,312 real changes made)

             | fail_pre_p
             |     sa
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,448 |     6,448 
  sotrovimab |        23 |        23 
    paxlovid |        14 |        14 
molnupiravir |        20 |        20 
-------------+-----------+----------
       Total |     6,505 |     6,505 
(20,239 missing values generated)
(18,254 real changes made)

             | fail_pre_a
             |    xspa
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,519 |     6,519 
  sotrovimab |        22 |        22 
    paxlovid |        16 |        16 
molnupiravir |        23 |        23 
-------------+-----------+----------
       Total |     6,580 |     6,580 
(20,286 missing values generated)
(18,310 real changes made)

             | fail_pre_i
             |     bd
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,475 |     6,475 
  sotrovimab |        21 |        21 
    paxlovid |        15 |        15 
molnupiravir |        22 |        22 
-------------+-----------+----------
       Total |     6,533 |     6,533 
(24,124 missing values generated)
(21,749 real changes made)

             | fail_pre_d
             | iverticuli
             | tis_seriou
             |     s
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,664 |     2,664 
  sotrovimab |         9 |         9 
    paxlovid |        10 |        10 
molnupiravir |        12 |        12 
-------------+-----------+----------
       Total |     2,695 |     2,695 
(21,701 missing values generated)
(19,618 real changes made)

             | fail_pre_d
             | iarrhoea_s
             |   erious
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,077 |     5,077 
  sotrovimab |        17 |        17 
    paxlovid |         9 |         9 
molnupiravir |        15 |        15 
-------------+-----------+----------
       Total |     5,118 |     5,118 
(24,119 missing values generated)
(21,762 real changes made)

             | fail_pre_t
             | aste_serio
             |     us
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,672 |     2,672 
  sotrovimab |         9 |         9 
    paxlovid |         7 |         7 
molnupiravir |        12 |        12 
-------------+-----------+----------
       Total |     2,700 |     2,700 
(24,106 missing values generated)
(21,760 real changes made)

             | fail_pre_r
             | ash_seriou
             |     s
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,684 |     2,684 
  sotrovimab |         7 |         7 
    paxlovid |        10 |        10 
molnupiravir |        12 |        12 
-------------+-----------+----------
       Total |     2,713 |     2,713 
(19,636 missing values generated)
(17,754 real changes made)

             | fail_pre_c
             | ontactderm
             |  _serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,114 |     7,114 
  sotrovimab |        20 |        20 
    paxlovid |        20 |        20 
molnupiravir |        29 |        29 
-------------+-----------+----------
       Total |     7,183 |     7,183 
(24,165 missing values generated)
(21,804 real changes made)

             | fail_pre_d
             | izziness_s
             |   erious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,633 |     2,633 
  sotrovimab |         7 |         7 
    paxlovid |         4 |         4 
molnupiravir |        10 |        10 
-------------+-----------+----------
       Total |     2,654 |     2,654 
(24,159 missing values generated)
(21,807 real changes made)

             | fail_pre_n
             | ausea_vomi
             | t_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,640 |     2,640 
  sotrovimab |         7 |         7 
    paxlovid |         7 |         7 
molnupiravir |         6 |         6 
-------------+-----------+----------
       Total |     2,660 |     2,660 
(24,170 missing values generated)
(21,814 real changes made)

             | fail_pre_h
             | eadache_se
             |   rious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,620 |     2,620 
  sotrovimab |         9 |         9 
    paxlovid |         9 |         9 
molnupiravir |        11 |        11 
-------------+-----------+----------
       Total |     2,649 |     2,649 
(24,146 missing values generated)
(21,788 real changes made)

             | fail_pre_a
             | naphylaxis
             |  _serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,652 |     2,652 
  sotrovimab |         8 |         8 
    paxlovid |         7 |         7 
molnupiravir |         6 |         6 
-------------+-----------+----------
       Total |     2,673 |     2,673 
(21,674 missing values generated)
(19,546 real changes made)

             | fail_pre_d
             | rugreactio
             | n_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,095 |     5,095 
  sotrovimab |        15 |        15 
    paxlovid |        17 |        17 
molnupiravir |        18 |        18 
-------------+-----------+----------
       Total |     5,145 |     5,145 
(24,440 missing values generated)
(22,056 real changes made)

             | fail_pre_r
             | a_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,350 |     2,350 
  sotrovimab |        10 |        10 
    paxlovid |         9 |         9 
molnupiravir |        10 |        10 
-------------+-----------+----------
       Total |     2,379 |     2,379 
(24,398 missing values generated)
(22,011 real changes made)

             | fail_pre_s
             | le_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,407 |     2,407 
  sotrovimab |         5 |         5 
    paxlovid |         5 |         5 
molnupiravir |         4 |         4 
-------------+-----------+----------
       Total |     2,421 |     2,421 
(24,402 missing values generated)
(22,016 real changes made)

             | fail_pre_p
             | sorasis_se
             |   rious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,396 |     2,396 
  sotrovimab |         6 |         6 
    paxlovid |         8 |         8 
molnupiravir |         7 |         7 
-------------+-----------+----------
       Total |     2,417 |     2,417 
(24,427 missing values generated)
(22,026 real changes made)

             | fail_pre_p
             | sa_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,372 |     2,372 
  sotrovimab |         6 |         6 
    paxlovid |         7 |         7 
molnupiravir |         7 |         7 
-------------+-----------+----------
       Total |     2,392 |     2,392 
(24,399 missing values generated)
(22,024 real changes made)

             | fail_pre_a
             | xspa_serio
             |     us
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,399 |     2,399 
  sotrovimab |         7 |         7 
    paxlovid |         6 |         6 
molnupiravir |         8 |         8 
-------------+-----------+----------
       Total |     2,420 |     2,420 
(24,381 missing values generated)
(21,998 real changes made)

             | fail_pre_i
             | bd_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |     2,414 |     2,414 
  sotrovimab |         7 |         7 
    paxlovid |        11 |        11 
molnupiravir |         6 |         6 
-------------+-----------+----------
       Total |     2,438 |     2,438 
(0 real changes made)

             | fail_pre_a
             |     ll
        drug |         1 |     Total
-------------+-----------+----------
     control |    26,554 |    26,554 
  sotrovimab |        86 |        86 
    paxlovid |        81 |        81 
molnupiravir |        98 |        98 
-------------+-----------+----------
       Total |    26,819 |    26,819 
(6 missing values generated)
(6 real changes made)

             | fail_pre_a
             | ll_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |    26,548 |    26,548 
  sotrovimab |        86 |        86 
    paxlovid |        81 |        81 
molnupiravir |        98 |        98 
-------------+-----------+----------
       Total |    26,813 |    26,813 
(957 missing values generated)
(875 real changes made)

             | fail_pre_s
             |   pc_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    25,607 |    25,607 
  sotrovimab |        81 |        81 
    paxlovid |        78 |        78 
molnupiravir |        96 |        96 
-------------+-----------+----------
       Total |    25,862 |    25,862 
(8,514 missing values generated)
(7,750 real changes made)

             | fail_pre_s
             | pc_serious
        drug |         1 |     Total
-------------+-----------+----------
     control |    18,118 |    18,118 
  sotrovimab |        62 |        62 
    paxlovid |        53 |        53 
molnupiravir |        72 |        72 
-------------+-----------+----------
       Total |    18,305 |    18,305 
(10,392 missing values generated)
(9,374 real changes made)

             | fail_pre_d
             |  rug_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    16,264 |    16,264 
  sotrovimab |        51 |        51 
    paxlovid |        56 |        56 
molnupiravir |        56 |        56 
-------------+-----------+----------
       Total |    16,427 |    16,427 
(19,507 missing values generated)
(17,595 real changes made)

             | fail_pre_d
             | rug_seriou
             |     s
        drug |         1 |     Total
-------------+-----------+----------
     control |     7,244 |     7,244 
  sotrovimab |        22 |        22 
    paxlovid |        24 |        24 
molnupiravir |        22 |        22 
-------------+-----------+----------
       Total |     7,312 |     7,312 
(4,894 missing values generated)
(4,423 real changes made)

             | fail_pre_i
             |  mae_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    21,719 |    21,719 
  sotrovimab |        72 |        72 
    paxlovid |        59 |        59 
molnupiravir |        75 |        75 
-------------+-----------+----------
       Total |    21,925 |    21,925 
(15,233 missing values generated)
(13,756 real changes made)

             | fail_pre_i
             | mae_seriou
             |     s
        drug |         1 |     Total
-------------+-----------+----------
     control |    11,479 |    11,479 
  sotrovimab |        34 |        34 
    paxlovid |        38 |        38 
molnupiravir |        35 |        35 
-------------+-----------+----------
       Total |    11,586 |    11,586 

. 
. * Follow-up time
. foreach x in $pre_ae_combined{
  2.                 stset stop_`x', id(patient_id) origin(time start_comparator) ente
> r(time start_comparator) exit(time start_comparator_28) failure(fail_`x'==1) 
  3.                 tab _st  
  4.                 tab _t drug if fail_`x'==1 & stop_`x'==`x'
  5.                 count if start_comparator>=stop_`x' & _st==0
  6.                 count if start_comparator==stop_`x' & _st==0
  7. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all==1
Observed time interval: (stop_pre_all[_n-1], stop_pre_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
--------------------------------------------------------------------------
     24,195  observations remaining, representing
     24,195  subjects
          0  failures in single-failure-per-subject data
    701,655  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,624        9.78        9.78
          1 |     24,195       90.22      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    23,930         86         81         98 |    24,195 
-----------+--------------------------------------------+----------
     Total |    23,930         86         81         98 |    24,195 
  2,624
  0

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all_serious==1
Observed time interval: (stop_pre_all_serious[_n-1], stop_pre_all_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
--------------------------------------------------------------------------
     24,195  observations remaining, representing
     24,195  subjects
          0  failures in single-failure-per-subject data
    701,655  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,624        9.78        9.78
          1 |     24,195       90.22      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    23,924         86         81         98 |    24,189 
-----------+--------------------------------------------+----------
     Total |    23,924         86         81         98 |    24,189 
  2,624
  0

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_all==1
Observed time interval: (stop_pre_spc_all[_n-1], stop_pre_spc_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
         82  event time missing (stop_pre_spc_all>=.)       PROBABLE ERROR
      2,542  ignored because never entered
      7,340  observations end on or before enter()
--------------------------------------------------------------------------
     16,855  observations remaining, representing
     16,855  subjects
        571  failures in single-failure-per-subject data
 480,644.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,964       37.15       37.15
          1 |     16,855       62.85      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        20          1          0          0 |        21 
         1 |        19          0          0          0 |        19 
         2 |        13          0          0          0 |        13 
         3 |        24          0          0          0 |        24 
         4 |        23          0          0          1 |        24 
         5 |        13          0          0          0 |        13 
         6 |        11          0          0          0 |        11 
         7 |        15          1          0          0 |        16 
         8 |        22          1          0          0 |        23 
         9 |        33          0          0          1 |        34 
        10 |        17          0          0          0 |        17 
        11 |        15          0          0          0 |        15 
        12 |        17          0          0          0 |        17 
        13 |         9          0          0          0 |         9 
        14 |        16          0          0          0 |        16 
        15 |        17          0          0          0 |        17 
        16 |        25          0          0          0 |        25 
        17 |        22          0          0          0 |        22 
        18 |        19          0          0          0 |        19 
        19 |        24          0          0          1 |        25 
        20 |        17          0          0          0 |        17 
        21 |        16          0          0          0 |        16 
        22 |        25          0          0          0 |        25 
        23 |        16          0          1          0 |        17 
        24 |        15          0          1          0 |        16 
        25 |        12          0          2          0 |        14 
        26 |        22          0          0          1 |        23 
        27 |        19          0          0          0 |        19 
        28 |        17          0          0          0 |        17 
        29 |    15,243         57         62         74 |    15,436 
-----------+--------------------------------------------+----------
     Total |    15,776         60         66         78 |    15,980 
  9,964
  82

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_serious==1
Observed time interval: (stop_pre_spc_serious[_n-1], stop_pre_spc_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
        764  event time missing (stop_pre_spc_serious>=.)   PROBABLE ERROR
      1,860  ignored because never entered
      3,488  observations end on or before enter()
--------------------------------------------------------------------------
     20,707  observations remaining, representing
     20,707  subjects
        286  failures in single-failure-per-subject data
  596,470.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,112       22.79       22.79
          1 |     20,707       77.21      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         9          1          0          0 |        10 
         1 |         7          0          0          0 |         7 
         2 |         7          0          0          0 |         7 
         3 |         7          0          0          0 |         7 
         4 |        17          0          0          0 |        17 
         5 |         7          0          0          1 |         8 
         6 |         4          0          0          0 |         4 
         7 |         6          0          0          0 |         6 
         8 |        12          0          0          0 |        12 
         9 |        11          0          0          1 |        12 
        10 |         7          0          0          0 |         7 
        11 |         7          0          0          0 |         7 
        12 |        11          0          0          0 |        11 
        13 |         7          0          0          0 |         7 
        14 |        14          0          0          0 |        14 
        15 |        11          0          0          0 |        11 
        16 |         7          0          0          0 |         7 
        17 |         9          0          0          0 |         9 
        18 |        10          0          0          0 |        10 
        19 |        14          0          0          1 |        15 
        20 |        11          0          0          0 |        11 
        21 |         9          0          0          0 |         9 
        22 |        16          0          0          0 |        16 
        23 |         9          0          0          0 |         9 
        24 |         8          0          1          0 |         9 
        25 |         7          0          1          0 |         8 
        26 |         9          0          0          1 |        10 
        27 |         9          0          0          0 |         9 
        28 |         7          0          0          0 |         7 
        29 |    12,526         48         45         62 |    12,681 
-----------+--------------------------------------------+----------
     Total |    12,795         49         47         66 |    12,957 
  6,112
  764

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_all==1
Observed time interval: (stop_pre_drug_all[_n-1], stop_pre_drug_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,018  event time missing (stop_pre_drug_all>=.)      PROBABLE ERROR
      1,606  ignored because never entered
      2,164  observations end on or before enter()
--------------------------------------------------------------------------
     22,031  observations remaining, representing
     22,031  subjects
        186  failures in single-failure-per-subject data
    636,268  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,788       17.85       17.85
          1 |     22,031       82.15      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         4          0          0          0 |         4 
         1 |         7          0          0          0 |         7 
         2 |         4          0          0          0 |         4 
         3 |         9          0          0          0 |         9 
         4 |         8          0          0          0 |         8 
         5 |         2          0          0          0 |         2 
         6 |         3          0          0          0 |         3 
         7 |         4          0          0          0 |         4 
         8 |         6          0          0          0 |         6 
         9 |        13          0          0          0 |        13 
        10 |         5          0          0          0 |         5 
        11 |         6          0          0          0 |         6 
        12 |         7          0          0          0 |         7 
        13 |         6          0          0          0 |         6 
        14 |         3          0          0          0 |         3 
        15 |         4          0          0          0 |         4 
        16 |        13          0          0          0 |        13 
        17 |         7          0          0          0 |         7 
        18 |         8          0          0          0 |         8 
        19 |         8          0          0          0 |         8 
        20 |         6          0          0          0 |         6 
        21 |         4          0          0          0 |         4 
        22 |         5          0          0          0 |         5 
        23 |         3          0          0          0 |         3 
        24 |         6          0          0          0 |         6 
        25 |         6          0          0          0 |         6 
        26 |        12          0          0          0 |        12 
        27 |         8          0          0          0 |         8 
        28 |         4          0          0          0 |         4 
        29 |    12,327         45         53         51 |    12,476 
-----------+--------------------------------------------+----------
     Total |    12,508         45         53         51 |    12,657 
  4,788
  1,018

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_serious==1
Observed time interval: (stop_pre_drug_serious[_n-1], stop_pre_drug_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,912  event time missing (stop_pre_drug_serious>=.)  PROBABLE ERROR
        712  ignored because never entered
      1,122  observations end on or before enter()
--------------------------------------------------------------------------
     23,073  observations remaining, representing
     23,073  subjects
        100  failures in single-failure-per-subject data
 667,699.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,746       13.97       13.97
          1 |     23,073       86.03      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         1          0          0          0 |         1 
         1 |         4          0          0          0 |         4 
         2 |         2          0          0          0 |         2 
         3 |         5          0          0          0 |         5 
         4 |         3          0          0          0 |         3 
         5 |         1          0          0          0 |         1 
         6 |         1          0          0          0 |         1 
         7 |         3          0          0          0 |         3 
         8 |         5          0          0          0 |         5 
         9 |         4          0          0          0 |         4 
        10 |         5          0          0          0 |         5 
        11 |         5          0          0          0 |         5 
        12 |         5          0          0          0 |         5 
        13 |         4          0          0          0 |         4 
        14 |         2          0          0          0 |         2 
        15 |         3          0          0          0 |         3 
        16 |         6          0          0          0 |         6 
        17 |         4          0          0          0 |         4 
        18 |         1          0          0          0 |         1 
        19 |         2          0          0          0 |         2 
        20 |         4          0          0          0 |         4 
        21 |         3          0          0          0 |         3 
        22 |         3          0          0          0 |         3 
        23 |         3          0          0          0 |         3 
        24 |         3          0          0          0 |         3 
        25 |         3          0          0          0 |         3 
        26 |         5          0          0          0 |         5 
        27 |         7          0          0          0 |         7 
        28 |         2          0          0          0 |         2 
        29 |     5,316         19         23         21 |     5,379 
-----------+--------------------------------------------+----------
     Total |     5,415         19         23         21 |     5,478 
  3,746
  1,912

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_all==1
Observed time interval: (stop_pre_imae_all[_n-1], stop_pre_imae_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
        471  event time missing (stop_pre_imae_all>=.)      PROBABLE ERROR
      2,153  ignored because never entered
      3,701  observations end on or before enter()
--------------------------------------------------------------------------
     20,494  observations remaining, representing
     20,494  subjects
        323  failures in single-failure-per-subject data
 589,807.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,325       23.58       23.58
          1 |     20,494       76.42      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        13          0          0          0 |        13 
         1 |         6          0          0          0 |         6 
         2 |        11          0          0          0 |        11 
         3 |        10          0          0          1 |        11 
         4 |        15          0          1          0 |        16 
         5 |        12          0          0          0 |        12 
         6 |         8          0          0          0 |         8 
         7 |         6          0          0          0 |         6 
         8 |         7          0          0          0 |         7 
         9 |         8          0          0          0 |         8 
        10 |        11          0          0          0 |        11 
        11 |        16          0          0          0 |        16 
        12 |        13          0          0          0 |        13 
        13 |        17          0          0          0 |        17 
        14 |         7          0          0          0 |         7 
        15 |         5          0          0          0 |         5 
        16 |         9          0          0          0 |         9 
        17 |         6          0          0          0 |         6 
        18 |         9          0          0          0 |         9 
        19 |        13          0          0          0 |        13 
        20 |        11          0          0          0 |        11 
        21 |        12          0          0          1 |        13 
        22 |        10          0          0          0 |        10 
        23 |        10          0          0          0 |        10 
        24 |        10          0          0          0 |        10 
        25 |         7          0          0          0 |         7 
        26 |        16          0          0          0 |        16 
        27 |        18          0          0          0 |        18 
        28 |        11          0          0          0 |        11 
        29 |    15,578         69         53         61 |    15,761 
-----------+--------------------------------------------+----------
     Total |    15,885         69         54         63 |    16,071 
  6,325
  471

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_serious==1
Observed time interval: (stop_pre_imae_serious[_n-1], stop_pre_imae_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,477  event time missing (stop_pre_imae_serious>=.)  PROBABLE ERROR
      1,147  ignored because never entered
      1,924  observations end on or before enter()
--------------------------------------------------------------------------
     22,271  observations remaining, representing
     22,271  subjects
        154  failures in single-failure-per-subject data
 643,562.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,548       16.96       16.96
          1 |     22,271       83.04      100.00
------------+-----------------------------------
      Total |     26,819      100.00

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         7          0          0          0 |         7 
         1 |         6          0          0          0 |         6 
         2 |         7          0          0          0 |         7 
         3 |         6          0          0          1 |         7 
         4 |         7          0          0          0 |         7 
         5 |         8          0          0          0 |         8 
         6 |         5          0          0          0 |         5 
         7 |         3          0          0          0 |         3 
         8 |         3          0          0          0 |         3 
         9 |         4          0          0          0 |         4 
        10 |         4          0          0          0 |         4 
        11 |         2          0          0          0 |         2 
        12 |         6          0          0          0 |         6 
        13 |        10          0          0          0 |        10 
        14 |         4          0          0          0 |         4 
        15 |         4          0          0          0 |         4 
        16 |         3          0          0          0 |         3 
        17 |         2          0          0          0 |         2 
        18 |         3          0          0          0 |         3 
        19 |         6          0          0          0 |         6 
        20 |         4          0          0          0 |         4 
        21 |         5          0          0          1 |         6 
        22 |         5          0          0          0 |         5 
        23 |         5          0          0          0 |         5 
        24 |         4          0          0          0 |         4 
        25 |         3          0          0          0 |         3 
        26 |         7          0          0          0 |         7 
        27 |         7          0          0          0 |         7 
        28 |         7          0          0          0 |         7 
        29 |     8,268         32         36         30 |     8,366 
-----------+--------------------------------------------+----------
     Total |     8,415         32         36         32 |     8,515 
  4,548
  1,477

. 
. ********************************************************
. *       RATES OF EVENTS         *
. ********************************************************
. tempname comparator_rates

. postfile `comparator_rates' str20(failure) ///
>                 all_ptime all_events all_rate all_lci all_uci ///
>                 control_ptime control_events control_rate control_lci_ control_uci /
> //
>                 sot_ptime sot_events sot_rate sot_lci sot_uci ///
>                 pax_ptime pax_events pax_rate pax_lci pax_uci ///
>                 mol_ptime mol_events mol_rate mol_lci mol_uci ///
>                 using "$projectdir/output/tables/comparator_rates", replace     

.         
. foreach fail in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.         stset stop_`fail', id(patient_id) origin(time start_comparator) enter(tim
> e start_comparator) exit(time start_comparator_28) failure(fail_`fail'==1)          
>            
  3.                 stptime 
  4.                                         local all_rate = `r(rate)'
  5.                                         local all_ptime = `r(ptime)'
  6.                                         local all_lci = `r(lb)'
  7.                                         local all_uci = `r(ub)'
  8.                                         local all_events = `r(failures)'         
>                                
  9.                 stptime if drug == 0
 10.                                         local control_rate = `r(rate)'
 11.                                         local control_ptime = `r(ptime)'
 12.                                         local control_lci = `r(lb)'
 13.                                         local control_uci = `r(ub)'
 14.                                         local control_events = `r(failures)'
 15.                 display "no drug"
 16.                 stptime if drug == 1
 17.                                         local sot_rate = `r(rate)'
 18.                                         local sot_ptime = `r(ptime)'
 19.                                         local sot_lci = `r(lb)'
 20.                                         local sot_uci = `r(ub)'
 21.                                         local sot_events = `r(failures)'
 22.                 display "sotrovimab"
 23.                 stptime if drug == 2
 24.                                         local pax_rate = `r(rate)'
 25.                                         local pax_ptime = `r(ptime)'
 26.                                         local pax_lci = `r(lb)'
 27.                                         local pax_uci = `r(ub)'
 28.                                         local pax_events = `r(failures)'         
>        
 29.                 display "paxlovid"
 30.                 stptime if drug == 3
 31.                                         local mol_rate = `r(rate)'
 32.                                         local mol_ptime = `r(ptime)'
 33.                                         local mol_lci = `r(lb)'
 34.                                         local mol_uci = `r(ub)'
 35.                                         local mol_events = `r(failures)'         
>        
 36.                 display "molnupavir"                    
 37.                 post `comparator_rates' ("`fail'")      (`all_ptime') (`all_event
> s') (`all_rate') (`all_lci') (`all_uci') ///
>                                         (`control_ptime') (`control_events') (`contr
> ol_rate') (`control_lci') (`control_uci') ///
>                                         (`sot_ptime') (`sot_events') (`sot_rate') (`
> sot_lci') (`sot_uci') ///
>                                         (`pax_ptime') (`pax_events') (`pax_rate') (`
> pax_lci') (`pax_uci') ///
>                                         (`mol_ptime') (`mol_events') (`mol_rate') (`
> mol_lci') (`mol_uci')       
 38.                                         
. }

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diverticulitis==1
Observed time interval: (stop_pre_diverticulitis[_n-1], stop_pre_diverticulitis]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,934  event time missing (stop_pre_diverticulitis>=.)PROBABLE ERROR
        690  ignored because never entered
        778  observations end on or before enter()
--------------------------------------------------------------------------
     23,417  observations remaining, representing
     23,417  subjects
         71  failures in single-failure-per-subject data
 678,098.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    678098.75         71    .0001047    .000083    .0001321

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    670648.75         70   .00010438   .0000826    .0001319
no drug

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2233          0           0          .           .
paxlovid

         Failure _d: fail_pre_diverticulitis==1
   Analysis time _t: (stop_pre_diverticulitis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2723          1   .00036724   .0000517    .0026071
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diarrhoea==1
Observed time interval: (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,861  event time missing (stop_pre_diarrhoea>=.)     PROBABLE ERROR
        763  ignored because never entered
      1,097  observations end on or before enter()
--------------------------------------------------------------------------
     23,098  observations remaining, representing
     23,098  subjects
        102  failures in single-failure-per-subject data
    668,452  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       668452        102   .00015259   .0001257    .0001853

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       660946        101   .00015281   .0001257    .0001857
no drug

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
sotrovimab

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2344          1   .00042662   .0000601    .0030286
paxlovid

         Failure _d: fail_pre_diarrhoea==1
   Analysis time _t: (stop_pre_diarrhoea-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_taste==1
Observed time interval: (stop_pre_taste[_n-1], stop_pre_taste]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,129  event time missing (stop_pre_taste>=.)         PROBABLE ERROR
        495  ignored because never entered
        761  observations end on or before enter()
--------------------------------------------------------------------------
     23,434  observations remaining, representing
     23,434  subjects
         75  failures in single-failure-per-subject data
 678,642.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    678642.75         75   .00011051   .0000881    .0001386

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    671187.75         73   .00010876   .0000865    .0001368
no drug

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2357          1   .00042427   .0000598    .0030119
sotrovimab

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2343          1    .0004268   .0000601    .0030299
paxlovid

         Failure _d: fail_pre_taste==1
   Analysis time _t: (stop_pre_taste-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2755          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_rash==1
Observed time interval: (stop_pre_rash[_n-1], stop_pre_rash]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,892  event time missing (stop_pre_rash>=.)          PROBABLE ERROR
        732  ignored because never entered
        796  observations end on or before enter()
--------------------------------------------------------------------------
     23,399  observations remaining, representing
     23,399  subjects
         54  failures in single-failure-per-subject data
 677,788.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    677788.25         54   .00007967    .000061     .000104

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    670264.25         53   .00007907   .0000604    .0001035
no drug

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2378          0           0          .           .
sotrovimab

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_rash==1
   Analysis time _t: (stop_pre_rash-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2797          1   .00035753   .0000504    .0025381
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_bronchospasm==1
Observed time interval: (stop_pre_bronchospasm[_n-1], stop_pre_bronchospasm]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,354  event time missing (stop_pre_bronchospasm>=.)  PROBABLE ERROR
        270  ignored because never entered
        395  observations end on or before enter()
--------------------------------------------------------------------------
     23,800  observations remaining, representing
     23,800  subjects
         40  failures in single-failure-per-subject data
    689,688  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       689688         40     .000058   .0000425    .0000791

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       682032         40   .00005865    .000043      .00008
no drug

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2465          0           0          .           .
sotrovimab

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_bronchospasm==1
   Analysis time _t: (stop_pre_bronchospasm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_contactderm==1
Observed time interval: (stop_pre_contactderm[_n-1], stop_pre_contactderm]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,882  event time missing (stop_pre_contactderm>=.)   PROBABLE ERROR
        742  ignored because never entered
        750  observations end on or before enter()
--------------------------------------------------------------------------
     23,445  observations remaining, representing
     23,445  subjects
         68  failures in single-failure-per-subject data
    678,872  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       678872         68   .00010017    .000079     .000127

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       671414         67   .00009979   .0000785    .0001268
no drug

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2291          0           0          .           .
paxlovid

         Failure _d: fail_pre_contactderm==1
   Analysis time _t: (stop_pre_contactderm-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2731          1   .00036617   .0000516    .0025994
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_dizziness==1
Observed time interval: (stop_pre_dizziness[_n-1], stop_pre_dizziness]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,906  event time missing (stop_pre_dizziness>=.)     PROBABLE ERROR
        718  ignored because never entered
        743  observations end on or before enter()
--------------------------------------------------------------------------
     23,452  observations remaining, representing
     23,452  subjects
         69  failures in single-failure-per-subject data
 679,123.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    679123.75         69    .0001016   .0000802    .0001286

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    671621.75         66   .00009827   .0000772    .0001251
no drug

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2443          1   .00040933   .0000577    .0029059
sotrovimab

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2291          0           0          .           .
paxlovid

         Failure _d: fail_pre_dizziness==1
   Analysis time _t: (stop_pre_dizziness-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2768          2   .00072254   .0001807     .002889
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_nausea_vomit==1
Observed time interval: (stop_pre_nausea_vomit[_n-1], stop_pre_nausea_vomit]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,124  event time missing (stop_pre_nausea_vomit>=.)  PROBABLE ERROR
        500  ignored because never entered
        755  observations end on or before enter()
--------------------------------------------------------------------------
     23,440  observations remaining, representing
     23,440  subjects
         60  failures in single-failure-per-subject data
    678,803  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       678803         60   .00008839   .0000686    .0001138

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    671334.25         57   .00008491   .0000655    .0001101
no drug

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2407.75          1   .00041533   .0000585    .0029484
sotrovimab

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2287          1   .00043725   .0000616    .0031041
paxlovid

         Failure _d: fail_pre_nausea_vomit==1
   Analysis time _t: (stop_pre_nausea_vomit-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2774          1   .00036049   .0000508    .0025591
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_headache==1
Observed time interval: (stop_pre_headache[_n-1], stop_pre_headache]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,914  event time missing (stop_pre_headache>=.)      PROBABLE ERROR
        710  ignored because never entered
        844  observations end on or before enter()
--------------------------------------------------------------------------
     23,351  observations remaining, representing
     23,351  subjects
         65  failures in single-failure-per-subject data
 676,232.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    676232.75         65   .00009612   .0000754    .0001226

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    668667.75         64   .00009571   .0000749    .0001223
no drug

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2316          1   .00043178   .0000608    .0030652
paxlovid

         Failure _d: fail_pre_headache==1
   Analysis time _t: (stop_pre_headache-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_anaphylaxis==1
Observed time interval: (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,939  event time missing (stop_pre_anaphylaxis>=.)   PROBABLE ERROR
        685  ignored because never entered
        741  observations end on or before enter()
--------------------------------------------------------------------------
     23,454  observations remaining, representing
     23,454  subjects
         75  failures in single-failure-per-subject data
    679,137  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       679137         75   .00011043   .0000881    .0001385

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       671597         75   .00011167   .0000891      .00014
no drug

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2378          0           0          .           .
sotrovimab

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_anaphylaxis==1
   Analysis time _t: (stop_pre_anaphylaxis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drugreaction==1
Observed time interval: (stop_pre_drugreaction[_n-1], stop_pre_drugreaction]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,368  event time missing (stop_pre_drugreaction>=.)  PROBABLE ERROR
      1,256  ignored because never entered
      1,466  observations end on or before enter()
--------------------------------------------------------------------------
     22,729  observations remaining, representing
     22,729  subjects
        123  failures in single-failure-per-subject data
    657,358  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       657358        123   .00018711   .0001568    .0002233

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       649934        122   .00018771   .0001572    .0002242
no drug

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          1   .00041051   .0000578    .0029142
sotrovimab

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2262          0           0          .           .
paxlovid

         Failure _d: fail_pre_drugreaction==1
   Analysis time _t: (stop_pre_drugreaction-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2726          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ra==1
Observed time interval: (stop_pre_ra[_n-1], stop_pre_ra]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,985  event time missing (stop_pre_ra>=.)            PROBABLE ERROR
        639  ignored because never entered
        687  observations end on or before enter()
--------------------------------------------------------------------------
     23,508  observations remaining, representing
     23,508  subjects
         65  failures in single-failure-per-subject data
  680,716.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     680716.5         65   .00009549   .0000749    .0001218

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     673144.5         64   .00009508   .0000744    .0001215
no drug

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          0           0          .           .
paxlovid

         Failure _d: fail_pre_ra==1
   Analysis time _t: (stop_pre_ra-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2758          1   .00036258   .0000511     .002574
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_sle==1
Observed time interval: (stop_pre_sle[_n-1], stop_pre_sle]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,990  event time missing (stop_pre_sle>=.)           PROBABLE ERROR
        634  ignored because never entered
        680  observations end on or before enter()
--------------------------------------------------------------------------
     23,515  observations remaining, representing
     23,515  subjects
         66  failures in single-failure-per-subject data
  681,109.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     681109.5         66    .0000969   .0000761    .0001233

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     673569.5         66   .00009799    .000077    .0001247
no drug

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2291          0           0          .           .
paxlovid

         Failure _d: fail_pre_sle==1
   Analysis time _t: (stop_pre_sle-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2755          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psorasis==1
Observed time interval: (stop_pre_psorasis[_n-1], stop_pre_psorasis]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,977  event time missing (stop_pre_psorasis>=.)      PROBABLE ERROR
        647  ignored because never entered
        683  observations end on or before enter()
--------------------------------------------------------------------------
     23,512  observations remaining, representing
     23,512  subjects
         64  failures in single-failure-per-subject data
 680,968.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    680968.25         64   .00009398   .0000736    .0001201

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    673366.25         63   .00009356   .0000731    .0001198
no drug

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2295          1   .00043573   .0000614    .0030933
paxlovid

         Failure _d: fail_pre_psorasis==1
   Analysis time _t: (stop_pre_psorasis-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psa==1
Observed time interval: (stop_pre_psa[_n-1], stop_pre_psa]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,002  event time missing (stop_pre_psa>=.)           PROBABLE ERROR
        622  ignored because never entered
        690  observations end on or before enter()
--------------------------------------------------------------------------
     23,505  observations remaining, representing
     23,505  subjects
         59  failures in single-failure-per-subject data
 680,699.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    680699.75         59   .00008668   .0000672    .0001119

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    673080.75         58   .00008617   .0000666    .0001115
no drug

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_psa==1
   Analysis time _t: (stop_pre_psa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2776          1   .00036023   .0000507    .0025573
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_axspa==1
Observed time interval: (stop_pre_axspa[_n-1], stop_pre_axspa]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,985  event time missing (stop_pre_axspa>=.)         PROBABLE ERROR
        639  ignored because never entered
        687  observations end on or before enter()
--------------------------------------------------------------------------
     23,508  observations remaining, representing
     23,508  subjects
         48  failures in single-failure-per-subject data
  681,087.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     681087.5         48   .00007048   .0000531    .0000935

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     673489.5         48   .00007127   .0000537    .0000946
no drug

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_axspa==1
   Analysis time _t: (stop_pre_axspa-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2755          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ibd==1
Observed time interval: (stop_pre_ibd[_n-1], stop_pre_ibd]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,976  event time missing (stop_pre_ibd>=.)           PROBABLE ERROR
        648  ignored because never entered
        640  observations end on or before enter()
--------------------------------------------------------------------------
     23,555  observations remaining, representing
     23,555  subjects
         72  failures in single-failure-per-subject data
 682,014.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    682014.25         72   .00010557   .0000838     .000133

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    674474.25         72   .00010675   .0000847    .0001345
no drug

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2407          0           0          .           .
sotrovimab

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          0           0          .           .
paxlovid

         Failure _d: fail_pre_ibd==1
   Analysis time _t: (stop_pre_ibd-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diverticulitis_serious==1
Observed time interval: (stop_pre_diverticulitis_serious[_n-1], stop_pre_diverticuliti
> s_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,375  event time missing (stop_pre_diverticulitis_serious>=.)PROBABLE ERROR
        249  ignored because never entered
        382  observations end on or before enter()
--------------------------------------------------------------------------
     23,813  observations remaining, representing
     23,813  subjects
         42  failures in single-failure-per-subject data
 689,887.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    689887.75         42   .00006088    .000045    .0000824

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    682379.75         41   .00006008   .0000442    .0000816
no drug

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2233          0           0          .           .
paxlovid

         Failure _d: fail_pre_diverticulitis_serious==1
   Analysis time _t: (stop_pre_diverticulitis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2781          1   .00035958   .0000507    .0025527
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_diarrhoea_serious==1
Observed time interval: (stop_pre_diarrhoea_serious[_n-1], stop_pre_diarrhoea_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,083  event time missing (stop_pre_diarrhoea_serious>=.)PROBABLE ERROR
        541  ignored because never entered
        743  observations end on or before enter()
--------------------------------------------------------------------------
     23,452  observations remaining, representing
     23,452  subjects
         65  failures in single-failure-per-subject data
    679,269  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       679269         65   .00009569    .000075     .000122

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       671734         64   .00009528   .0000746    .0001217
no drug

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2378          0           0          .           .
sotrovimab

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2344          1   .00042662   .0000601    .0030286
paxlovid

         Failure _d: fail_pre_diarrhoea_serious==1
   Analysis time _t: (stop_pre_diarrhoea_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_taste_serious==1
Observed time interval: (stop_pre_taste_serious[_n-1], stop_pre_taste_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,357  event time missing (stop_pre_taste_serious>=.) PROBABLE ERROR
        267  ignored because never entered
        400  observations end on or before enter()
--------------------------------------------------------------------------
     23,795  observations remaining, representing
     23,795  subjects
         29  failures in single-failure-per-subject data
    689,695  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       689695         29   .00004205   .0000292    .0000605

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       682097         29   .00004252   .0000295    .0000612
no drug

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2407          0           0          .           .
sotrovimab

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_taste_serious==1
   Analysis time _t: (stop_pre_taste_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_rash_serious==1
Observed time interval: (stop_pre_rash_serious[_n-1], stop_pre_rash_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,346  event time missing (stop_pre_rash_serious>=.)  PROBABLE ERROR
        278  ignored because never entered
        391  observations end on or before enter()
--------------------------------------------------------------------------
     23,804  observations remaining, representing
     23,804  subjects
         34  failures in single-failure-per-subject data
 689,870.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    689870.75         34   .00004928   .0000352     .000069

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    682214.75         34   .00004984   .0000356    .0000697
no drug

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2465          0           0          .           .
sotrovimab

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_rash_serious==1
   Analysis time _t: (stop_pre_rash_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_contactderm_serious==1
Observed time interval: (stop_pre_contactderm_serious[_n-1], stop_pre_contactderm_seri
> ous]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,882  event time missing (stop_pre_contactderm_serious>=.)PROBABLE ERROR
        742  ignored because never entered
        750  observations end on or before enter()
--------------------------------------------------------------------------
     23,445  observations remaining, representing
     23,445  subjects
         68  failures in single-failure-per-subject data
    678,872  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       678872         68   .00010017    .000079     .000127

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       671414         67   .00009979   .0000785    .0001268
no drug

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2291          0           0          .           .
paxlovid

         Failure _d: fail_pre_contactderm_serious==1
   Analysis time _t: (stop_pre_contactderm_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2731          1   .00036617   .0000516    .0025994
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_dizziness_serious==1
Observed time interval: (stop_pre_dizziness_serious[_n-1], stop_pre_dizziness_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,361  event time missing (stop_pre_dizziness_serious>=.)PROBABLE ERROR
        263  ignored because never entered
        370  observations end on or before enter()
--------------------------------------------------------------------------
     23,825  observations remaining, representing
     23,825  subjects
         27  failures in single-failure-per-subject data
    690,543  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       690543         27    .0000391   .0000268     .000057

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       682907         26   .00003807   .0000259    .0000559
no drug

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_dizziness_serious==1
   Analysis time _t: (stop_pre_dizziness_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2793          1   .00035804   .0000504    .0025417
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_nausea_vomit_serious==1
Observed time interval: (stop_pre_nausea_vomit_serious[_n-1], stop_pre_nausea_vomit_se
> rious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,352  event time missing (stop_pre_nausea_vomit_serious>=.)PROBABLE ERROR
        272  ignored because never entered
        379  observations end on or before enter()
--------------------------------------------------------------------------
     23,816  observations remaining, representing
     23,816  subjects
         32  failures in single-failure-per-subject data
  690,155.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     690155.5         32   .00004637   .0000328    .0000656

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    682570.75         29   .00004249   .0000295    .0000611
no drug

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2436.75          1   .00041038   .0000578    .0029133
sotrovimab

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2345          1   .00042644   .0000601    .0030273
paxlovid

         Failure _d: fail_pre_nausea_vomit_serious==1
   Analysis time _t: (stop_pre_nausea_vomit_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2803          1   .00035676   .0000503    .0025327
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_headache_serious==1
Observed time interval: (stop_pre_headache_serious[_n-1], stop_pre_headache_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,356  event time missing (stop_pre_headache_serious>=.)PROBABLE ERROR
        268  ignored because never entered
        431  observations end on or before enter()
--------------------------------------------------------------------------
     23,764  observations remaining, representing
     23,764  subjects
         34  failures in single-failure-per-subject data
 688,663.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    688663.25         34   .00004937   .0000353    .0000691

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    681036.25         34   .00004992   .0000357    .0000699
no drug

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_headache_serious==1
   Analysis time _t: (stop_pre_headache_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_anaphylaxis_serious==1
Observed time interval: (stop_pre_anaphylaxis_serious[_n-1], stop_pre_anaphylaxis_seri
> ous]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,358  event time missing (stop_pre_anaphylaxis_serious>=.)PROBABLE ERROR
        266  ignored because never entered
        375  observations end on or before enter()
--------------------------------------------------------------------------
     23,820  observations remaining, representing
     23,820  subjects
         33  failures in single-failure-per-subject data
    690,291  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       690291         33   .00004781    .000034    .0000672

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       682664         33   .00004834   .0000344     .000068
no drug

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_anaphylaxis_serious==1
   Analysis time _t: (stop_pre_anaphylaxis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drugreaction_serious==1
Observed time interval: (stop_pre_drugreaction_serious[_n-1], stop_pre_drugreaction_se
> rious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,128  event time missing (stop_pre_drugreaction_serious>=.)PROBABLE ERROR
        496  ignored because never entered
        758  observations end on or before enter()
--------------------------------------------------------------------------
     23,437  observations remaining, representing
     23,437  subjects
         71  failures in single-failure-per-subject data
 678,692.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    678692.75         71   .00010461   .0000829     .000132

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    671094.75         71    .0001058   .0000838    .0001335
no drug

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2465          0           0          .           .
sotrovimab

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          0           0          .           .
paxlovid

         Failure _d: fail_pre_drugreaction_serious==1
   Analysis time _t: (stop_pre_drugreaction_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ra_serious==1
Observed time interval: (stop_pre_ra_serious[_n-1], stop_pre_ra_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,384  event time missing (stop_pre_ra_serious>=.)    PROBABLE ERROR
        240  ignored because never entered
        326  observations end on or before enter()
--------------------------------------------------------------------------
     23,869  observations remaining, representing
     23,869  subjects
         28  failures in single-failure-per-subject data
 691,741.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    691741.75         28   .00004048   .0000279    .0000586

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    684111.75         27   .00003947   .0000271    .0000576
no drug

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_ra_serious==1
   Analysis time _t: (stop_pre_ra_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2787          1   .00035881   .0000505    .0025472
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_sle_serious==1
Observed time interval: (stop_pre_sle_serious[_n-1], stop_pre_sle_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,387  event time missing (stop_pre_sle_serious>=.)   PROBABLE ERROR
        237  ignored because never entered
        344  observations end on or before enter()
--------------------------------------------------------------------------
     23,851  observations remaining, representing
     23,851  subjects
         35  failures in single-failure-per-subject data
  691,210.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     691210.5         35   .00005064   .0000364    .0000705

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     683525.5         35   .00005121   .0000368    .0000713
no drug

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_sle_serious==1
   Analysis time _t: (stop_pre_sle_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psorasis_serious==1
Observed time interval: (stop_pre_psorasis_serious[_n-1], stop_pre_psorasis_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,386  event time missing (stop_pre_psorasis_serious>=.)PROBABLE ERROR
        238  ignored because never entered
        340  observations end on or before enter()
--------------------------------------------------------------------------
     23,855  observations remaining, representing
     23,855  subjects
         26  failures in single-failure-per-subject data
  691,367.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     691367.5         26   .00003761   .0000256    .0000552

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     683740.5         26   .00003803   .0000259    .0000558
no drug

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          0           0          .           .
paxlovid

         Failure _d: fail_pre_psorasis_serious==1
   Analysis time _t: (stop_pre_psorasis_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_psa_serious==1
Observed time interval: (stop_pre_psa_serious[_n-1], stop_pre_psa_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,401  event time missing (stop_pre_psa_serious>=.)   PROBABLE ERROR
        223  ignored because never entered
        347  observations end on or before enter()
--------------------------------------------------------------------------
     23,848  observations remaining, representing
     23,848  subjects
         28  failures in single-failure-per-subject data
 691,141.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    691141.25         28   .00004051    .000028    .0000587

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    683464.25         27    .0000395   .0000271    .0000576
no drug

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_psa_serious==1
   Analysis time _t: (stop_pre_psa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2834          1   .00035286   .0000497     .002505
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_axspa_serious==1
Observed time interval: (stop_pre_axspa_serious[_n-1], stop_pre_axspa_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,375  event time missing (stop_pre_axspa_serious>=.) PROBABLE ERROR
        249  ignored because never entered
        358  observations end on or before enter()
--------------------------------------------------------------------------
     23,837  observations remaining, representing
     23,837  subjects
         19  failures in single-failure-per-subject data
 691,007.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    691007.75         19    .0000275   .0000175    .0000431

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    683351.75         19    .0000278   .0000177    .0000436
no drug

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_axspa_serious==1
   Analysis time _t: (stop_pre_axspa_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_ibd_serious==1
Observed time interval: (stop_pre_ibd_serious[_n-1], stop_pre_ibd_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,383  event time missing (stop_pre_ibd_serious>=.)   PROBABLE ERROR
        241  ignored because never entered
        314  observations end on or before enter()
--------------------------------------------------------------------------
     23,881  observations remaining, representing
     23,881  subjects
         32  failures in single-failure-per-subject data
    692,089  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       692089         32   .00004624   .0000327    .0000654

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       684491         32   .00004675   .0000331    .0000661
no drug

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          0           0          .           .
paxlovid

         Failure _d: fail_pre_ibd_serious==1
   Analysis time _t: (stop_pre_ibd_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all==1
Observed time interval: (stop_pre_all[_n-1], stop_pre_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
--------------------------------------------------------------------------
     24,195  observations remaining, representing
     24,195  subjects
          0  failures in single-failure-per-subject data
    701,655  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       701655          0           0          .           .

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       693970          0           0          .           .
no drug

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_all==1
   Analysis time _t: (stop_pre_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_all_serious==1
Observed time interval: (stop_pre_all_serious[_n-1], stop_pre_all_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      2,624  ignored because never entered
--------------------------------------------------------------------------
     24,195  observations remaining, representing
     24,195  subjects
          0  failures in single-failure-per-subject data
    701,655  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       701655          0           0          .           .

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       693970          0           0          .           .
no drug

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2494          0           0          .           .
sotrovimab

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2349          0           0          .           .
paxlovid

         Failure _d: fail_pre_all_serious==1
   Analysis time _t: (stop_pre_all_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2842          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_all==1
Observed time interval: (stop_pre_spc_all[_n-1], stop_pre_spc_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
         82  event time missing (stop_pre_spc_all>=.)       PROBABLE ERROR
      2,542  ignored because never entered
      7,340  observations end on or before enter()
--------------------------------------------------------------------------
     16,855  observations remaining, representing
     16,855  subjects
        571  failures in single-failure-per-subject data
 480,644.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    480644.75        571   .00118799   .0010944    .0012895

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       474587        559   .00117787   .0010842    .0012797
no drug

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      1813.75          4   .00220538   .0008277     .005876
sotrovimab

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         1982          4   .00201816   .0007575    .0053772
paxlovid

         Failure _d: fail_pre_spc_all==1
   Analysis time _t: (stop_pre_spc_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2262          4   .00176835   .0006637    .0047116
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_spc_serious==1
Observed time interval: (stop_pre_spc_serious[_n-1], stop_pre_spc_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
        764  event time missing (stop_pre_spc_serious>=.)   PROBABLE ERROR
      1,860  ignored because never entered
      3,488  observations end on or before enter()
--------------------------------------------------------------------------
     20,707  observations remaining, representing
     20,707  subjects
        286  failures in single-failure-per-subject data
  596,470.5  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |     596470.5        286   .00047949    .000427    .0005384

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    589604.75        279    .0004732   .0004208    .0005321
no drug

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |      2088.75          1   .00047876   .0000674    .0033987
sotrovimab

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2166          2   .00092336   .0002309     .003692
paxlovid

         Failure _d: fail_pre_spc_serious==1
   Analysis time _t: (stop_pre_spc_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2611          4   .00153198    .000575    .0040818
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_all==1
Observed time interval: (stop_pre_drug_all[_n-1], stop_pre_drug_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,018  event time missing (stop_pre_drug_all>=.)      PROBABLE ERROR
      1,606  ignored because never entered
      2,164  observations end on or before enter()
--------------------------------------------------------------------------
     22,031  observations remaining, representing
     22,031  subjects
        186  failures in single-failure-per-subject data
    636,268  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       636268        186   .00029233   .0002532    .0003375

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |       628989        185   .00029412   .0002547    .0003397
no drug

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          1   .00043103   .0000607    .0030599
sotrovimab

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2262          0           0          .           .
paxlovid

         Failure _d: fail_pre_drug_all==1
   Analysis time _t: (stop_pre_drug_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2697          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_drug_serious==1
Observed time interval: (stop_pre_drug_serious[_n-1], stop_pre_drug_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,912  event time missing (stop_pre_drug_serious>=.)  PROBABLE ERROR
        712  ignored because never entered
      1,122  observations end on or before enter()
--------------------------------------------------------------------------
     23,073  observations remaining, representing
     23,073  subjects
        100  failures in single-failure-per-subject data
 667,699.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    667699.75        100   .00014977   .0001231    .0001822

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    660159.75        100   .00015148   .0001245    .0001843
no drug

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2407          0           0          .           .
sotrovimab

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2320          0           0          .           .
paxlovid

         Failure _d: fail_pre_drug_serious==1
   Analysis time _t: (stop_pre_drug_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2813          0           0          .           .
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_all==1
Observed time interval: (stop_pre_imae_all[_n-1], stop_pre_imae_all]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
        471  event time missing (stop_pre_imae_all>=.)      PROBABLE ERROR
      2,153  ignored because never entered
      3,701  observations end on or before enter()
--------------------------------------------------------------------------
     20,494  observations remaining, representing
     20,494  subjects
        323  failures in single-failure-per-subject data
 589,807.75  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    589807.75        323   .00054764   .0004911    .0006107

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    582761.75        320   .00054911   .0004921    .0006127
no drug

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2407          0           0          .           .
sotrovimab

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2179          1   .00045893   .0000646    .0032579
paxlovid

         Failure _d: fail_pre_imae_all==1
   Analysis time _t: (stop_pre_imae_all-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2460          2   .00081301   .0002033    .0032508
molnupavir

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_pre_imae_serious==1
Observed time interval: (stop_pre_imae_serious[_n-1], stop_pre_imae_serious]
     Enter on or after: time start_comparator
     Exit on or before: time start_comparator_28
     Time for analysis: (time-origin)
                Origin: time start_comparator

--------------------------------------------------------------------------
     26,819  total observations
      1,477  event time missing (stop_pre_imae_serious>=.)  PROBABLE ERROR
      1,147  ignored because never entered
      1,924  observations end on or before enter()
--------------------------------------------------------------------------
     22,271  observations remaining, representing
     22,271  subjects
        154  failures in single-failure-per-subject data
 643,562.25  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        29

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    643562.25        154   .00023929   .0002043    .0002802

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |    636114.25        152   .00023895   .0002038    .0002801
no drug

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2436          0           0          .           .
sotrovimab

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2291          0           0          .           .
paxlovid

         Failure _d: fail_pre_imae_serious==1
   Analysis time _t: (stop_pre_imae_serious-origin)
             Origin: time start_comparator
  Enter on or after: time start_comparator
  Exit on or before: time start_comparator_28
        ID variable: patient_id

Estimated person-time and incidence rate

    Cohort |  Person-time   Failures        Rate   [95% conf. interval]
-----------+-----------------------------------------------------------
     Total |         2721          2   .00073502   .0001838    .0029389
molnupavir

. postclose `comparator_rates'

. use "$projectdir/output/tables/comparator_rates", clear

. order failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB
    and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/comparator_rate
    > s.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates.csv", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB an
> d antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/comparator_rates.
> csv saved

. 
. ** Redact and round rates
. use "$projectdir/output/tables/comparator_rates", clear

. foreach var of varlist *events *ptime  {
  2. gen `var'_midpoint = (ceil(`var'/6)*6) - (floor(6/2) * (`var'!=0))
  3. }

. foreach var in all control sot pax mol {
  2. gen `var'_rate_midpoint = (`var'_events_midpoint/`var'_ptime_midpoint)*1000
  3. gen `var'_lci_midpoint = (invpoisson(`var'_events_midpoint,.975)/`var'_ptime_midp
> oint)*1000
  4. gen `var'_uci_midpoint = (invpoisson(`var'_events_midpoint,.025)/`var'_ptime_midp
> oint)*1000
  5. }  

. keep failure *_midpoint

. order   failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates_round", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB
    and
    antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/comparator_rate
    > s_round.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates_round.csv", repla
> ce
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB an
> d antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/output/tables/comparator_rates_
> round.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safet
> y mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/preceed_rate.log
  log type:  text
 closed on:   8 Nov 2023, 20:57:09
--------------------------------------------------------------------------------------
