-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 opened on:   8 Aug 2023, 14:49:26

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for compa
> rative rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prior
. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 
(22,497 missing values generated)

. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0 
(22,519 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snomed_new=
> =0 
(22,506 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 
(22,567 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 
(22,584 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 
(22,517 missing values generated)

. gen new_pre_psoriasis_icd = pre_psoriasis_icd_prim if pre_psoriasis_snomed_ne
> w==0 
(22,588 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_snomed_n
> ew==0 
(22,559 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new==0
(22,582 missing values generated)

. gen new_pre_psa_icd = pre_psa_icd_prim if pre_psa_snomed_new==0
(22,527 missing values generated)

. gen new_pre_psa_ae = pre_psa_ae if pre_psa_snomed_new==0 
(22,514 missing values generated)

. gen new_pre_psa_snomed = pre_psa_snomed if pre_psa_snomed_new==0 
(22,545 missing values generated)

. gen new_pre_axspa_icd = pre_axspa_icd_prim if pre_axspa_ctv_new==0
(22,577 missing values generated)

. gen new_pre_axspa_ctv = pre_axspa_ctv if pre_axspa_ctv_new==0 
(22,542 missing values generated)

. gen new_pre_axspa_ae = pre_axspa_ae if pre_axspa_ctv_new==0
(22,571 missing values generated)

. gen new_pre_ibd_icd = pre_ibd_icd_prim if pre_ibd_ctv==0
(24,775 missing values generated)

. gen new_pre_ibd_ctv = pre_ibd_ctv if pre_ibd_ctv==0
(24,775 missing values generated)

. gen new_pre_ibd_ae = pre_ibd_ae if pre_ibd_ctv==0
(24,775 missing values generated)

. 
. *** combined ae from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_diverticulitis
> _snomed pre_diverticulitis_ae)      
(18100 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_icd_prim pre_diarrhoea_snomed  pre_di
> arrhoeal_icd_prim)
(18054 missing values generated)

. egen pre_taste = rmin(pre_taste_icd_prim pre_taste_snomed )
(20053 missing values generated)

. egen pre_rash = rmin(pre_rash_icd_prim pre_rash_snomed pre_rash_ae)
(18103 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_snomed  
>    pre_anaphlaxis_ae)
(18060 missing values generated)

. egen pre_severe_drug = rmin(pre_severedrug_icd_prim pre_severedrug_sjs_icd_pr
> im pre_severedrug_snomed pre_severedrug_ae)
(16250 missing values generated)

. egen pre_nonsevere_drug = rmin(pre_nonsevere_drug_snomed pre_nonsevere_drug_a
> e)
(20033 missing values generated)

. egen pre_ra = rmin(new_pre_ra_icd new_pre_ra_ae new_pre_ra_snomed )
(18619 missing values generated)

. egen pre_sle = rmin(new_pre_sle_icd new_pre_sle_ctv new_pre_sle_ae)
(18737 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_icd new_pre_psoriasis_snomed  new_
> pre_psoriasis_ae)
(18812 missing values generated)

. egen pre_psa = rmin(new_pre_psa_icd new_pre_psa_ae new_pre_psa_snomed)
(18700 missing values generated)

. egen pre_axspa = rmin(new_pre_axspa_icd  new_pre_axspa_ae pre_axspa_ctv)
(18547 missing values generated)

. egen pre_ibd = rmin(new_pre_ibd_icd new_pre_ibd_ctv new_pre_ibd_ae)
(24775 missing values generated)

. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste) 
(10691 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_rash pre_severe_drug pre_nonseve
> re_drug)
(6956 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_axspa pre_ib
> d) 
(6038 missing values generated)

. egen pre_ae_all = rmin(pre_spc_all pre_drug_all pre_imae_all)
(717 missing values generated)

. 
. global pre_ae_group                     pre_spc_all                          
>            ///
>                                                         pre_drug_all         
>                            ///             
>                                                         pre_imae_all         
>                            ///                             
>                                                         pre_ae_all

. global pre_ae_disease           pre_diverticulitis                           
>    ///
>                                                         pre_diarrhoea        
>                            ///
>                                                         pre_taste            
>                                    ///
>                                                         pre_anaphylaxis      
>                            ///
>                                                         pre_rash             
>                                    ///
>                                                         pre_severe_drug      
>                            ///
>                                                         pre_nonsevere_drug   
>                            ///
>                                                         pre_ra               
>                                    ///
>                                                         pre_sle              
>                                    ///
>                                                         pre_psorasis         
>                            ///
>                                                         pre_psa              
>                                    ///
>                                                         pre_axspa            
>                                    ///
>                                                         pre_ibd              
>    

. 
. *gen start date for comparator rate
. gen start_comparator = start_date-1460

. gen start_comparator_28 = start_date - 1431

. *remove if occurred outside of window, gen failure and stop date: 
. foreach x in $pre_ae_group $pre_ae_disease {
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparator_28) 
> & `x'!=.  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparator_28) 
> & `x'!=.  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8.                 gen stop_`x'=`x' if fail_`x'==1
  9.                 replace `x'=`x'+0.75 if `x'==start_date
 10.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
 11.                 tab drug fail_`x' if stop_`x'!=.
 12.                 format %td stop_`x'
 13. }
pre_spc_all
  14,084
  13,844
  222
(10,691 missing values generated)

             |   fail_pre_spc_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    13,603     10,297 |    23,900 
  sotrovimab |       169        139 |       308 
    paxlovid |       168        125 |       293 
molnupiravir |       144        130 |       274 
-------------+----------------------+----------
       Total |    14,084     10,691 |    24,775 
(10,691 missing values generated)
(7 real changes made)
(10,691 real changes made)

             | fail_pre_s
             |   pc_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    13,603 |    13,603 
  sotrovimab |       169 |       169 
    paxlovid |       168 |       168 
molnupiravir |       144 |       144 
-------------+-----------+----------
       Total |    14,084 |    14,084 
pre_drug_all
  17,819
  17,597
  212
(6,956 missing values generated)

             |   fail_pre_drug_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    17,192      6,708 |    23,900 
  sotrovimab |       219         89 |       308 
    paxlovid |       211         82 |       293 
molnupiravir |       197         77 |       274 
-------------+----------------------+----------
       Total |    17,819      6,956 |    24,775 
(6,956 missing values generated)
(9 real changes made)
(6,956 real changes made)

             | fail_pre_d
             |  rug_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    17,192 |    17,192 
  sotrovimab |       219 |       219 
    paxlovid |       211 |       211 
molnupiravir |       197 |       197 
-------------+-----------+----------
       Total |    17,819 |    17,819 
pre_imae_all
  18,737
  18,452
  261
(6,038 missing values generated)

             |   fail_pre_imae_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    18,052      5,848 |    23,900 
  sotrovimab |       239         69 |       308 
    paxlovid |       237         56 |       293 
molnupiravir |       209         65 |       274 
-------------+----------------------+----------
       Total |    18,737      6,038 |    24,775 
(6,038 missing values generated)
(10 real changes made)
(6,038 real changes made)

             | fail_pre_i
             |  mae_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    18,052 |    18,052 
  sotrovimab |       239 |       239 
    paxlovid |       237 |       237 
molnupiravir |       209 |       209 
-------------+-----------+----------
       Total |    18,737 |    18,737 
pre_ae_all
  24,058
  23,454
  561
(717 missing values generated)

             |    fail_pre_ae_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    23,201        699 |    23,900 
  sotrovimab |       301          7 |       308 
    paxlovid |       288          5 |       293 
molnupiravir |       268          6 |       274 
-------------+----------------------+----------
       Total |    24,058        717 |    24,775 
(717 missing values generated)
(3 real changes made)
(717 real changes made)

             | fail_pre_a
             |   e_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    23,201 |    23,201 
  sotrovimab |       301 |       301 
    paxlovid |       288 |       288 
molnupiravir |       268 |       268 
-------------+-----------+----------
       Total |    24,058 |    24,058 
pre_diverticulitis
  6,675
  6,597
  75
(18,100 missing values generated)

             | fail_pre_diverticulit
             |          is
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,437     17,463 |    23,900 
  sotrovimab |        79        229 |       308 
    paxlovid |        88        205 |       293 
molnupiravir |        71        203 |       274 
-------------+----------------------+----------
       Total |     6,675     18,100 |    24,775 
(18,100 missing values generated)
(6 real changes made)
(18,100 real changes made)

             | fail_pre_d
             | iverticuli
             |    tis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,437 |     6,437 
  sotrovimab |        79 |        79 
    paxlovid |        88 |        88 
molnupiravir |        71 |        71 
-------------+-----------+----------
       Total |     6,675 |     6,675 
pre_diarrhoea
  6,721
  6,614
  98
(18,054 missing values generated)

             |  fail_pre_diarrhoea
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,488     17,412 |    23,900 
  sotrovimab |        83        225 |       308 
    paxlovid |        82        211 |       293 
molnupiravir |        68        206 |       274 
-------------+----------------------+----------
       Total |     6,721     18,054 |    24,775 
(18,054 missing values generated)
(1 real change made)
(18,054 real changes made)

             | fail_pre_d
             |  iarrhoea
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,488 |     6,488 
  sotrovimab |        83 |        83 
    paxlovid |        82 |        82 
molnupiravir |        68 |        68 
-------------+-----------+----------
       Total |     6,721 |     6,721 
pre_taste
  4,722
  4,647
  69
(20,053 missing values generated)

             |    fail_pre_taste
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,569     19,331 |    23,900 
  sotrovimab |        55        253 |       308 
    paxlovid |        56        237 |       293 
molnupiravir |        42        232 |       274 
-------------+----------------------+----------
       Total |     4,722     20,053 |    24,775 
(20,053 missing values generated)
(1 real change made)
(20,053 real changes made)

             | fail_pre_t
             |    aste
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,569 |     4,569 
  sotrovimab |        55 |        55 
    paxlovid |        56 |        56 
molnupiravir |        42 |        42 
-------------+-----------+----------
       Total |     4,722 |     4,722 
pre_anaphylaxis
  6,715
  6,644
  67
(18,060 missing values generated)

             | fail_pre_anaphylaxis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,464     17,436 |    23,900 
  sotrovimab |        91        217 |       308 
    paxlovid |        82        211 |       293 
molnupiravir |        78        196 |       274 
-------------+----------------------+----------
       Total |     6,715     18,060 |    24,775 
(18,060 missing values generated)
(5 real changes made)
(18,060 real changes made)

             | fail_pre_a
             | naphylaxis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,464 |     6,464 
  sotrovimab |        91 |        91 
    paxlovid |        82 |        82 
molnupiravir |        78 |        78 
-------------+-----------+----------
       Total |     6,715 |     6,715 
pre_rash
  6,672
  6,613
  57
(18,103 missing values generated)

             |     fail_pre_rash
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,430     17,470 |    23,900 
  sotrovimab |        88        220 |       308 
    paxlovid |        83        210 |       293 
molnupiravir |        71        203 |       274 
-------------+----------------------+----------
       Total |     6,672     18,103 |    24,775 
(18,103 missing values generated)
(6 real changes made)
(18,103 real changes made)

             | fail_pre_r
             |    ash
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,430 |     6,430 
  sotrovimab |        88 |        88 
    paxlovid |        83 |        83 
molnupiravir |        71 |        71 
-------------+-----------+----------
       Total |     6,672 |     6,672 
pre_severe_drug
  8,525
  8,435
  88
(16,250 missing values generated)

             | fail_pre_severe_drug
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     8,239     15,661 |    23,900 
  sotrovimab |        96        212 |       308 
    paxlovid |        94        199 |       293 
molnupiravir |        96        178 |       274 
-------------+----------------------+----------
       Total |     8,525     16,250 |    24,775 
(16,250 missing values generated)
(3 real changes made)
(16,250 real changes made)

             | fail_pre_s
             | evere_drug
        drug |         1 |     Total
-------------+-----------+----------
     control |     8,239 |     8,239 
  sotrovimab |        96 |        96 
    paxlovid |        94 |        94 
molnupiravir |        96 |        96 
-------------+-----------+----------
       Total |     8,525 |     8,525 
pre_nonsevere_drug
  4,742
  4,714
  25
(20,033 missing values generated)

             | fail_pre_nonsevere_dr
             |          ug
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,580     19,320 |    23,900 
  sotrovimab |        61        247 |       308 
    paxlovid |        56        237 |       293 
molnupiravir |        45        229 |       274 
-------------+----------------------+----------
       Total |     4,742     20,033 |    24,775 
(20,033 missing values generated)
(5 real changes made)
(20,033 real changes made)

             | fail_pre_n
             | onsevere_d
             |    rug
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,580 |     4,580 
  sotrovimab |        61 |        61 
    paxlovid |        56 |        56 
molnupiravir |        45 |        45 
-------------+-----------+----------
       Total |     4,742 |     4,742 
pre_ra
  6,156
  6,093
  56
(18,619 missing values generated)

             |      fail_pre_ra
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,939     17,961 |    23,900 
  sotrovimab |        79        229 |       308 
    paxlovid |        80        213 |       293 
molnupiravir |        58        216 |       274 
-------------+----------------------+----------
       Total |     6,156     18,619 |    24,775 
(18,619 missing values generated)
(5 real changes made)
(18,619 real changes made)

             | fail_pre_r
             |     a
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,939 |     5,939 
  sotrovimab |        79 |        79 
    paxlovid |        80 |        80 
molnupiravir |        58 |        58 
-------------+-----------+----------
       Total |     6,156 |     6,156 
pre_sle
  6,038
  5,971
  61
(18,737 missing values generated)

             |     fail_pre_sle
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,813     18,087 |    23,900 
  sotrovimab |        80        228 |       308 
    paxlovid |        72        221 |       293 
molnupiravir |        73        201 |       274 
-------------+----------------------+----------
       Total |     6,038     18,737 |    24,775 
(18,737 missing values generated)
(7 real changes made)
(18,737 real changes made)

             | fail_pre_s
             |     le
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,813 |     5,813 
  sotrovimab |        80 |        80 
    paxlovid |        72 |        72 
molnupiravir |        73 |        73 
-------------+-----------+----------
       Total |     6,038 |     6,038 
pre_psorasis
  5,963
  5,888
  70
(18,812 missing values generated)

             |   fail_pre_psorasis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,748     18,152 |    23,900 
  sotrovimab |        81        227 |       308 
    paxlovid |        72        221 |       293 
molnupiravir |        62        212 |       274 
-------------+----------------------+----------
       Total |     5,963     18,812 |    24,775 
(18,812 missing values generated)
(3 real changes made)
(18,812 real changes made)

             | fail_pre_p
             |  sorasis
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,748 |     5,748 
  sotrovimab |        81 |        81 
    paxlovid |        72 |        72 
molnupiravir |        62 |        62 
-------------+-----------+----------
       Total |     5,963 |     5,963 
pre_psa
  6,075
  6,010
  58
(18,700 missing values generated)

             |     fail_pre_psa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,837     18,063 |    23,900 
  sotrovimab |        76        232 |       308 
    paxlovid |        94        199 |       293 
molnupiravir |        68        206 |       274 
-------------+----------------------+----------
       Total |     6,075     18,700 |    24,775 
(18,700 missing values generated)
(5 real changes made)
(18,700 real changes made)

             | fail_pre_p
             |     sa
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,837 |     5,837 
  sotrovimab |        76 |        76 
    paxlovid |        94 |        94 
molnupiravir |        68 |        68 
-------------+-----------+----------
       Total |     6,075 |     6,075 
pre_axspa
  6,228
  6,181
  43
(18,547 missing values generated)

             |    fail_pre_axspa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,023     17,877 |    23,900 
  sotrovimab |        71        237 |       308 
    paxlovid |        62        231 |       293 
molnupiravir |        72        202 |       274 
-------------+----------------------+----------
       Total |     6,228     18,547 |    24,775 
(18,547 missing values generated)
(8 real changes made)
(18,547 real changes made)

             | fail_pre_a
             |    xspa
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,023 |     6,023 
  sotrovimab |        71 |        71 
    paxlovid |        62 |        62 
molnupiravir |        72 |        72 
-------------+-----------+----------
       Total |     6,228 |     6,228 
pre_ibd
  0
  0
  0
(24,775 missing values generated)

             | fail_pre_i
             |     bd
        drug |         . |     Total
-------------+-----------+----------
     control |    23,900 |    23,900 
  sotrovimab |       308 |       308 
    paxlovid |       293 |       293 
molnupiravir |       274 |       274 
-------------+-----------+----------
       Total |    24,775 |    24,775 
(24,775 missing values generated)
(0 real changes made)
(24,775 real changes made)
no observations

. 
. tempname comparator

. postfile `comparator' str20(failure) ///
>         ptime_all events_all rate_all /// 
>         ptime_control events_control rate_control /// 
>         ptime_sot events_sot rate_sot ///
>         ptime_pax events_pax rate_pax ///
>         ptime_mol events_mol rate_mol ///
>         using "$projectdir/output/tables/comparator_rate_summary", replace   
>    

.                                                  
. * Failures over 1 years - convert into 28 day rate
. foreach fail in $pre_ae_group $pre_ae_disease {
  2.                                                          
.         stset stop_`fail', id(patient_id) origin(time start_comparator) enter
> (time start_comparator) failure(fail_`fail'==1)    
  3.                 stptime 
  4.                                         local rate_all = `r(rate)'
  5.                                         local ptime_all = `r(ptime)'
  6.                                         local events_all .
  7.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_all `r(failures)'
  8.                 
.                 stptime if drug == 0
  9.                                         local rate_control = `r(rate)'
 10.                                         local ptime_control = `r(ptime)'
 11.                                         local events_control .
 12.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_control `r(failures)'
 13.                 display "no drug"
 14. 
.                 stptime if drug == 1
 15.                                         local rate_sot = `r(rate)'
 16.                                         local ptime_sot = `r(ptime)'
 17.                                         local events_sot .
 18.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_sot `r(failures)'
 19.                 display "sotrovimab"
 20.                 
.                 stptime if drug == 2
 21.                                         local rate_pax = `r(rate)'
 22.                                         local ptime_pax = `r(ptime)'
 23.                                         local events_pax .
 24.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_pax `r(failures)'
 25.                 display "paxlovid"
 26.                 
.                 stptime if drug == 3
 27.                                         local rate_mol = `r(rate)'
 28.                                         local ptime_mol = `r(ptime)'
 29.                                         local events_mol .
 30.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_mol `r(failures)'
 31.                 display "molnupavir"
 32.                                                 
.                 post `comparator' ("`fail'") (`ptime_all') (`events_all') (`r
> ate_all') ///
>                                         (`ptime_control') (`events_control') 
> (`rate_control') ///
>                                         (`ptime_sot') (`events_sot') (`rate_s
> ot') ///
>                                         (`ptime_pax') (`events_pax') (`rate_p
> ax') ///
>                                         (`ptime_mol') (`events_mol') (`rate_m
> ol') 
 33.                                         
. }

                id:  patient_id
     failure event:  fail_pre_spc_all == 1
obs. time interval:  (stop_pre_spc_all[_n-1], stop_pre_spc_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
      2,340  observations end on or before enter()
------------------------------------------------------------------------------
     22,435  observations remaining, representing
     22,435  subjects
     11,744  failures in single-failure-per-subject data
   10656921  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,041

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10656921      11744   .00110201   .0010823    .0011221

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10285091      11339   .00110247   .0010824    .0011229
no drug

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       138802        150   .00108068   .0009209    .0012682
sotrovimab

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       119781        134   .00111871   .0009445    .0013251
paxlovid

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       113247        121   .00106846   .0008941    .0012769
molnupavir

                id:  patient_id
     failure event:  fail_pre_drug_all == 1
obs. time interval:  (stop_pre_drug_all[_n-1], stop_pre_drug_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
      2,624  observations end on or before enter()
------------------------------------------------------------------------------
     22,151  observations remaining, representing
     22,151  subjects
     15,195  failures in single-failure-per-subject data
   14773394  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,053

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14773394      15195   .00102854   .0010123     .001045

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14276188      14670   .00102759   .0010111    .0010443
no drug

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       177391        183   .00103162   .0008925    .0011925
sotrovimab

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       164015        168    .0010243   .0008806    .0011915
paxlovid

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       155800        174   .00111682   .0009626    .0012957
molnupavir

                id:  patient_id
     failure event:  fail_pre_imae_all == 1
obs. time interval:  (stop_pre_imae_all[_n-1], stop_pre_imae_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
      3,013  observations end on or before enter()
------------------------------------------------------------------------------
     21,762  observations remaining, representing
     21,762  subjects
     15,724  failures in single-failure-per-subject data
   14833103  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,051

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14833103      15724   .00106006   .0010436    .0010768

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14284920      15152    .0010607   .0010439    .0010777
no drug

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       183132        193   .00105388   .0009152    .0012136
sotrovimab

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       197094        202   .00102489   .0008929    .0011764
paxlovid

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       167957        177   .00105384   .0009095    .0012211
molnupavir

                id:  patient_id
     failure event:  fail_pre_ae_all == 1
obs. time interval:  (stop_pre_ae_all[_n-1], stop_pre_ae_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
      6,961  observations end on or before enter()
------------------------------------------------------------------------------
     17,814  observations remaining, representing
     17,814  subjects
     17,097  failures in single-failure-per-subject data
   11282632  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,036

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     11282632      17097   .00151534   .0014928    .0015382

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10880152      16491    .0015157   .0014927     .001539
no drug

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       140711        209   .00148531    .001297     .001701
sotrovimab

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       132735        197   .00148416   .0012907    .0017066
paxlovid

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       129034        200   .00154998   .0013494    .0017804
molnupavir

                id:  patient_id
     failure event:  fail_pre_diverticulitis == 1
obs. time interval:  (stop_pre_diverticulitis[_n-1], stop_pre_diverticulitis]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        639  observations end on or before enter()
------------------------------------------------------------------------------
     24,136  observations remaining, representing
     24,136  subjects
      6,036  failures in single-failure-per-subject data
  7,058,475  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,041

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7058475       6036   .00085514   .0008338     .000877

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6806448       5817   .00085463   .0008329    .0008769
no drug

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        84050         76   .00090422   .0007222    .0011322
sotrovimab

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        92299         78   .00084508   .0006769    .0010551
paxlovid

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        75678         65    .0008589   .0006735    .0010953
molnupavir

                id:  patient_id
     failure event:  fail_pre_diarrhoea == 1
obs. time interval:  (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
      1,110  observations end on or before enter()
------------------------------------------------------------------------------
     23,665  observations remaining, representing
     23,665  subjects
      5,611  failures in single-failure-per-subject data
  5,403,406  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,057

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5403406       5611   .00103842   .0010116    .0010659

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5221290       5419   .00103787   .0010106    .0010659
no drug

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        62084         69    .0011114   .0008778    .0014072
sotrovimab

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        63599         65   .00102203   .0008015    .0013033
paxlovid

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        56433         58   .00102777   .0007946    .0013294
molnupavir

                id:  patient_id
     failure event:  fail_pre_taste == 1
obs. time interval:  (stop_pre_taste[_n-1], stop_pre_taste]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        697  observations end on or before enter()
------------------------------------------------------------------------------
     24,078  observations remaining, representing
     24,078  subjects
      4,025  failures in single-failure-per-subject data
  4,080,687  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,039

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      4080687       4025   .00098635   .0009563    .0010173

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      3934226       3890   .00098876   .0009582    .0010203
no drug

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        59827         52   .00086917   .0006623    .0011406
sotrovimab

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        48397         48    .0009918   .0007474    .0013161
paxlovid

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        38237         35   .00091534   .0006572    .0012749
molnupavir

                id:  patient_id
     failure event:  fail_pre_anaphylaxis == 1
obs. time interval:  (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        682  observations end on or before enter()
------------------------------------------------------------------------------
     24,093  observations remaining, representing
     24,093  subjects
      6,033  failures in single-failure-per-subject data
  6,998,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,050

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6998711       6033   .00086202   .0008405     .000884

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6748092       5812   .00086128   .0008394    .0008837
no drug

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        92002         80   .00086955   .0006984    .0010826
sotrovimab

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        83947         70   .00083386   .0006597     .001054
paxlovid

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        74670         71   .00095085   .0007535    .0011999
molnupavir

                id:  patient_id
     failure event:  fail_pre_rash == 1
obs. time interval:  (stop_pre_rash[_n-1], stop_pre_rash]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        693  observations end on or before enter()
------------------------------------------------------------------------------
     24,082  observations remaining, representing
     24,082  subjects
      5,979  failures in single-failure-per-subject data
  7,040,197  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,053

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7040197       5979   .00084927    .000828    .0008711

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6785592       5761     .000849   .0008274    .0008712
no drug

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        95008         79   .00083151    .000667    .0010367
sotrovimab

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        87137         71   .00081481   .0006457    .0010282
paxlovid

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        72460         68   .00093845   .0007399    .0011902
molnupavir

                id:  patient_id
     failure event:  fail_pre_severe_drug == 1
obs. time interval:  (stop_pre_severe_drug[_n-1], stop_pre_severe_drug]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
      1,022  observations end on or before enter()
------------------------------------------------------------------------------
     23,753  observations remaining, representing
     23,753  subjects
      7,503  failures in single-failure-per-subject data
  8,031,136  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,046

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      8031136       7503   .00093424   .0009133    .0009556

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7770317       7261   .00093445   .0009132    .0009562
no drug

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        91153         79   .00086667   .0006952    .0010805
sotrovimab

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        80984         78   .00096315   .0007715    .0012025
paxlovid

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        88682         85   .00095848   .0007749    .0011855
molnupavir

                id:  patient_id
     failure event:  fail_pre_nonsevere_drug == 1
obs. time interval:  (stop_pre_nonsevere_drug[_n-1], stop_pre_nonsevere_drug]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        358  observations end on or before enter()
------------------------------------------------------------------------------
     24,417  observations remaining, representing
     24,417  subjects
      4,384  failures in single-failure-per-subject data
  5,869,298  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,052

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5869298       4384   .00074694   .0007252    .0007694

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5671048       4235   .00074678   .0007246    .0007696
no drug

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        74418         58   .00077938   .0006025    .0010081
sotrovimab

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        63735         49   .00076881   .0005811    .0010172
paxlovid

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        60097         42   .00069887   .0005165    .0009457
molnupavir

                id:  patient_id
     failure event:  fail_pre_ra == 1
obs. time interval:  (stop_pre_ra[_n-1], stop_pre_ra]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        655  observations end on or before enter()
------------------------------------------------------------------------------
     24,120  observations remaining, representing
     24,120  subjects
      5,501  failures in single-failure-per-subject data
  6,455,120  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,049

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6455120       5501   .00085219     .00083     .000875

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6232721       5308   .00085163    .000829    .0008749
no drug

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        72345         67   .00092612   .0007289    .0011767
sotrovimab

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        87949         74    .0008414     .00067    .0010567
paxlovid

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        62105         52   .00083729    .000638    .0010988
molnupavir

                id:  patient_id
     failure event:  fail_pre_sle == 1
obs. time interval:  (stop_pre_sle[_n-1], stop_pre_sle]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        648  observations end on or before enter()
------------------------------------------------------------------------------
     24,127  observations remaining, representing
     24,127  subjects
      5,390  failures in single-failure-per-subject data
  6,400,872  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,057

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6400872       5390   .00084207   .0008199    .0008649

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6167998       5192   .00084176   .0008192     .000865
no drug

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        76318         69   .00090411   .0007141    .0011447
sotrovimab

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        82899         65   .00078409   .0006149    .0009999
paxlovid

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        73657         64   .00086889   .0006801    .0011101
molnupavir

                id:  patient_id
     failure event:  fail_pre_psorasis == 1
obs. time interval:  (stop_pre_psorasis[_n-1], stop_pre_psorasis]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        618  observations end on or before enter()
------------------------------------------------------------------------------
     24,157  observations remaining, representing
     24,157  subjects
      5,345  failures in single-failure-per-subject data
  6,328,140  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,057

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6328140       5345   .00084464   .0008223    .0008676

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6107195       5152    .0008436   .0008209    .0008669
no drug

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        83092         73   .00087854   .0006985    .0011051
sotrovimab

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        75261         62    .0008238   .0006423    .0010566
paxlovid

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        62592         58   .00092664   .0007164    .0011986
molnupavir

                id:  patient_id
     failure event:  fail_pre_psa == 1
obs. time interval:  (stop_pre_psa[_n-1], stop_pre_psa]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        663  observations end on or before enter()
------------------------------------------------------------------------------
     24,112  observations remaining, representing
     24,112  subjects
      5,412  failures in single-failure-per-subject data
  6,392,383  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,053

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6392383       5412   .00084663   .0008244    .0008695

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6152020       5204    .0008459   .0008232    .0008692
no drug

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        82843         66   .00079669   .0006259    .0010141
sotrovimab

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        91096         81   .00088917   .0007152    .0011055
paxlovid

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        66424         61   .00091834   .0007145    .0011803
molnupavir

                id:  patient_id
     failure event:  fail_pre_axspa == 1
obs. time interval:  (stop_pre_axspa[_n-1], stop_pre_axspa]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
        656  observations end on or before enter()
------------------------------------------------------------------------------
     24,119  observations remaining, representing
     24,119  subjects
      5,572  failures in single-failure-per-subject data
  6,553,133  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,044

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6553133       5572   .00085028   .0008282    .0008729

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6329800       5388   .00085121   .0008288    .0008742
no drug

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        79258         61   .00076964   .0005988    .0009892
sotrovimab

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        66416         57   .00085823    .000662    .0011126
paxlovid

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        77659         66   .00084987   .0006677    .0010818
molnupavir

                id:  patient_id
     failure event:  fail_pre_ibd == 1
obs. time interval:  (stop_pre_ibd[_n-1], stop_pre_ibd]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,775  total observations
          0  exclusions
------------------------------------------------------------------------------
     24,775  observations remaining, representing
     24,775  subjects
          0  failures in single-failure-per-subject data
    718,475  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       718475          0           0          .           .

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       693100          0           0          .           .
no drug

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |         8932          0           0          .           .
sotrovimab

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |         8497          0           0          .           .
paxlovid

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |         7946          0           0          .           .
molnupavir

. 
. postclose `comparator'

. use "$projectdir/output/tables/comparator_rate_summary", replace

. export delimited using "$projectdir/output/tables/comparator_rate_summary_csv
> .csv", replace
(note: file /workspace/output/tables/comparator_rate_summary_csv.csv not found)
file /workspace/output/tables/comparator_rate_summary_csv.csv saved

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 closed on:   8 Aug 2023, 14:49:47
-------------------------------------------------------------------------------
