-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 opened on:   1 Nov 2023, 14:04:15

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for compa
> rative rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prior
. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 
(51,826 missing values generated)

. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0 
(51,844 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snomed_new=
> =0 
(51,792 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 
(51,790 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 
(51,862 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 
(51,796 missing values generated)

. gen new_pre_psoriasis_icd = pre_psoriasis_icd_prim if pre_psoriasis_snomed_ne
> w==0 
(51,774 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_snomed_n
> ew==0 
(51,744 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new==0
(51,723 missing values generated)

. gen new_pre_psa_icd = pre_psa_icd_prim if pre_psa_snomed_new==0
(51,795 missing values generated)

. gen new_pre_psa_ae = pre_psa_ae if pre_psa_snomed_new==0 
(51,860 missing values generated)

. gen new_pre_psa_snomed = pre_psa_snomed if pre_psa_snomed_new==0 
(51,735 missing values generated)

. gen new_pre_axspa_icd = pre_axspa_icd_prim if pre_axspa_ctv_new==0
(51,808 missing values generated)

. gen new_pre_axspa_ctv = pre_axspa_ctv if pre_axspa_ctv_new==0 
(51,791 missing values generated)

. gen new_pre_axspa_ae = pre_axspa_ae if pre_axspa_ctv_new==0
(51,829 missing values generated)

. gen new_pre_ibd_icd = pre_ibd_icd_prim if pre_ibd_ctv_new==0
(51,823 missing values generated)

. gen new_pre_ibd_ctv = pre_ibd_ctv if pre_ibd_ctv_new==0
(51,806 missing values generated)

. gen new_pre_ibd_ae = pre_ibd_ae if pre_ibd_ctv_new==0
(51,826 missing values generated)

. 
. *** combined all AEs from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_diverticulitis
> _snomed pre_diverticulitis_ae)      
(41543 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_icd_prim pre_diarrhoea_snomed  pre_di
> arrhoeal_icd_prim)
(41513 missing values generated)

. egen pre_taste = rmin(pre_taste_icd_prim pre_taste_snomed )
(46147 missing values generated)

. egen pre_rash = rmin(pre_rash_icd_prim pre_rash_snomed pre_rash_ae)
(41464 missing values generated)

. egen pre_bronchospasm = rmin(pre_bronchospasm_snomed)
(51227 missing values generated)

. egen pre_contactderm = rmin(pre_contactderm_snomed pre_contactderm_icd_prim p
> re_contactderm_ae)
(41458 missing values generated)

. egen pre_dizziness = rmin(pre_dizziness_snomed pre_dizziness_ae pre_dizziness
> _icd_prim)
(41617 missing values generated)

. egen pre_nausea_vomit = rmin(pre_nausea_vomit_snomed pre_nausea_vomit_icd_pri
> m)
(46022 missing values generated)

. egen pre_headache = rmin(pre_headache_snomed pre_headache_ae pre_headache_icd
> _prim)
(41577 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_snomed  
>    pre_anaphlaxis_ae)
(41426 missing values generated)

. egen pre_drugreaction = rmin(pre_severedrug_icd_prim pre_severedrug_sjs_icd_p
> rim pre_severedrug_snomed pre_severedrug_ae pre_nonsevere_drug_snomed pre_non
> severe_drug_ae)
(30421 missing values generated)

. egen pre_ra = rmin(new_pre_ra_icd new_pre_ra_ae new_pre_ra_snomed )
(43071 missing values generated)

. egen pre_sle = rmin(new_pre_sle_icd new_pre_sle_ctv new_pre_sle_ae)
(43112 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_icd new_pre_psoriasis_snomed  new_
> pre_psoriasis_ae)
(42886 missing values generated)

. egen pre_psa = rmin(new_pre_psa_icd new_pre_psa_ae new_pre_psa_snomed)
(42982 missing values generated)

. egen pre_axspa = rmin(new_pre_axspa_icd  new_pre_axspa_ae new_pre_axspa_ctv)
(43124 missing values generated)

. egen pre_ibd = rmin(new_pre_ibd_icd new_pre_ibd_ctv new_pre_ibd_ae)
(43064 missing values generated)

. 
. *** combined serious AEs from hosp and A&E
. egen pre_diverticulitis_serious = rmin(pre_diverticulitis_icd_prim)      
(51242 missing values generated)

. egen pre_diarrhoea_serious = rmin(pre_diarrhoea_icd_prim pre_diarrhoeal_icd_p
> rim)
(46166 missing values generated)

. egen pre_taste_serious = rmin(pre_taste_icd_prim)
(51160 missing values generated)

. egen pre_rash_serious = rmin(pre_rash_icd_prim)
(51194 missing values generated)

. egen pre_contactderm_serious = rmin(pre_contactderm_snomed pre_contactderm_ic
> d_prim pre_contactderm_ae)
(41458 missing values generated)

. egen pre_dizziness_serious = rmin(pre_dizziness_icd_prim)
(51280 missing values generated)

. egen pre_nausea_vomit_serious = rmin(pre_nausea_vomit_icd_prim)
(51202 missing values generated)

. egen pre_headache_serious = rmin(pre_headache_icd_prim)
(51275 missing values generated)

. egen pre_anaphylaxis_serious = rmin(pre_anaphylaxis_icd_prim)
(51163 missing values generated)

. egen pre_drugreaction_serious = rmin(pre_severedrug_icd_prim pre_severedrug_s
> js_icd_prim)
(46251 missing values generated)

. egen pre_ra_serious = rmin(new_pre_ra_icd)
(51826 missing values generated)

. egen pre_sle_serious = rmin(new_pre_sle_icd)
(51862 missing values generated)

. egen pre_psorasis_serious = rmin(new_pre_psoriasis_icd)
(51774 missing values generated)

. egen pre_psa_serious = rmin(new_pre_psa_icd)
(51795 missing values generated)

. egen pre_axspa_serious = rmin(new_pre_axspa_icd)
(51808 missing values generated)

. egen pre_ibd_serious = rmin(new_pre_ibd_icd)
(51823 missing values generated)

. 
. *** combined AEs by spc, drug and imae                          
. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste pre_rash p
> re_contactderm pre_bronchospasm pre_dizziness pre_nausea_vomit pre_headache p
> re_anaphylaxis pre_drugreaction)
(1960 missing values generated)

. egen pre_spc_serious = rmin(pre_diverticulitis_serious pre_diarrhoea_serious 
> pre_taste_serious pre_rash_serious pre_contactderm_serious pre_dizziness_seri
> ous pre_nausea_vomit_serious pre_headache_serious)
(17862 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_drugreaction)
(22163 missing values generated)

. egen pre_drug_serious = rmin(pre_anaphylaxis_serious pre_drugreaction_serious
> )
(41556 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_ibd pre_axsp
> a)
(10655 missing values generated)

. egen pre_imae_serious = rmin(pre_ra_serious pre_sle_serious pre_psorasis_seri
> ous pre_psa_serious pre_axspa_serious pre_ibd_serious)
(32367 missing values generated)

. egen pre_all = rmin(ae_spc_all ae_drug_all ae_imae_all )

. egen pre_all_serious = rmin(ae_spc_serious ae_drug_serious ae_imae_serious)
(16 missing values generated)

. 
. global pre_ae_disease                   pre_diverticulitis                   
>            ///
>                                                                 pre_diarrhoea
>                                    ///
>                                                                 pre_taste    
>                                            ///
>                                                                 pre_rash     
>                                            ///
>                                                                 pre_bronchosp
> asm                                ///
>                                                                 pre_contactde
> rm                                 ///
>                                                                 pre_dizziness
>                                    ///
>                                                                 pre_nausea_vo
> mit                                ///
>                                                                 pre_headache 
>                                    ///
>                                                                 pre_anaphylax
> is                                 ///
>                                                                 pre_drugreact
> ion                                ///
>                                                                 pre_ra       
>                                            ///
>                                                                 pre_sle      
>                                            ///
>                                                                 pre_psorasis 
>                                    ///
>                                                                 pre_psa      
>                                            ///
>                                                                 pre_axspa    
>                                            ///
>                                                                 pre_ibd 

. global pre_ae_disease_serious   pre_diverticulitis_serious              ///
>                                                                 pre_diarrhoea
> _serious                   ///
>                                                                 pre_taste_ser
> ious                               ///
>                                                                 pre_rash_seri
> ous                                ///
>                                                                 pre_contactde
> rm_serious                 ///
>                                                                 pre_dizziness
> _serious                   ///
>                                                                 pre_nausea_vo
> mit_serious                ///
>                                                                 pre_headache_
> serious                    ///
>                                                                 pre_anaphylax
> is_serious                 ///
>                                                                 pre_drugreact
> ion_serious                ///
>                                                                 pre_ra_seriou
> s                                  ///
>                                                                 pre_sle_serio
> us                                 ///
>                                                                 pre_psorasis_
> serious                    ///
>                                                                 pre_psa_serio
> us                                 ///
>                                                                 pre_axspa_ser
> ious                               ///
>                                                                 pre_ibd_serio
> us                                                         

. global pre_ae_combined                  pre_all                              
>                    ///
>                                                                 pre_all_serio
> us                                 ///
>                                                                 pre_spc_all  
>                                    ///
>                                                                 pre_spc_serio
> us                                 ///
>                                                                 pre_drug_all 
>                                    ///
>                                                                 pre_drug_seri
> ous                                ///
>                                                                 pre_imae_all 
>                                    ///     
>                                                                 pre_imae_seri
> ous                                                        

. 
. ********************************************************
. *       A. START DATE           *
. ********************************************************
. gen start_comparator = start_date-1460
(5,700 missing values generated)

. gen start_comparator_28 = start_date - 1431
(5,700 missing values generated)

. 
. ********************************************************
. *       A. COX MODEL            *
. ********************************************************
. * Generate failure 
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparator_28) 
> & `x'!=.  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparator_28) 
> & `x'!=.  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8. }
pre_diverticulitis
  15,384
  15,231
  146
(41,543 missing values generated)

                      | fail_pre_diverticulit
                      |          is
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,040     19,278 |    26,318 
           sotrovimab |     2,695      7,421 |    10,116 
             paxlovid |     2,825      7,411 |    10,236 
         molnupiravir |     2,824      7,433 |    10,257 
----------------------+----------------------+----------
                Total |    15,384     41,543 |    56,927 
pre_diarrhoea
  15,414
  15,205
  197
(41,513 missing values generated)

                      |  fail_pre_diarrhoea
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,183     19,135 |    26,318 
           sotrovimab |     2,705      7,411 |    10,116 
             paxlovid |     2,763      7,473 |    10,236 
         molnupiravir |     2,763      7,494 |    10,257 
----------------------+----------------------+----------
                Total |    15,414     41,513 |    56,927 
pre_taste
  10,780
  10,645
  120
(46,147 missing values generated)

                      |    fail_pre_taste
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     4,996     21,322 |    26,318 
           sotrovimab |     1,928      8,188 |    10,116 
             paxlovid |     1,928      8,308 |    10,236 
         molnupiravir |     1,928      8,329 |    10,257 
----------------------+----------------------+----------
                Total |    10,780     46,147 |    56,927 
pre_rash
  15,463
  15,334
  121
(41,464 missing values generated)

                      |     fail_pre_rash
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,118     19,200 |    26,318 
           sotrovimab |     2,745      7,371 |    10,116 
             paxlovid |     2,798      7,438 |    10,236 
         molnupiravir |     2,802      7,455 |    10,257 
----------------------+----------------------+----------
                Total |    15,463     41,464 |    56,927 
pre_bronchospasm
  5,700
  5,618
  78
(51,227 missing values generated)

                      | fail_pre_bronchospasm
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,597     23,721 |    26,318 
           sotrovimab |     1,049      9,067 |    10,116 
             paxlovid |     1,040      9,196 |    10,236 
         molnupiravir |     1,014      9,243 |    10,257 
----------------------+----------------------+----------
                Total |     5,700     51,227 |    56,927 
pre_contactderm
  15,469
  15,319
  145
(41,458 missing values generated)

                      | fail_pre_contactderm
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,173     19,145 |    26,318 
           sotrovimab |     2,792      7,324 |    10,116 
             paxlovid |     2,785      7,451 |    10,236 
         molnupiravir |     2,719      7,538 |    10,257 
----------------------+----------------------+----------
                Total |    15,469     41,458 |    56,927 
pre_dizziness
  15,310
  15,192
  106
(41,617 missing values generated)

                      |  fail_pre_dizziness
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,055     19,263 |    26,318 
           sotrovimab |     2,721      7,395 |    10,116 
             paxlovid |     2,744      7,492 |    10,236 
         molnupiravir |     2,790      7,467 |    10,257 
----------------------+----------------------+----------
                Total |    15,310     41,617 |    56,927 
pre_nausea_vomit
  10,905
  10,757
  134
(46,022 missing values generated)

                      | fail_pre_nausea_vomit
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     5,054     21,264 |    26,318 
           sotrovimab |     1,924      8,192 |    10,116 
             paxlovid |     1,966      8,270 |    10,236 
         molnupiravir |     1,961      8,296 |    10,257 
----------------------+----------------------+----------
                Total |    10,905     46,022 |    56,927 
pre_headache
  15,350
  15,207
  132
(41,577 missing values generated)

                      |   fail_pre_headache
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,083     19,235 |    26,318 
           sotrovimab |     2,697      7,419 |    10,116 
             paxlovid |     2,792      7,444 |    10,236 
         molnupiravir |     2,778      7,479 |    10,257 
----------------------+----------------------+----------
                Total |    15,350     41,577 |    56,927 
pre_anaphylaxis
  15,501
  15,342
  147
(41,426 missing values generated)

                      | fail_pre_anaphylaxis
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,069     19,249 |    26,318 
           sotrovimab |     2,757      7,359 |    10,116 
             paxlovid |     2,828      7,408 |    10,236 
         molnupiravir |     2,847      7,410 |    10,257 
----------------------+----------------------+----------
                Total |    15,501     41,426 |    56,927 
pre_drugreaction
  26,506
  26,231
  262
(30,421 missing values generated)

                      | fail_pre_drugreaction
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    12,235     14,083 |    26,318 
           sotrovimab |     4,667      5,449 |    10,116 
             paxlovid |     4,809      5,427 |    10,236 
         molnupiravir |     4,795      5,462 |    10,257 
----------------------+----------------------+----------
                Total |    26,506     30,421 |    56,927 
pre_ra
  13,856
  13,715
  131
(43,071 missing values generated)

                      |      fail_pre_ra
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,381     19,937 |    26,318 
           sotrovimab |     2,502      7,614 |    10,116 
             paxlovid |     2,477      7,759 |    10,236 
         molnupiravir |     2,496      7,761 |    10,257 
----------------------+----------------------+----------
                Total |    13,856     43,071 |    56,927 
pre_sle
  13,815
  13,668
  141
(43,112 missing values generated)

                      |     fail_pre_sle
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,311     20,007 |    26,318 
           sotrovimab |     2,487      7,629 |    10,116 
             paxlovid |     2,532      7,704 |    10,236 
         molnupiravir |     2,485      7,772 |    10,257 
----------------------+----------------------+----------
                Total |    13,815     43,112 |    56,927 
pre_psorasis
  14,041
  13,922
  109
(42,886 missing values generated)

                      |   fail_pre_psorasis
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,492     19,826 |    26,318 
           sotrovimab |     2,493      7,623 |    10,116 
             paxlovid |     2,492      7,744 |    10,236 
         molnupiravir |     2,564      7,693 |    10,257 
----------------------+----------------------+----------
                Total |    14,041     42,886 |    56,927 
pre_psa
  13,945
  13,807
  131
(42,982 missing values generated)

                      |     fail_pre_psa
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,450     19,868 |    26,318 
           sotrovimab |     2,527      7,589 |    10,116 
             paxlovid |     2,465      7,771 |    10,236 
         molnupiravir |     2,503      7,754 |    10,257 
----------------------+----------------------+----------
                Total |    13,945     42,982 |    56,927 
pre_axspa
  13,803
  13,682
  110
(43,124 missing values generated)

                      |    fail_pre_axspa
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,326     19,992 |    26,318 
           sotrovimab |     2,428      7,688 |    10,116 
             paxlovid |     2,542      7,694 |    10,236 
         molnupiravir |     2,507      7,750 |    10,257 
----------------------+----------------------+----------
                Total |    13,803     43,124 |    56,927 
pre_ibd
  13,863
  13,720
  131
(43,064 missing values generated)

                      |     fail_pre_ibd
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     6,344     19,974 |    26,318 
           sotrovimab |     2,442      7,674 |    10,116 
             paxlovid |     2,571      7,665 |    10,236 
         molnupiravir |     2,506      7,751 |    10,257 
----------------------+----------------------+----------
                Total |    13,863     43,064 |    56,927 
pre_diverticulitis_serious
  5,685
  5,606
  76
(51,242 missing values generated)

                      | fail_pre_diverticulit
                      |      is_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,608     23,710 |    26,318 
           sotrovimab |     1,016      9,100 |    10,116 
             paxlovid |     1,018      9,218 |    10,236 
         molnupiravir |     1,043      9,214 |    10,257 
----------------------+----------------------+----------
                Total |     5,685     51,242 |    56,927 
pre_diarrhoea_serious
  10,761
  10,622
  134
(46,166 missing values generated)

                      | fail_pre_diarrhoea_se
                      |         rious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     4,987     21,331 |    26,318 
           sotrovimab |     1,874      8,242 |    10,116 
             paxlovid |     1,971      8,265 |    10,236 
         molnupiravir |     1,929      8,328 |    10,257 
----------------------+----------------------+----------
                Total |    10,761     46,166 |    56,927 
pre_taste_serious
  5,767
  5,696
  64
(51,160 missing values generated)

                      | fail_pre_taste_seriou
                      |           s
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,674     23,644 |    26,318 
           sotrovimab |     1,029      9,087 |    10,116 
             paxlovid |     1,037      9,199 |    10,236 
         molnupiravir |     1,027      9,230 |    10,257 
----------------------+----------------------+----------
                Total |     5,767     51,160 |    56,927 
pre_rash_serious
  5,733
  5,666
  64
(51,194 missing values generated)

                      | fail_pre_rash_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,645     23,673 |    26,318 
           sotrovimab |     1,008      9,108 |    10,116 
             paxlovid |     1,030      9,206 |    10,236 
         molnupiravir |     1,050      9,207 |    10,257 
----------------------+----------------------+----------
                Total |     5,733     51,194 |    56,927 
pre_contactderm_serious
  15,469
  15,319
  145
(41,458 missing values generated)

                      | fail_pre_contactderm_
                      |        serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,173     19,145 |    26,318 
           sotrovimab |     2,792      7,324 |    10,116 
             paxlovid |     2,785      7,451 |    10,236 
         molnupiravir |     2,719      7,538 |    10,257 
----------------------+----------------------+----------
                Total |    15,469     41,458 |    56,927 
pre_dizziness_serious
  5,647
  5,584
  57
(51,280 missing values generated)

                      | fail_pre_dizziness_se
                      |         rious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,593     23,725 |    26,318 
           sotrovimab |     1,000      9,116 |    10,116 
             paxlovid |       987      9,249 |    10,236 
         molnupiravir |     1,067      9,190 |    10,257 
----------------------+----------------------+----------
                Total |     5,647     51,280 |    56,927 
pre_nausea_vomit_serious
  5,725
  5,659
  61
(51,202 missing values generated)

                      | fail_pre_nausea_vomit
                      |       _serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,651     23,667 |    26,318 
           sotrovimab |     1,062      9,054 |    10,116 
             paxlovid |       999      9,237 |    10,236 
         molnupiravir |     1,013      9,244 |    10,257 
----------------------+----------------------+----------
                Total |     5,725     51,202 |    56,927 
pre_headache_serious
  5,652
  5,573
  74
(51,275 missing values generated)

                      | fail_pre_headache_ser
                      |         ious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,621     23,697 |    26,318 
           sotrovimab |       999      9,117 |    10,116 
             paxlovid |     1,020      9,216 |    10,236 
         molnupiravir |     1,012      9,245 |    10,257 
----------------------+----------------------+----------
                Total |     5,652     51,275 |    56,927 
pre_anaphylaxis_serious
  5,764
  5,689
  70
(51,163 missing values generated)

                      | fail_pre_anaphylaxis_
                      |        serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,615     23,703 |    26,318 
           sotrovimab |     1,028      9,088 |    10,116 
             paxlovid |     1,078      9,158 |    10,236 
         molnupiravir |     1,043      9,214 |    10,257 
----------------------+----------------------+----------
                Total |     5,764     51,163 |    56,927 
pre_drugreaction_serious
  10,676
  10,525
  145
(46,251 missing values generated)

                      | fail_pre_drugreaction
                      |       _serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     4,903     21,415 |    26,318 
           sotrovimab |     1,924      8,192 |    10,116 
             paxlovid |     1,905      8,331 |    10,236 
         molnupiravir |     1,944      8,313 |    10,257 
----------------------+----------------------+----------
                Total |    10,676     46,251 |    56,927 
pre_ra_serious
  5,101
  5,029
  66
(51,826 missing values generated)

                      |  fail_pre_ra_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,365     23,953 |    26,318 
           sotrovimab |       905      9,211 |    10,116 
             paxlovid |       923      9,313 |    10,236 
         molnupiravir |       908      9,349 |    10,257 
----------------------+----------------------+----------
                Total |     5,101     51,826 |    56,927 
pre_sle_serious
  5,065
  4,978
  84
(51,862 missing values generated)

                      | fail_pre_sle_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,300     24,018 |    26,318 
           sotrovimab |       899      9,217 |    10,116 
             paxlovid |       969      9,267 |    10,236 
         molnupiravir |       897      9,360 |    10,257 
----------------------+----------------------+----------
                Total |     5,065     51,862 |    56,927 
pre_psorasis_serious
  5,153
  5,088
  61
(51,774 missing values generated)

                      | fail_pre_psorasis_ser
                      |         ious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,383     23,935 |    26,318 
           sotrovimab |       901      9,215 |    10,116 
             paxlovid |       934      9,302 |    10,236 
         molnupiravir |       935      9,322 |    10,257 
----------------------+----------------------+----------
                Total |     5,153     51,774 |    56,927 
pre_psa_serious
  5,132
  5,074
  57
(51,795 missing values generated)

                      | fail_pre_psa_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,392     23,926 |    26,318 
           sotrovimab |       935      9,181 |    10,116 
             paxlovid |       908      9,328 |    10,236 
         molnupiravir |       897      9,360 |    10,257 
----------------------+----------------------+----------
                Total |     5,132     51,795 |    56,927 
pre_axspa_serious
  5,119
  5,064
  51
(51,808 missing values generated)

                      | fail_pre_axspa_seriou
                      |           s
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,335     23,983 |    26,318 
           sotrovimab |       902      9,214 |    10,116 
             paxlovid |       963      9,273 |    10,236 
         molnupiravir |       919      9,338 |    10,257 
----------------------+----------------------+----------
                Total |     5,119     51,808 |    56,927 
pre_ibd_serious
  5,104
  5,036
  62
(51,823 missing values generated)

                      | fail_pre_ibd_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     2,356     23,962 |    26,318 
           sotrovimab |       896      9,220 |    10,116 
             paxlovid |       927      9,309 |    10,236 
         molnupiravir |       925      9,332 |    10,257 
----------------------+----------------------+----------
                Total |     5,104     51,823 |    56,927 
pre_all
  56,927
  56,927
  0

                      | fail_pre_a
                      |     ll
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,318 |    26,318 
           sotrovimab |    10,116 |    10,116 
             paxlovid |    10,236 |    10,236 
         molnupiravir |    10,257 |    10,257 
----------------------+-----------+----------
                Total |    56,927 |    56,927 
pre_all_serious
  56,911
  56,911
  0
(16 missing values generated)

                      | fail_pre_all_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    26,306         12 |    26,318 
           sotrovimab |    10,114          2 |    10,116 
             paxlovid |    10,235          1 |    10,236 
         molnupiravir |    10,256          1 |    10,257 
----------------------+----------------------+----------
                Total |    56,911         16 |    56,927 
pre_spc_all
  54,967
  53,773
  1,114
(1,960 missing values generated)

                      |   fail_pre_spc_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    25,413        905 |    26,318 
           sotrovimab |     9,764        352 |    10,116 
             paxlovid |     9,879        357 |    10,236 
         molnupiravir |     9,911        346 |    10,257 
----------------------+----------------------+----------
                Total |    54,967      1,960 |    56,927 
pre_spc_serious
  39,065
  38,440
  588
(17,862 missing values generated)

                      | fail_pre_spc_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    18,094      8,224 |    26,318 
           sotrovimab |     6,915      3,201 |    10,116 
             paxlovid |     7,026      3,210 |    10,236 
         molnupiravir |     7,030      3,227 |    10,257 
----------------------+----------------------+----------
                Total |    39,065     17,862 |    56,927 
pre_drug_all
  34,764
  34,347
  393
(22,163 missing values generated)

                      |   fail_pre_drug_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    16,001     10,317 |    26,318 
           sotrovimab |     6,147      3,969 |    10,116 
             paxlovid |     6,310      3,926 |    10,236 
         molnupiravir |     6,306      3,951 |    10,257 
----------------------+----------------------+----------
                Total |    34,764     22,163 |    56,927 
pre_drug_serious
  15,371
  15,149
  211
(41,556 missing values generated)

                      | fail_pre_drug_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |     7,051     19,267 |    26,318 
           sotrovimab |     2,742      7,374 |    10,116 
             paxlovid |     2,777      7,459 |    10,236 
         molnupiravir |     2,801      7,456 |    10,257 
----------------------+----------------------+----------
                Total |    15,371     41,556 |    56,927 
pre_imae_all
  46,272
  45,577
  645
(10,655 missing values generated)

                      |   fail_pre_imae_all
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    21,349      4,969 |    26,318 
           sotrovimab |     8,271      1,845 |    10,116 
             paxlovid |     8,351      1,885 |    10,236 
         molnupiravir |     8,301      1,956 |    10,257 
----------------------+----------------------+----------
                Total |    46,272     10,655 |    56,927 
pre_imae_serious
  24,560
  24,179
  359
(32,367 missing values generated)

                      | fail_pre_imae_serious
                 drug |         1          . |     Total
----------------------+----------------------+----------
              control |    11,319     14,999 |    26,318 
           sotrovimab |     4,374      5,742 |    10,116 
             paxlovid |     4,491      5,745 |    10,236 
         molnupiravir |     4,376      5,881 |    10,257 
----------------------+----------------------+----------
                Total |    24,560     32,367 |    56,927 

. 
. * Add half-day buffer if outcome on indexdate
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 display "`x'"
  3.                 replace `x'=`x'+0.75 if `x'==start_comparator
  4. }
pre_diverticulitis
(5 real changes made)
pre_diarrhoea
(6 real changes made)
pre_taste
(10 real changes made)
pre_rash
(3 real changes made)
pre_bronchospasm
(0 real changes made)
pre_contactderm
(2 real changes made)
pre_dizziness
(8 real changes made)
pre_nausea_vomit
(5 real changes made)
pre_headache
(1 real change made)
pre_anaphylaxis
(5 real changes made)
pre_drugreaction
(9 real changes made)
pre_ra
(4 real changes made)
pre_sle
(2 real changes made)
pre_psorasis
(5 real changes made)
pre_psa
(2 real changes made)
pre_axspa
(7 real changes made)
pre_ibd
(5 real changes made)
pre_diverticulitis_serious
(2 real changes made)
pre_diarrhoea_serious
(2 real changes made)
pre_taste_serious
(4 real changes made)
pre_rash_serious
(1 real change made)
pre_contactderm_serious
(2 real changes made)
pre_dizziness_serious
(5 real changes made)
pre_nausea_vomit_serious
(2 real changes made)
pre_headache_serious
(1 real change made)
pre_anaphylaxis_serious
(2 real changes made)
pre_drugreaction_serious
(4 real changes made)
pre_ra_serious
(3 real changes made)
pre_sle_serious
(1 real change made)
pre_psorasis_serious
(2 real changes made)
pre_psa_serious
(1 real change made)
pre_axspa_serious
(3 real changes made)
pre_ibd_serious
(2 real changes made)
pre_all
(0 real changes made)
pre_all_serious
(0 real changes made)
pre_spc_all
(40 real changes made)
pre_spc_serious
(19 real changes made)
pre_drug_all
(14 real changes made)
pre_drug_serious
(6 real changes made)
pre_imae_all
(24 real changes made)
pre_imae_serious
(11 real changes made)

. 
. *Generate censor date
. foreach x in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.                 gen stop_`x'=`x' if fail_`x'==1
  3.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
  4.                 tab drug fail_`x' if stop_`x'!=.
  5.                 format %td stop_`x'
  6. }
(41,543 missing values generated)
(37,362 real changes made)

                      | fail_pre_d
                      | iverticuli
                      |    tis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,040 |     7,040 
           sotrovimab |     2,695 |     2,695 
             paxlovid |     2,825 |     2,825 
         molnupiravir |     2,824 |     2,824 
----------------------+-----------+----------
                Total |    15,384 |    15,384 
(41,513 missing values generated)
(37,376 real changes made)

                      | fail_pre_d
                      |  iarrhoea
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,183 |     7,183 
           sotrovimab |     2,705 |     2,705 
             paxlovid |     2,763 |     2,763 
         molnupiravir |     2,763 |     2,763 
----------------------+-----------+----------
                Total |    15,414 |    15,414 
(46,147 missing values generated)
(41,507 real changes made)

                      | fail_pre_t
                      |    aste
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     4,996 |     4,996 
           sotrovimab |     1,928 |     1,928 
             paxlovid |     1,928 |     1,928 
         molnupiravir |     1,928 |     1,928 
----------------------+-----------+----------
                Total |    10,780 |    10,780 
(41,464 missing values generated)
(37,293 real changes made)

                      | fail_pre_r
                      |    ash
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,118 |     7,118 
           sotrovimab |     2,745 |     2,745 
             paxlovid |     2,798 |     2,798 
         molnupiravir |     2,802 |     2,802 
----------------------+-----------+----------
                Total |    15,463 |    15,463 
(51,227 missing values generated)
(46,102 real changes made)

                      | fail_pre_b
                      | ronchospas
                      |     m
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,597 |     2,597 
           sotrovimab |     1,049 |     1,049 
             paxlovid |     1,040 |     1,040 
         molnupiravir |     1,014 |     1,014 
----------------------+-----------+----------
                Total |     5,700 |     5,700 
(41,458 missing values generated)
(37,332 real changes made)

                      | fail_pre_c
                      | ontactderm
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,173 |     7,173 
           sotrovimab |     2,792 |     2,792 
             paxlovid |     2,785 |     2,785 
         molnupiravir |     2,719 |     2,719 
----------------------+-----------+----------
                Total |    15,469 |    15,469 
(41,617 missing values generated)
(37,448 real changes made)

                      | fail_pre_d
                      |  izziness
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,055 |     7,055 
           sotrovimab |     2,721 |     2,721 
             paxlovid |     2,744 |     2,744 
         molnupiravir |     2,790 |     2,790 
----------------------+-----------+----------
                Total |    15,310 |    15,310 
(46,022 missing values generated)
(41,418 real changes made)

                      | fail_pre_n
                      | ausea_vomi
                      |     t
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     5,054 |     5,054 
           sotrovimab |     1,924 |     1,924 
             paxlovid |     1,966 |     1,966 
         molnupiravir |     1,961 |     1,961 
----------------------+-----------+----------
                Total |    10,905 |    10,905 
(41,577 missing values generated)
(37,452 real changes made)

                      | fail_pre_h
                      |  eadache
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,083 |     7,083 
           sotrovimab |     2,697 |     2,697 
             paxlovid |     2,792 |     2,792 
         molnupiravir |     2,778 |     2,778 
----------------------+-----------+----------
                Total |    15,350 |    15,350 
(41,426 missing values generated)
(37,246 real changes made)

                      | fail_pre_a
                      | naphylaxis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,069 |     7,069 
           sotrovimab |     2,757 |     2,757 
             paxlovid |     2,828 |     2,828 
         molnupiravir |     2,847 |     2,847 
----------------------+-----------+----------
                Total |    15,501 |    15,501 
(30,421 missing values generated)
(27,375 real changes made)

                      | fail_pre_d
                      | rugreactio
                      |     n
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    12,235 |    12,235 
           sotrovimab |     4,667 |     4,667 
             paxlovid |     4,809 |     4,809 
         molnupiravir |     4,795 |     4,795 
----------------------+-----------+----------
                Total |    26,506 |    26,506 
(43,071 missing values generated)
(38,750 real changes made)

                      | fail_pre_r
                      |     a
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,381 |     6,381 
           sotrovimab |     2,502 |     2,502 
             paxlovid |     2,477 |     2,477 
         molnupiravir |     2,496 |     2,496 
----------------------+-----------+----------
                Total |    13,856 |    13,856 
(43,112 missing values generated)
(38,843 real changes made)

                      | fail_pre_s
                      |     le
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,311 |     6,311 
           sotrovimab |     2,487 |     2,487 
             paxlovid |     2,532 |     2,532 
         molnupiravir |     2,485 |     2,485 
----------------------+-----------+----------
                Total |    13,815 |    13,815 
(42,886 missing values generated)
(38,566 real changes made)

                      | fail_pre_p
                      |  sorasis
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,492 |     6,492 
           sotrovimab |     2,493 |     2,493 
             paxlovid |     2,492 |     2,492 
         molnupiravir |     2,564 |     2,564 
----------------------+-----------+----------
                Total |    14,041 |    14,041 
(42,982 missing values generated)
(38,676 real changes made)

                      | fail_pre_p
                      |     sa
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,450 |     6,450 
           sotrovimab |     2,527 |     2,527 
             paxlovid |     2,465 |     2,465 
         molnupiravir |     2,503 |     2,503 
----------------------+-----------+----------
                Total |    13,945 |    13,945 
(43,124 missing values generated)
(38,764 real changes made)

                      | fail_pre_a
                      |    xspa
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,326 |     6,326 
           sotrovimab |     2,428 |     2,428 
             paxlovid |     2,542 |     2,542 
         molnupiravir |     2,507 |     2,507 
----------------------+-----------+----------
                Total |    13,803 |    13,803 
(43,064 missing values generated)
(38,748 real changes made)

                      | fail_pre_i
                      |     bd
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     6,344 |     6,344 
           sotrovimab |     2,442 |     2,442 
             paxlovid |     2,571 |     2,571 
         molnupiravir |     2,506 |     2,506 
----------------------+-----------+----------
                Total |    13,863 |    13,863 
(51,242 missing values generated)
(46,141 real changes made)

                      | fail_pre_d
                      | iverticuli
                      | tis_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,608 |     2,608 
           sotrovimab |     1,016 |     1,016 
             paxlovid |     1,018 |     1,018 
         molnupiravir |     1,043 |     1,043 
----------------------+-----------+----------
                Total |     5,685 |     5,685 
(46,166 missing values generated)
(41,553 real changes made)

                      | fail_pre_d
                      | iarrhoea_s
                      |   erious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     4,987 |     4,987 
           sotrovimab |     1,874 |     1,874 
             paxlovid |     1,971 |     1,971 
         molnupiravir |     1,929 |     1,929 
----------------------+-----------+----------
                Total |    10,761 |    10,761 
(51,160 missing values generated)
(46,028 real changes made)

                      | fail_pre_t
                      | aste_serio
                      |     us
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,674 |     2,674 
           sotrovimab |     1,029 |     1,029 
             paxlovid |     1,037 |     1,037 
         molnupiravir |     1,027 |     1,027 
----------------------+-----------+----------
                Total |     5,767 |     5,767 
(51,194 missing values generated)
(46,039 real changes made)

                      | fail_pre_r
                      | ash_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,645 |     2,645 
           sotrovimab |     1,008 |     1,008 
             paxlovid |     1,030 |     1,030 
         molnupiravir |     1,050 |     1,050 
----------------------+-----------+----------
                Total |     5,733 |     5,733 
(41,458 missing values generated)
(37,332 real changes made)

                      | fail_pre_c
                      | ontactderm
                      |  _serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,173 |     7,173 
           sotrovimab |     2,792 |     2,792 
             paxlovid |     2,785 |     2,785 
         molnupiravir |     2,719 |     2,719 
----------------------+-----------+----------
                Total |    15,469 |    15,469 
(51,280 missing values generated)
(46,143 real changes made)

                      | fail_pre_d
                      | izziness_s
                      |   erious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,593 |     2,593 
           sotrovimab |     1,000 |     1,000 
             paxlovid |       987 |       987 
         molnupiravir |     1,067 |     1,067 
----------------------+-----------+----------
                Total |     5,647 |     5,647 
(51,202 missing values generated)
(46,082 real changes made)

                      | fail_pre_n
                      | ausea_vomi
                      | t_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,651 |     2,651 
           sotrovimab |     1,062 |     1,062 
             paxlovid |       999 |       999 
         molnupiravir |     1,013 |     1,013 
----------------------+-----------+----------
                Total |     5,725 |     5,725 
(51,275 missing values generated)
(46,154 real changes made)

                      | fail_pre_h
                      | eadache_se
                      |   rious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,621 |     2,621 
           sotrovimab |       999 |       999 
             paxlovid |     1,020 |     1,020 
         molnupiravir |     1,012 |     1,012 
----------------------+-----------+----------
                Total |     5,652 |     5,652 
(51,163 missing values generated)
(45,997 real changes made)

                      | fail_pre_a
                      | naphylaxis
                      |  _serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,615 |     2,615 
           sotrovimab |     1,028 |     1,028 
             paxlovid |     1,078 |     1,078 
         molnupiravir |     1,043 |     1,043 
----------------------+-----------+----------
                Total |     5,764 |     5,764 
(46,251 missing values generated)
(41,621 real changes made)

                      | fail_pre_d
                      | rugreactio
                      | n_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     4,903 |     4,903 
           sotrovimab |     1,924 |     1,924 
             paxlovid |     1,905 |     1,905 
         molnupiravir |     1,944 |     1,944 
----------------------+-----------+----------
                Total |    10,676 |    10,676 
(51,826 missing values generated)
(46,672 real changes made)

                      | fail_pre_r
                      | a_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,365 |     2,365 
           sotrovimab |       905 |       905 
             paxlovid |       923 |       923 
         molnupiravir |       908 |       908 
----------------------+-----------+----------
                Total |     5,101 |     5,101 
(51,862 missing values generated)
(46,707 real changes made)

                      | fail_pre_s
                      | le_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,300 |     2,300 
           sotrovimab |       899 |       899 
             paxlovid |       969 |       969 
         molnupiravir |       897 |       897 
----------------------+-----------+----------
                Total |     5,065 |     5,065 
(51,774 missing values generated)
(46,566 real changes made)

                      | fail_pre_p
                      | sorasis_se
                      |   rious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,383 |     2,383 
           sotrovimab |       901 |       901 
             paxlovid |       934 |       934 
         molnupiravir |       935 |       935 
----------------------+-----------+----------
                Total |     5,153 |     5,153 
(51,795 missing values generated)
(46,601 real changes made)

                      | fail_pre_p
                      | sa_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,392 |     2,392 
           sotrovimab |       935 |       935 
             paxlovid |       908 |       908 
         molnupiravir |       897 |       897 
----------------------+-----------+----------
                Total |     5,132 |     5,132 
(51,808 missing values generated)
(46,596 real changes made)

                      | fail_pre_a
                      | xspa_serio
                      |     us
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,335 |     2,335 
           sotrovimab |       902 |       902 
             paxlovid |       963 |       963 
         molnupiravir |       919 |       919 
----------------------+-----------+----------
                Total |     5,119 |     5,119 
(51,823 missing values generated)
(46,631 real changes made)

                      | fail_pre_i
                      | bd_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     2,356 |     2,356 
           sotrovimab |       896 |       896 
             paxlovid |       927 |       927 
         molnupiravir |       925 |       925 
----------------------+-----------+----------
                Total |     5,104 |     5,104 
(0 real changes made)

                      | fail_pre_a
                      |     ll
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,318 |    26,318 
           sotrovimab |    10,116 |    10,116 
             paxlovid |    10,236 |    10,236 
         molnupiravir |    10,257 |    10,257 
----------------------+-----------+----------
                Total |    56,927 |    56,927 
(16 missing values generated)
(16 real changes made)

                      | fail_pre_a
                      | ll_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    26,306 |    26,306 
           sotrovimab |    10,114 |    10,114 
             paxlovid |    10,235 |    10,235 
         molnupiravir |    10,256 |    10,256 
----------------------+-----------+----------
                Total |    56,911 |    56,911 
(1,960 missing values generated)
(1,752 real changes made)

                      | fail_pre_s
                      |   pc_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    25,413 |    25,413 
           sotrovimab |     9,764 |     9,764 
             paxlovid |     9,879 |     9,879 
         molnupiravir |     9,911 |     9,911 
----------------------+-----------+----------
                Total |    54,967 |    54,967 
(17,862 missing values generated)
(16,089 real changes made)

                      | fail_pre_s
                      | pc_serious
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    18,094 |    18,094 
           sotrovimab |     6,915 |     6,915 
             paxlovid |     7,026 |     7,026 
         molnupiravir |     7,030 |     7,030 
----------------------+-----------+----------
                Total |    39,065 |    39,065 
(22,163 missing values generated)
(19,896 real changes made)

                      | fail_pre_d
                      |  rug_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    16,001 |    16,001 
           sotrovimab |     6,147 |     6,147 
             paxlovid |     6,310 |     6,310 
         molnupiravir |     6,306 |     6,306 
----------------------+-----------+----------
                Total |    34,764 |    34,764 
(41,556 missing values generated)
(37,345 real changes made)

                      | fail_pre_d
                      | rug_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |     7,051 |     7,051 
           sotrovimab |     2,742 |     2,742 
             paxlovid |     2,777 |     2,777 
         molnupiravir |     2,801 |     2,801 
----------------------+-----------+----------
                Total |    15,371 |    15,371 
(10,655 missing values generated)
(9,601 real changes made)

                      | fail_pre_i
                      |  mae_all
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    21,349 |    21,349 
           sotrovimab |     8,271 |     8,271 
             paxlovid |     8,351 |     8,351 
         molnupiravir |     8,301 |     8,301 
----------------------+-----------+----------
                Total |    46,272 |    46,272 
(32,367 missing values generated)
(29,153 real changes made)

                      | fail_pre_i
                      | mae_seriou
                      |     s
                 drug |         1 |     Total
----------------------+-----------+----------
              control |    11,319 |    11,319 
           sotrovimab |     4,374 |     4,374 
             paxlovid |     4,491 |     4,491 
         molnupiravir |     4,376 |     4,376 
----------------------+-----------+----------
                Total |    24,560 |    24,560 

. 
. * Follow-up time
. foreach x in $pre_ae_combined{
  2.                 stset stop_`x', id(patient_id) origin(time start_comparato
> r) enter(time start_comparator) exit(time start_comparator_28) failure(fail_`
> x'==1) 
  3.                 tab _st  
  4.                 tab _t drug if fail_`x'==1 & stop_`x'==`x'
  5.                 count if start_comparator>=stop_`x' & _st==0
  6.                 count if start_comparator==stop_`x' & _st==0
  7. }

                id:  patient_id
     failure event:  fail_pre_all == 1
obs. time interval:  (stop_pre_all[_n-1], stop_pre_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,700  ignored because never entered
------------------------------------------------------------------------------
     51,227  observations remaining, representing
     51,227  subjects
          0  failures in single-failure-per-subject data
  1,485,583  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,700       10.01       10.01
          1 |     51,227       89.99      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    23,672      9,086      9,202      9,267 |    51,227 
-----------+--------------------------------------------+----------
     Total |    23,672      9,086      9,202      9,267 |    51,227 
  5,700
  0

                id:  patient_id
     failure event:  fail_pre_all_serious == 1
obs. time interval:  (stop_pre_all_serious[_n-1], stop_pre_all_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,700  ignored because never entered
------------------------------------------------------------------------------
     51,227  observations remaining, representing
     51,227  subjects
          0  failures in single-failure-per-subject data
  1,485,583  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,700       10.01       10.01
          1 |     51,227       89.99      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        29 |    23,660      9,084      9,201      9,266 |    51,211 
-----------+--------------------------------------------+----------
     Total |    23,660      9,084      9,201      9,266 |    51,211 
  5,700
  0

                id:  patient_id
     failure event:  fail_pre_spc_all == 1
obs. time interval:  (stop_pre_spc_all[_n-1], stop_pre_spc_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
        208  event time missing (stop_pre_spc_all>=.)           PROBABLE ERROR
      5,492  ignored because never entered
     15,501  observations end on or before enter()
------------------------------------------------------------------------------
     35,726  observations remaining, representing
     35,726  subjects
      1,194  failures in single-failure-per-subject data
  1,018,504  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,201       37.24       37.24
          1 |     35,726       62.76      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        19          5          7          9 |        40 
         1 |        24          7         13          7 |        51 
         2 |        27         10          4         12 |        53 
         3 |        19          3          7          4 |        33 
         4 |        21         11          6          6 |        44 
         5 |        23          8          7          9 |        47 
         6 |        18          3          4          8 |        33 
         7 |        21          7          1          5 |        34 
         8 |        18          8          9          3 |        38 
         9 |        20          5          7          9 |        41 
        10 |        19         11         10          5 |        45 
        11 |        18         12          7          7 |        44 
        12 |        13          8          3          9 |        33 
        13 |        13          9         10          4 |        36 
        14 |        11         13          4          9 |        37 
        15 |        13          9          9          6 |        37 
        16 |        17         10         10          6 |        43 
        17 |        14          9          8          8 |        39 
        18 |        11          4          5         10 |        30 
        19 |        18          8          6          6 |        38 
        20 |        17          5          2          9 |        33 
        21 |        15         10         10          4 |        39 
        22 |        17          9          7          9 |        42 
        23 |        16         11         10          4 |        41 
        24 |        20          7          5          7 |        39 
        25 |        23          5          7         11 |        46 
        26 |        17          8          4          6 |        35 
        27 |        20          7          3         10 |        40 
        28 |        19          7          8          9 |        43 
        29 |    15,153      5,856      5,871      5,940 |    32,820 
-----------+--------------------------------------------+----------
     Total |    15,674      6,085      6,064      6,151 |    33,974 
  21,201
  208

                id:  patient_id
     failure event:  fail_pre_spc_serious == 1
obs. time interval:  (stop_pre_spc_serious[_n-1], stop_pre_spc_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      1,773  event time missing (stop_pre_spc_serious>=.)       PROBABLE ERROR
      3,927  ignored because never entered
      7,478  observations end on or before enter()
------------------------------------------------------------------------------
     43,749  observations remaining, representing
     43,749  subjects
        625  failures in single-failure-per-subject data
  1,259,714  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,178       23.15       23.15
          1 |     43,749       76.85      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         8          3          5          3 |        19 
         1 |        11          4          4          7 |        26 
         2 |        10          2          1          6 |        19 
         3 |         8          3          3          2 |        16 
         4 |         9          7          3          5 |        24 
         5 |         9          1          5          6 |        21 
         6 |        10          1          3          1 |        15 
         7 |        16          3          0          4 |        23 
         8 |        10          5          7          2 |        24 
         9 |         9          4          3          5 |        21 
        10 |         9          4          3          2 |        18 
        11 |        12          7          2          3 |        24 
        12 |         9          2          3          7 |        21 
        13 |         7          3          6          0 |        16 
        14 |        10          5          1          3 |        19 
        15 |        10          5          2          4 |        21 
        16 |         9          6          4          3 |        22 
        17 |         8          5          7          4 |        24 
        18 |         7          3          2          3 |        15 
        19 |        11          7          3          4 |        25 
        20 |        10          1          4          6 |        21 
        21 |        10          2          6          4 |        22 
        22 |         8          6          4          3 |        21 
        23 |        10          5          4          2 |        21 
        24 |        14          4          1          5 |        24 
        25 |        13          5          4          4 |        26 
        26 |        12          3          0          3 |        18 
        27 |        12          2          2          6 |        22 
        28 |         7          3          3          6 |        19 
        29 |    12,509      4,788      4,890      4,866 |    27,053 
-----------+--------------------------------------------+----------
     Total |    12,797      4,899      4,985      4,979 |    27,660 
  13,178
  1,773

                id:  patient_id
     failure event:  fail_pre_drug_all == 1
obs. time interval:  (stop_pre_drug_all[_n-1], stop_pre_drug_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      2,267  event time missing (stop_pre_drug_all>=.)          PROBABLE ERROR
      3,433  ignored because never entered
      4,599  observations end on or before enter()
------------------------------------------------------------------------------
     46,628  observations remaining, representing
     46,628  subjects
        417  failures in single-failure-per-subject data
  1,346,038  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,299       18.09       18.09
          1 |     46,628       81.91      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         6          2          2          4 |        14 
         1 |         7          4          3          0 |        14 
         2 |        13          4          1          5 |        23 
         3 |         7          1          4          2 |        14 
         4 |         8          1          3          1 |        13 
         5 |         8          5          3          2 |        18 
         6 |         8          1          2          3 |        14 
         7 |         3          7          0          0 |        10 
         8 |         9          1          1          2 |        13 
         9 |         6          1          1          3 |        11 
        10 |         8          4          3          4 |        19 
        11 |         4          4          4          2 |        14 
        12 |         6          3          1          1 |        11 
        13 |         4          4          4          2 |        14 
        14 |         6          4          1          4 |        15 
        15 |         3          5          2          3 |        13 
        16 |         4          2          4          2 |        12 
        17 |         4          4          3          5 |        16 
        18 |         3          2          4          4 |        13 
        19 |         4          1          0          1 |         6 
        20 |         6          3          2          2 |        13 
        21 |         5          4          3          1 |        13 
        22 |         6          3          2          4 |        15 
        23 |         6          2          3          2 |        13 
        24 |         7          2          2          2 |        13 
        25 |         7          3          3          3 |        16 
        26 |         9          5          2          2 |        18 
        27 |         7          3          1          1 |        12 
        28 |         6          5          3          3 |        17 
        29 |    12,142      4,621      4,783      4,779 |    26,325 
-----------+--------------------------------------------+----------
     Total |    12,322      4,711      4,850      4,849 |    26,732 
  10,299
  2,267

                id:  patient_id
     failure event:  fail_pre_drug_serious == 1
obs. time interval:  (stop_pre_drug_serious[_n-1], stop_pre_drug_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,211  event time missing (stop_pre_drug_serious>=.)      PROBABLE ERROR
      1,489  ignored because never entered
      2,399  observations end on or before enter()
------------------------------------------------------------------------------
     48,828  observations remaining, representing
     48,828  subjects
        222  failures in single-failure-per-subject data
  1,412,710  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,099       14.23       14.23
          1 |     48,828       85.77      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         3          0          2          1 |         6 
         1 |         5          3          2          0 |        10 
         2 |         7          4          0          3 |        14 
         3 |         2          1          2          2 |         7 
         4 |         4          1          0          0 |         5 
         5 |         5          3          2          0 |        10 
         6 |         5          1          2          2 |        10 
         7 |         0          3          0          0 |         3 
         8 |         8          1          2          1 |        12 
         9 |         3          0          1          2 |         6 
        10 |         4          2          1          1 |         8 
        11 |         3          0          2          1 |         6 
        12 |         1          2          1          0 |         4 
        13 |         4          0          2          1 |         7 
        14 |         2          2          1          1 |         6 
        15 |         0          3          2          0 |         5 
        16 |         4          2          0          0 |         6 
        17 |         1          3          2          2 |         8 
        18 |         0          1          3          5 |         9 
        19 |         3          1          0          1 |         5 
        20 |         1          0          1          1 |         3 
        21 |         4          3          2          1 |        10 
        22 |         4          2          1          3 |        10 
        23 |         2          1          0          2 |         5 
        24 |         5          2          1          1 |         9 
        25 |         2          1          1          3 |         7 
        26 |         6          3          2          1 |        12 
        27 |         5          0          1          1 |         7 
        28 |         2          3          1          1 |         7 
        29 |     5,163      2,004      2,043      2,056 |    11,266 
-----------+--------------------------------------------+----------
     Total |     5,258      2,052      2,080      2,093 |    11,483 
  8,099
  4,211

                id:  patient_id
     failure event:  fail_pre_imae_all == 1
obs. time interval:  (stop_pre_imae_all[_n-1], stop_pre_imae_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      1,054  event time missing (stop_pre_imae_all>=.)          PROBABLE ERROR
      4,646  ignored because never entered
      7,888  observations end on or before enter()
------------------------------------------------------------------------------
     43,339  observations remaining, representing
     43,339  subjects
        695  failures in single-failure-per-subject data
  1,247,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,588       23.87       23.87
          1 |     43,339       76.13      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |        13          2          2          7 |        24 
         1 |        12          1          7          5 |        25 
         2 |         9          4          6          5 |        24 
         3 |        10          5          3          3 |        21 
         4 |        12          3          3          3 |        21 
         5 |         9          3          1          2 |        15 
         6 |        14          3          6          1 |        24 
         7 |        11          2          7          7 |        27 
         8 |        13          3          6          3 |        25 
         9 |         7          7          3          6 |        23 
        10 |         4          4          3          2 |        13 
        11 |         9          1          2          6 |        18 
        12 |         7          6          6          5 |        24 
        13 |        16          3          3          1 |        23 
        14 |        16          4          3          7 |        30 
        15 |         6          4          5          5 |        20 
        16 |        10          4          8          5 |        27 
        17 |        10          3          4          4 |        21 
        18 |        11          5          1          2 |        19 
        19 |         8          4          2          4 |        18 
        20 |        12          7          4          2 |        25 
        21 |        10          0          4          5 |        19 
        22 |        15          7          5          3 |        30 
        23 |         8          7          7          2 |        24 
        24 |         7          6          4          7 |        24 
        25 |        10          6          7          3 |        26 
        26 |        14          6          5          8 |        33 
        27 |         9          3          4          5 |        21 
        28 |        11          6          3          5 |        25 
        29 |    15,273      5,939      5,900      5,957 |    33,069 
-----------+--------------------------------------------+----------
     Total |    15,576      6,058      6,024      6,080 |    33,738 
  13,588
  1,054

                id:  patient_id
     failure event:  fail_pre_imae_serious == 1
obs. time interval:  (stop_pre_imae_serious[_n-1], stop_pre_imae_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      3,214  event time missing (stop_pre_imae_serious>=.)      PROBABLE ERROR
      2,486  ignored because never entered
      4,138  observations end on or before enter()
------------------------------------------------------------------------------
     47,089  observations remaining, representing
     47,089  subjects
        381  failures in single-failure-per-subject data
  1,360,210  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,838       17.28       17.28
          1 |     47,089       82.72      100.00
------------+-----------------------------------
      Total |     56,927      100.00

  analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
       .75 |         3          2          2          4 |        11 
         1 |         7          2          5          2 |        16 
         2 |         4          2          5          3 |        14 
         3 |         5          3          1          2 |        11 
         4 |         4          1          1          3 |         9 
         5 |         4          1          1          2 |         8 
         6 |         9          3          4          0 |        16 
         7 |         5          0          5          4 |        14 
         8 |         7          1          3          2 |        13 
         9 |         2          3          2          4 |        11 
        10 |         3          3          1          1 |         8 
        11 |         6          1          1          5 |        13 
        12 |         5          3          1          2 |        11 
        13 |        10          0          1          1 |        12 
        14 |        10          2          3          6 |        21 
        15 |         0          1          1          3 |         5 
        16 |         7          2          4          4 |        17 
        17 |         5          2          3          1 |        11 
        18 |         6          3          1          1 |        11 
        19 |         6          1          0          1 |         8 
        20 |         8          4          1          1 |        14 
        21 |         5          0          3          4 |        12 
        22 |        12          4          3          2 |        21 
        23 |         3          5          2          2 |        12 
        24 |         6          3          3          2 |        14 
        25 |         4          3          5          1 |        13 
        26 |        11          3          3          3 |        20 
        27 |         7          0          2          2 |        11 
        28 |         3          4          2          4 |        13 
        29 |     8,089      3,154      3,173      3,150 |    17,566 
-----------+--------------------------------------------+----------
     Total |     8,256      3,216      3,242      3,222 |    17,936 
  9,838
  3,214

. 
. ********************************************************
. *       RATES OF EVENTS         *
. ********************************************************
. tempname comparator_rates

. postfile `comparator_rates' str20(failure) ///
>                 all_ptime all_events all_rate all_lci all_uci ///
>                 control_ptime control_events control_rate control_lci_ contro
> l_uci ///
>                 sot_ptime sot_events sot_rate sot_lci sot_uci ///
>                 pax_ptime pax_events pax_rate pax_lci pax_uci ///
>                 mol_ptime mol_events mol_rate mol_lci mol_uci ///
>                 using "$projectdir/output/tables/comparator_rates", replace  
>    

.         
. foreach fail in $pre_ae_disease $pre_ae_disease_serious $pre_ae_combined{
  2.         stset stop_`fail', id(patient_id) origin(time start_comparator) en
> ter(time start_comparator) exit(time start_comparator_28) failure(fail_`fail'
> ==1)                     
  3.                 stptime 
  4.                                         local all_rate = `r(rate)'
  5.                                         local all_ptime = `r(ptime)'
  6.                                         local all_lci = `r(lb)'
  7.                                         local all_uci = `r(ub)'
  8.                                         local all_events = `r(failures)'  
>                                       
  9.                 stptime if drug == 0
 10.                                         local control_rate = `r(rate)'
 11.                                         local control_ptime = `r(ptime)'
 12.                                         local control_lci = `r(lb)'
 13.                                         local control_uci = `r(ub)'
 14.                                         local control_events = `r(failures
> )'
 15.                 display "no drug"
 16.                 stptime if drug == 1
 17.                                         local sot_rate = `r(rate)'
 18.                                         local sot_ptime = `r(ptime)'
 19.                                         local sot_lci = `r(lb)'
 20.                                         local sot_uci = `r(ub)'
 21.                                         local sot_events = `r(failures)'
 22.                 display "sotrovimab"
 23.                 stptime if drug == 2
 24.                                         local pax_rate = `r(rate)'
 25.                                         local pax_ptime = `r(ptime)'
 26.                                         local pax_lci = `r(lb)'
 27.                                         local pax_uci = `r(ub)'
 28.                                         local pax_events = `r(failures)'  
>               
 29.                 display "paxlovid"
 30.                 stptime if drug == 3
 31.                                         local mol_rate = `r(rate)'
 32.                                         local mol_ptime = `r(ptime)'
 33.                                         local mol_lci = `r(lb)'
 34.                                         local mol_uci = `r(ub)'
 35.                                         local mol_events = `r(failures)'  
>               
 36.                 display "molnupavir"                    
 37.                 post `comparator_rates' ("`fail'")      (`all_ptime') (`al
> l_events') (`all_rate') (`all_lci') (`all_uci') ///
>                                         (`control_ptime') (`control_events') 
> (`control_rate') (`control_lci') (`control_uci') ///
>                                         (`sot_ptime') (`sot_events') (`sot_ra
> te') (`sot_lci') (`sot_uci') ///
>                                         (`pax_ptime') (`pax_events') (`pax_ra
> te') (`pax_lci') (`pax_uci') ///
>                                         (`mol_ptime') (`mol_events') (`mol_ra
> te') (`mol_lci') (`mol_uci')       
 38.                                         
. }

                id:  patient_id
     failure event:  fail_pre_diverticulitis == 1
obs. time interval:  (stop_pre_diverticulitis[_n-1], stop_pre_diverticulitis]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,181  event time missing (stop_pre_diverticulitis>=.)    PROBABLE ERROR
      1,519  ignored because never entered
      1,612  observations end on or before enter()
------------------------------------------------------------------------------
     49,615  observations remaining, representing
     49,615  subjects
        153  failures in single-failure-per-subject data
  1,436,667  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1436666.8        153    .0001065   .0000909    .0001248

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       663598         68   .00010247   .0000808      .00013
no drug

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       254907         28   .00010984   .0000758    .0001591
sotrovimab

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257780         26   .00010086   .0000687    .0001481
paxlovid

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    260381.75         31   .00011906   .0000837    .0001693
molnupavir

                id:  patient_id
     failure event:  fail_pre_diarrhoea == 1
obs. time interval:  (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,137  event time missing (stop_pre_diarrhoea>=.)         PROBABLE ERROR
      1,563  ignored because never entered
      2,331  observations end on or before enter()
------------------------------------------------------------------------------
     48,896  observations remaining, representing
     48,896  subjects
        209  failures in single-failure-per-subject data
  1,414,904  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1414903.5        209   .00014771    .000129    .0001692

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    653285.75        108   .00016532   .0001369    .0001996
no drug

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       252106         24    .0000952   .0000638     .000142
sotrovimab

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       254576         39    .0001532   .0001119    .0002097
paxlovid

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    254935.75         38   .00014906   .0001085    .0002049
molnupavir

                id:  patient_id
     failure event:  fail_pre_taste == 1
obs. time interval:  (stop_pre_taste[_n-1], stop_pre_taste]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,640  event time missing (stop_pre_taste>=.)             PROBABLE ERROR
      1,060  ignored because never entered
      1,624  observations end on or before enter()
------------------------------------------------------------------------------
     49,603  observations remaining, representing
     49,603  subjects
        135  failures in single-failure-per-subject data
  1,436,564  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1436563.5        135   .00009397   .0000794    .0001112

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    663653.25         68   .00010246   .0000808      .00013
no drug

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    254526.75         21   .00008251   .0000538    .0001265
sotrovimab

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257825         25   .00009696   .0000655    .0001435
paxlovid

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     260558.5         21    .0000806   .0000525    .0001236
molnupavir

                id:  patient_id
     failure event:  fail_pre_rash == 1
obs. time interval:  (stop_pre_rash[_n-1], stop_pre_rash]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,171  event time missing (stop_pre_rash>=.)              PROBABLE ERROR
      1,529  ignored because never entered
      1,680  observations end on or before enter()
------------------------------------------------------------------------------
     49,547  observations remaining, representing
     49,547  subjects
        129  failures in single-failure-per-subject data
  1,435,057  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1435057.3        129   .00008989   .0000756    .0001068

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    663465.75         70   .00010551   .0000835    .0001334
no drug

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       254584         21   .00008249   .0000538    .0001265
sotrovimab

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     257839.5         18   .00006981    .000044    .0001108
paxlovid

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259168         20   .00007717   .0000498    .0001196
molnupavir

                id:  patient_id
     failure event:  fail_pre_bronchospasm == 1
obs. time interval:  (stop_pre_bronchospasm[_n-1], stop_pre_bronchospasm]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,125  event time missing (stop_pre_bronchospasm>=.)      PROBABLE ERROR
        575  ignored because never entered
        785  observations end on or before enter()
------------------------------------------------------------------------------
     50,442  observations remaining, representing
     50,442  subjects
         82  failures in single-failure-per-subject data
  1,461,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1461621         82    .0000561   .0000452    .0000697

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       675422         30   .00004442   .0000311    .0000635
no drug

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259511         20   .00007707   .0000497    .0001195
sotrovimab

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262408         15   .00005716   .0000345    .0000948
paxlovid

         failure _d:  fail_pre_bronchospasm == 1
   analysis time _t:  (stop_pre_bronchospasm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264280         17   .00006433     .00004    .0001035
molnupavir

                id:  patient_id
     failure event:  fail_pre_contactderm == 1
obs. time interval:  (stop_pre_contactderm[_n-1], stop_pre_contactderm]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,126  event time missing (stop_pre_contactderm>=.)       PROBABLE ERROR
      1,574  ignored because never entered
      1,674  observations end on or before enter()
------------------------------------------------------------------------------
     49,553  observations remaining, representing
     49,553  subjects
        150  failures in single-failure-per-subject data
  1,434,762  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1434761.5        150   .00010455   .0000891    .0001227

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       661728         64   .00009672   .0000757    .0001236
no drug

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    254755.75         28   .00010991   .0000759    .0001592
sotrovimab

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258095.75         24   .00009299   .0000623    .0001387
paxlovid

         failure _d:  fail_pre_contactderm == 1
   analysis time _t:  (stop_pre_contactderm-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260182         34   .00013068   .0000934    .0001829
molnupavir

                id:  patient_id
     failure event:  fail_pre_dizziness == 1
obs. time interval:  (stop_pre_dizziness[_n-1], stop_pre_dizziness]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,169  event time missing (stop_pre_dizziness>=.)         PROBABLE ERROR
      1,531  ignored because never entered
      1,655  observations end on or before enter()
------------------------------------------------------------------------------
     49,572  observations remaining, representing
     49,572  subjects
        118  failures in single-failure-per-subject data
  1,436,017  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1436017        118   .00008217   .0000686    .0000984

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     662830.5         60   .00009052   .0000703    .0001166
no drug

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    255229.75         20   .00007836   .0000506    .0001215
sotrovimab

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     257680.5         20   .00007762   .0000501    .0001203
paxlovid

         failure _d:  fail_pre_dizziness == 1
   analysis time _t:  (stop_pre_dizziness-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    260276.25         18   .00006916   .0000436    .0001098
molnupavir

                id:  patient_id
     failure event:  fail_pre_nausea_vomit == 1
obs. time interval:  (stop_pre_nausea_vomit[_n-1], stop_pre_nausea_vomit]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,604  event time missing (stop_pre_nausea_vomit>=.)      PROBABLE ERROR
      1,096  ignored because never entered
      1,617  observations end on or before enter()
------------------------------------------------------------------------------
     49,610  observations remaining, representing
     49,610  subjects
        148  failures in single-failure-per-subject data
  1,436,554  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1436553.8        148   .00010302   .0000877     .000121

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     663191.5         72   .00010857   .0000862    .0001368
no drug

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     255725.5         22   .00008603   .0000566    .0001307
sotrovimab

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257650.75         29   .00011256   .0000782     .000162
paxlovid

         failure _d:  fail_pre_nausea_vomit == 1
   analysis time _t:  (stop_pre_nausea_vomit-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259986         25   .00009616    .000065    .0001423
molnupavir

                id:  patient_id
     failure event:  fail_pre_headache == 1
obs. time interval:  (stop_pre_headache[_n-1], stop_pre_headache]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,125  event time missing (stop_pre_headache>=.)          PROBABLE ERROR
      1,575  ignored because never entered
      1,612  observations end on or before enter()
------------------------------------------------------------------------------
     49,615  observations remaining, representing
     49,615  subjects
        143  failures in single-failure-per-subject data
  1,437,050  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1437049.8        143   .00009951   .0000845    .0001172

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    664406.75         66   .00009934    .000078    .0001264
no drug

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       255313         34   .00013317   .0000952    .0001864
sotrovimab

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       257496         28   .00010874   .0000751    .0001575
paxlovid

         failure _d:  fail_pre_headache == 1
   analysis time _t:  (stop_pre_headache-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259834         15   .00005773   .0000348    .0000958
molnupavir

                id:  patient_id
     failure event:  fail_pre_anaphylaxis == 1
obs. time interval:  (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,180  event time missing (stop_pre_anaphylaxis>=.)       PROBABLE ERROR
      1,520  ignored because never entered
      1,617  observations end on or before enter()
------------------------------------------------------------------------------
     49,610  observations remaining, representing
     49,610  subjects
        159  failures in single-failure-per-subject data
  1,436,489  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1436488.8        159   .00011069   .0000948    .0001293

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     664158.5         69   .00010389   .0000821    .0001315
no drug

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       254884         35   .00013732   .0000986    .0001913
sotrovimab

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257746.75         24   .00009311   .0000624    .0001389
paxlovid

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     259699.5         31   .00011937   .0000839    .0001697
molnupavir

                id:  patient_id
     failure event:  fail_pre_drugreaction == 1
obs. time interval:  (stop_pre_drugreaction[_n-1], stop_pre_drugreaction]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      3,046  event time missing (stop_pre_drugreaction>=.)      PROBABLE ERROR
      2,654  ignored because never entered
      3,108  observations end on or before enter()
------------------------------------------------------------------------------
     48,119  observations remaining, representing
     48,119  subjects
        275  failures in single-failure-per-subject data
  1,391,226  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1391225.8        275   .00019767   .0001756    .0002225

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       642840        123   .00019134   .0001603    .0002283
no drug

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     246952.5         61   .00024701   .0001922    .0003175
sotrovimab

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    250427.75         47   .00018768    .000141    .0002498
paxlovid

         failure _d:  fail_pre_drugreaction == 1
   analysis time _t:  (stop_pre_drugreaction-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     251005.5         44   .00017529   .0001305    .0002356
molnupavir

                id:  patient_id
     failure event:  fail_pre_ra == 1
obs. time interval:  (stop_pre_ra[_n-1], stop_pre_ra]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,321  event time missing (stop_pre_ra>=.)                PROBABLE ERROR
      1,379  ignored because never entered
      1,418  observations end on or before enter()
------------------------------------------------------------------------------
     49,809  observations remaining, representing
     49,809  subjects
        141  failures in single-failure-per-subject data
  1,442,598  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1442598        141   .00009774   .0000829    .0001153

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     665786.5         70   .00010514   .0000832    .0001329
no drug

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    255846.75         24   .00009381   .0000629      .00014
sotrovimab

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259724         22   .00008471   .0000558    .0001286
paxlovid

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    261240.75         25    .0000957   .0000647    .0001416
molnupavir

                id:  patient_id
     failure event:  fail_pre_sle == 1
obs. time interval:  (stop_pre_sle[_n-1], stop_pre_sle]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,269  event time missing (stop_pre_sle>=.)               PROBABLE ERROR
      1,431  ignored because never entered
      1,477  observations end on or before enter()
------------------------------------------------------------------------------
     49,750  observations remaining, representing
     49,750  subjects
        147  failures in single-failure-per-subject data
  1,440,632  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1440631.5        147   .00010204   .0000868    .0001199

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    666021.75         56   .00008408   .0000647    .0001093
no drug

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       255996         34   .00013281   .0000949    .0001859
sotrovimab

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    257961.75         28   .00010854   .0000749    .0001572
paxlovid

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260652         29   .00011126   .0000773    .0001601
molnupavir

                id:  patient_id
     failure event:  fail_pre_psorasis == 1
obs. time interval:  (stop_pre_psorasis[_n-1], stop_pre_psorasis]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,320  event time missing (stop_pre_psorasis>=.)          PROBABLE ERROR
      1,380  ignored because never entered
      1,487  observations end on or before enter()
------------------------------------------------------------------------------
     49,740  observations remaining, representing
     49,740  subjects
        119  failures in single-failure-per-subject data
  1,440,770  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1440769.8        119   .00008259    .000069    .0000989

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       666133         50   .00007506   .0000569     .000099
no drug

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       255377         23   .00009006   .0000598    .0001355
sotrovimab

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258822         20   .00007727   .0000499    .0001198
paxlovid

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    260437.75         26   .00009983    .000068    .0001466
molnupavir

                id:  patient_id
     failure event:  fail_pre_psa == 1
obs. time interval:  (stop_pre_psa[_n-1], stop_pre_psa]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,306  event time missing (stop_pre_psa>=.)               PROBABLE ERROR
      1,394  ignored because never entered
      1,443  observations end on or before enter()
------------------------------------------------------------------------------
     49,784  observations remaining, representing
     49,784  subjects
        138  failures in single-failure-per-subject data
  1,441,869  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1441868.5        138   .00009571    .000081    .0001131

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    666012.75         61   .00009159   .0000713    .0001177
no drug

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       255765         24   .00009384   .0000629      .00014
sotrovimab

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259396         29    .0001118   .0000777    .0001609
paxlovid

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    260694.75         24   .00009206   .0000617    .0001374
molnupavir

                id:  patient_id
     failure event:  fail_pre_axspa == 1
obs. time interval:  (stop_pre_axspa[_n-1], stop_pre_axspa]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,360  event time missing (stop_pre_axspa>=.)             PROBABLE ERROR
      1,340  ignored because never entered
      1,401  observations end on or before enter()
------------------------------------------------------------------------------
     49,826  observations remaining, representing
     49,826  subjects
        121  failures in single-failure-per-subject data
  1,443,092  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1443092.3        121   .00008385   .0000702    .0001002

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    667106.75         64   .00009594   .0000751    .0001226
no drug

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    256396.75         14    .0000546   .0000323    .0000922
sotrovimab

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258765.75         27   .00010434   .0000716    .0001521
paxlovid

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260823         16   .00006134   .0000376    .0001001
molnupavir

                id:  patient_id
     failure event:  fail_pre_ibd == 1
obs. time interval:  (stop_pre_ibd[_n-1], stop_pre_ibd]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,316  event time missing (stop_pre_ibd>=.)               PROBABLE ERROR
      1,384  ignored because never entered
      1,464  observations end on or before enter()
------------------------------------------------------------------------------
     49,763  observations remaining, representing
     49,763  subjects
        143  failures in single-failure-per-subject data
  1,441,058  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1441057.8        143   .00009923   .0000842    .0001169

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    666081.75         68   .00010209   .0000805    .0001295
no drug

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       256020         25   .00009765    .000066    .0001445
sotrovimab

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258086         27   .00010462   .0000717    .0001526
paxlovid

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260870         23   .00008817   .0000586    .0001327
molnupavir

                id:  patient_id
     failure event:  fail_pre_diverticulitis_serious == 1
obs. time interval:  (stop_pre_diverticulitis_serious[_n-1], stop_pre_diverticu
> litis_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,101  event time missing (stop_pre_diverticulitis_serious>=.)PROBABLE ER
> ROR
        599  ignored because never entered
        817  observations end on or before enter()
------------------------------------------------------------------------------
     50,410  observations remaining, representing
     50,410  subjects
         79  failures in single-failure-per-subject data
  1,460,723  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1460722.5         79   .00005408   .0000434    .0000674

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    675297.75         34   .00005035    .000036    .0000705
no drug

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259305         15   .00005785   .0000349     .000096
sotrovimab

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262031         12    .0000458    .000026    .0000806
paxlovid

         failure _d:  fail_pre_diverticulitis_serious == 1
   analysis time _t:  (stop_pre_diverticulitis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    264088.75         18   .00006816   .0000429    .0001082
molnupavir

                id:  patient_id
     failure event:  fail_pre_diarrhoea_serious == 1
obs. time interval:  (stop_pre_diarrhoea_serious[_n-1], stop_pre_diarrhoea_seri
> ous]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,613  event time missing (stop_pre_diarrhoea_serious>=.) PROBABLE ERROR
      1,087  ignored because never entered
      1,540  observations end on or before enter()
------------------------------------------------------------------------------
     49,687  observations remaining, representing
     49,687  subjects
        139  failures in single-failure-per-subject data
  1,438,921  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1438920.5        139    .0000966   .0000818    .0001141

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     665241.5         71   .00010673   .0000846    .0001347
no drug

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       255352         15   .00005874   .0000354    .0000974
sotrovimab

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258741         28   .00010822   .0000747    .0001567
paxlovid

         failure _d:  fail_pre_diarrhoea_serious == 1
   analysis time _t:  (stop_pre_diarrhoea_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259586         25   .00009631   .0000651    .0001425
molnupavir

                id:  patient_id
     failure event:  fail_pre_taste_serious == 1
obs. time interval:  (stop_pre_taste_serious[_n-1], stop_pre_taste_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,132  event time missing (stop_pre_taste_serious>=.)     PROBABLE ERROR
        568  ignored because never entered
        809  observations end on or before enter()
------------------------------------------------------------------------------
     50,418  observations remaining, representing
     50,418  subjects
         71  failures in single-failure-per-subject data
  1,460,996  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1460996         71    .0000486   .0000385    .0000613

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    674855.75         38   .00005631    .000041    .0000774
no drug

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259062         12   .00004632   .0000263    .0000816
sotrovimab

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262665.25         10   .00003807   .0000205    .0000708
paxlovid

         failure _d:  fail_pre_taste_serious == 1
   analysis time _t:  (stop_pre_taste_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264413         11    .0000416    .000023    .0000751
molnupavir

                id:  patient_id
     failure event:  fail_pre_rash_serious == 1
obs. time interval:  (stop_pre_rash_serious[_n-1], stop_pre_rash_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,155  event time missing (stop_pre_rash_serious>=.)      PROBABLE ERROR
        545  ignored because never entered
        876  observations end on or before enter()
------------------------------------------------------------------------------
     50,351  observations remaining, representing
     50,351  subjects
         67  failures in single-failure-per-subject data
  1,459,307  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1459306.8         67   .00004591   .0000361    .0000583

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       674543         35   .00005189   .0000373    .0000723
no drug

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258850         12   .00004636   .0000263    .0000816
sotrovimab

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262247.75         10   .00003813   .0000205    .0000709
paxlovid

         failure _d:  fail_pre_rash_serious == 1
   analysis time _t:  (stop_pre_rash_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       263666         10   .00003793   .0000204    .0000705
molnupavir

                id:  patient_id
     failure event:  fail_pre_contactderm_serious == 1
obs. time interval:  (stop_pre_contactderm_serious[_n-1], stop_pre_contactderm_
> serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,126  event time missing (stop_pre_contactderm_serious>=.)PROBABLE ERROR
      1,574  ignored because never entered
      1,674  observations end on or before enter()
------------------------------------------------------------------------------
     49,553  observations remaining, representing
     49,553  subjects
        150  failures in single-failure-per-subject data
  1,434,762  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1434761.5        150   .00010455   .0000891    .0001227

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       661728         64   .00009672   .0000757    .0001236
no drug

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    254755.75         28   .00010991   .0000759    .0001592
sotrovimab

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258095.75         24   .00009299   .0000623    .0001387
paxlovid

         failure _d:  fail_pre_contactderm_serious == 1
   analysis time _t:  (stop_pre_contactderm_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260182         34   .00013068   .0000934    .0001829
molnupavir

                id:  patient_id
     failure event:  fail_pre_dizziness_serious == 1
obs. time interval:  (stop_pre_dizziness_serious[_n-1], stop_pre_dizziness_seri
> ous]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,137  event time missing (stop_pre_dizziness_serious>=.) PROBABLE ERROR
        563  ignored because never entered
        839  observations end on or before enter()
------------------------------------------------------------------------------
     50,388  observations remaining, representing
     50,388  subjects
         63  failures in single-failure-per-subject data
  1,460,398  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1460397.8         63   .00004314   .0000337    .0000552

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     675200.5         35   .00005184   .0000372    .0000722
no drug

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    259105.75         12   .00004631   .0000263    .0000816
sotrovimab

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262252          6   .00002288   .0000103    .0000509
paxlovid

         failure _d:  fail_pre_dizziness_serious == 1
   analysis time _t:  (stop_pre_dizziness_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     263839.5         10    .0000379   .0000204    .0000704
molnupavir

                id:  patient_id
     failure event:  fail_pre_nausea_vomit_serious == 1
obs. time interval:  (stop_pre_nausea_vomit_serious[_n-1], stop_pre_nausea_vomi
> t_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,120  event time missing (stop_pre_nausea_vomit_serious>=.)PROBABLE ERRO
> R
        580  ignored because never entered
        813  observations end on or before enter()
------------------------------------------------------------------------------
     50,414  observations remaining, representing
     50,414  subjects
         66  failures in single-failure-per-subject data
  1,461,042  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1461041.5         66   .00004517   .0000355    .0000575

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    674759.75         29   .00004298   .0000299    .0000618
no drug

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    259420.75         10   .00003855   .0000207    .0000716
sotrovimab

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262675         16   .00006091   .0000373    .0000994
paxlovid

         failure _d:  fail_pre_nausea_vomit_serious == 1
   analysis time _t:  (stop_pre_nausea_vomit_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264186         11   .00004164   .0000231    .0000752
molnupavir

                id:  patient_id
     failure event:  fail_pre_headache_serious == 1
obs. time interval:  (stop_pre_headache_serious[_n-1], stop_pre_headache_seriou
> s]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,121  event time missing (stop_pre_headache_serious>=.)  PROBABLE ERROR
        579  ignored because never entered
        819  observations end on or before enter()
------------------------------------------------------------------------------
     50,408  observations remaining, representing
     50,408  subjects
         79  failures in single-failure-per-subject data
  1,460,879  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1460878.8         79   .00005408   .0000434    .0000674

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    675365.75         41   .00006071   .0000447    .0000824
no drug

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259124         21   .00008104   .0000528    .0001243
sotrovimab

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262214          7    .0000267   .0000127     .000056
paxlovid

         failure _d:  fail_pre_headache_serious == 1
   analysis time _t:  (stop_pre_headache_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264175         10   .00003785   .0000204    .0000704
molnupavir

                id:  patient_id
     failure event:  fail_pre_anaphylaxis_serious == 1
obs. time interval:  (stop_pre_anaphylaxis_serious[_n-1], stop_pre_anaphylaxis_
> serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,166  event time missing (stop_pre_anaphylaxis_serious>=.)PROBABLE ERROR
        534  ignored because never entered
        836  observations end on or before enter()
------------------------------------------------------------------------------
     50,391  observations remaining, representing
     50,391  subjects
         75  failures in single-failure-per-subject data
  1,460,328  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1460327.5         75   .00005136    .000041    .0000644

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    675027.75         31   .00004592   .0000323    .0000653
no drug

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       258831         16   .00006182   .0000379    .0001009
sotrovimab

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262197.75         14   .00005339   .0000316    .0000902
paxlovid

         failure _d:  fail_pre_anaphylaxis_serious == 1
   analysis time _t:  (stop_pre_anaphylaxis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264271         14   .00005298   .0000314    .0000894
molnupavir

                id:  patient_id
     failure event:  fail_pre_drugreaction_serious == 1
obs. time interval:  (stop_pre_drugreaction_serious[_n-1], stop_pre_drugreactio
> n_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,630  event time missing (stop_pre_drugreaction_serious>=.)PROBABLE ERRO
> R
      1,070  ignored because never entered
      1,596  observations end on or before enter()
------------------------------------------------------------------------------
     49,631  observations remaining, representing
     49,631  subjects
        151  failures in single-failure-per-subject data
  1,436,934  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1436934        151   .00010508   .0000896    .0001233

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     663586.5         70   .00010549   .0000835    .0001333
no drug

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       255284         33   .00012927   .0000919    .0001818
sotrovimab

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    258415.75         23     .000089   .0000591    .0001339
paxlovid

         failure _d:  fail_pre_drugreaction_serious == 1
   analysis time _t:  (stop_pre_drugreaction_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    259647.75         25   .00009628   .0000651    .0001425
molnupavir

                id:  patient_id
     failure event:  fail_pre_ra_serious == 1
obs. time interval:  (stop_pre_ra_serious[_n-1], stop_pre_ra_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,154  event time missing (stop_pre_ra_serious>=.)        PROBABLE ERROR
        546  ignored because never entered
        727  observations end on or before enter()
------------------------------------------------------------------------------
     50,500  observations remaining, representing
     50,500  subjects
         72  failures in single-failure-per-subject data
  1,463,540  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463540.3         72    .0000492    .000039     .000062

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    675828.75         38   .00005623   .0000409    .0000773
no drug

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    259777.75         10   .00003849   .0000207    .0000715
sotrovimab

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262938         11   .00004183   .0000232    .0000755
paxlovid

         failure _d:  fail_pre_ra_serious == 1
   analysis time _t:  (stop_pre_ra_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    264995.75         13   .00004906   .0000285    .0000845
molnupavir

                id:  patient_id
     failure event:  fail_pre_sle_serious == 1
obs. time interval:  (stop_pre_sle_serious[_n-1], stop_pre_sle_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,155  event time missing (stop_pre_sle_serious>=.)       PROBABLE ERROR
        545  ignored because never entered
        751  observations end on or before enter()
------------------------------------------------------------------------------
     50,476  observations remaining, representing
     50,476  subjects
         87  failures in single-failure-per-subject data
  1,462,530  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1462529.8         87   .00005949   .0000482    .0000734

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       675917         35   .00005178   .0000372    .0000721
no drug

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259696         18   .00006931   .0000437      .00011
sotrovimab

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262180.75         19   .00007247   .0000462    .0001136
paxlovid

         failure _d:  fail_pre_sle_serious == 1
   analysis time _t:  (stop_pre_sle_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264736         15   .00005666   .0000342     .000094
molnupavir

                id:  patient_id
     failure event:  fail_pre_psorasis_serious == 1
obs. time interval:  (stop_pre_psorasis_serious[_n-1], stop_pre_psorasis_seriou
> s]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,208  event time missing (stop_pre_psorasis_serious>=.)  PROBABLE ERROR
        492  ignored because never entered
        727  observations end on or before enter()
------------------------------------------------------------------------------
     50,500  observations remaining, representing
     50,500  subjects
         65  failures in single-failure-per-subject data
  1,463,640  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463639.5         65   .00004441   .0000348    .0000566

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    676472.75         25   .00003696    .000025    .0000547
no drug

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259660         14   .00005392   .0000319     .000091
sotrovimab

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262939          8   .00003043   .0000152    .0000608
paxlovid

         failure _d:  fail_pre_psorasis_serious == 1
   analysis time _t:  (stop_pre_psorasis_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    264567.75         18   .00006804   .0000429     .000108
molnupavir

                id:  patient_id
     failure event:  fail_pre_psa_serious == 1
obs. time interval:  (stop_pre_psa_serious[_n-1], stop_pre_psa_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,194  event time missing (stop_pre_psa_serious>=.)       PROBABLE ERROR
        506  ignored because never entered
        705  observations end on or before enter()
------------------------------------------------------------------------------
     50,522  observations remaining, representing
     50,522  subjects
         58  failures in single-failure-per-subject data
  1,464,365  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1464364.8         58   .00003961   .0000306    .0000512

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    676549.75         25   .00003695    .000025    .0000547
no drug

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       259669          9   .00003466    .000018    .0000666
sotrovimab

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       263248         13   .00004938   .0000287     .000085
paxlovid

         failure _d:  fail_pre_psa_serious == 1
   analysis time _t:  (stop_pre_psa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       264898         11   .00004153    .000023     .000075
molnupavir

                id:  patient_id
     failure event:  fail_pre_axspa_serious == 1
obs. time interval:  (stop_pre_axspa_serious[_n-1], stop_pre_axspa_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,212  event time missing (stop_pre_axspa_serious>=.)     PROBABLE ERROR
        488  ignored because never entered
        713  observations end on or before enter()
------------------------------------------------------------------------------
     50,514  observations remaining, representing
     50,514  subjects
         55  failures in single-failure-per-subject data
  1,464,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1464043.3         55   .00003757   .0000288    .0000489

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    676709.75         25   .00003694    .000025    .0000547
no drug

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    259960.75          7   .00002693   .0000128    .0000565
sotrovimab

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    262262.75         18   .00006863   .0000432    .0001089
paxlovid

         failure _d:  fail_pre_axspa_serious == 1
   analysis time _t:  (stop_pre_axspa_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       265110          5   .00001886   7.85e-06    .0000453
molnupavir

                id:  patient_id
     failure event:  fail_pre_ibd_serious == 1
obs. time interval:  (stop_pre_ibd_serious[_n-1], stop_pre_ibd_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,192  event time missing (stop_pre_ibd_serious>=.)       PROBABLE ERROR
        508  ignored because never entered
        727  observations end on or before enter()
------------------------------------------------------------------------------
     50,500  observations remaining, representing
     50,500  subjects
         68  failures in single-failure-per-subject data
  1,463,494  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1463493.5         68   .00004646   .0000366    .0000589

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       675804         33   .00004883   .0000347    .0000687
no drug

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       260013          9   .00003461    .000018    .0000665
sotrovimab

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       262909         12   .00004564   .0000259    .0000804
paxlovid

         failure _d:  fail_pre_ibd_serious == 1
   analysis time _t:  (stop_pre_ibd_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     264767.5         14   .00005288   .0000313    .0000893
molnupavir

                id:  patient_id
     failure event:  fail_pre_all == 1
obs. time interval:  (stop_pre_all[_n-1], stop_pre_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,700  ignored because never entered
------------------------------------------------------------------------------
     51,227  observations remaining, representing
     51,227  subjects
          0  failures in single-failure-per-subject data
  1,485,583  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1485583          0           0          .           .

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       686488          0           0          .           .
no drug

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       263494          0           0          .           .
sotrovimab

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       266858          0           0          .           .
paxlovid

         failure _d:  fail_pre_all == 1
   analysis time _t:  (stop_pre_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       268743          0           0          .           .
molnupavir

                id:  patient_id
     failure event:  fail_pre_all_serious == 1
obs. time interval:  (stop_pre_all_serious[_n-1], stop_pre_all_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      5,700  ignored because never entered
------------------------------------------------------------------------------
     51,227  observations remaining, representing
     51,227  subjects
          0  failures in single-failure-per-subject data
  1,485,583  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1485583          0           0          .           .

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       686488          0           0          .           .
no drug

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       263494          0           0          .           .
sotrovimab

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       266858          0           0          .           .
paxlovid

         failure _d:  fail_pre_all_serious == 1
   analysis time _t:  (stop_pre_all_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       268743          0           0          .           .
molnupavir

                id:  patient_id
     failure event:  fail_pre_spc_all == 1
obs. time interval:  (stop_pre_spc_all[_n-1], stop_pre_spc_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
        208  event time missing (stop_pre_spc_all>=.)           PROBABLE ERROR
      5,492  ignored because never entered
     15,501  observations end on or before enter()
------------------------------------------------------------------------------
     35,726  observations remaining, representing
     35,726  subjects
      1,194  failures in single-failure-per-subject data
  1,018,504  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1018504       1194   .00117231   .0011077    .0012407

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    469758.25        537   .00114314   .0010504     .001244
no drug

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    182040.75        238    .0013074   .0011514    .0014845
sotrovimab

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    182299.25        203   .00111355   .0009704    .0012778
paxlovid

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    184405.75        216   .00117133   .0010251    .0013384
molnupavir

                id:  patient_id
     failure event:  fail_pre_spc_serious == 1
obs. time interval:  (stop_pre_spc_serious[_n-1], stop_pre_spc_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      1,773  event time missing (stop_pre_spc_serious>=.)       PROBABLE ERROR
      3,927  ignored because never entered
      7,478  observations end on or before enter()
------------------------------------------------------------------------------
     43,749  observations remaining, representing
     43,749  subjects
        625  failures in single-failure-per-subject data
  1,259,714  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1259714.3        625   .00049614   .0004587    .0005366

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       581819        297   .00051047   .0004556     .000572
no drug

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    223792.25        115   .00051387    .000428    .0006169
sotrovimab

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    226533.75         98   .00043261   .0003549    .0005273
paxlovid

         failure _d:  fail_pre_spc_serious == 1
   analysis time _t:  (stop_pre_spc_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    227569.25        115   .00050534   .0004209    .0006067
molnupavir

                id:  patient_id
     failure event:  fail_pre_drug_all == 1
obs. time interval:  (stop_pre_drug_all[_n-1], stop_pre_drug_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      2,267  event time missing (stop_pre_drug_all>=.)          PROBABLE ERROR
      3,433  ignored because never entered
      4,599  observations end on or before enter()
------------------------------------------------------------------------------
     46,628  observations remaining, representing
     46,628  subjects
        417  failures in single-failure-per-subject data
  1,346,038  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1346037.5        417    .0003098   .0002814     .000341

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     622442.5        184   .00029561   .0002558    .0003416
no drug

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     238931.5         93   .00038923   .0003176     .000477
sotrovimab

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     242109.5         69     .000285   .0002251    .0003608
paxlovid

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       242554         71   .00029272    .000232    .0003694
molnupavir

                id:  patient_id
     failure event:  fail_pre_drug_serious == 1
obs. time interval:  (stop_pre_drug_serious[_n-1], stop_pre_drug_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      4,211  event time missing (stop_pre_drug_serious>=.)      PROBABLE ERROR
      1,489  ignored because never entered
      2,399  observations end on or before enter()
------------------------------------------------------------------------------
     48,828  observations remaining, representing
     48,828  subjects
        222  failures in single-failure-per-subject data
  1,412,710  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1412709.5        222   .00015714   .0001378    .0001792

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    652558.25         98   .00015018   .0001232    .0001831
no drug

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       250882         49   .00019531   .0001476    .0002584
sotrovimab

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     253900.5         37   .00014573   .0001056    .0002011
paxlovid

         failure _d:  fail_pre_drug_serious == 1
   analysis time _t:  (stop_pre_drug_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    255368.75         38    .0001488   .0001083    .0002045
molnupavir

                id:  patient_id
     failure event:  fail_pre_imae_all == 1
obs. time interval:  (stop_pre_imae_all[_n-1], stop_pre_imae_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      1,054  event time missing (stop_pre_imae_all>=.)          PROBABLE ERROR
      4,646  ignored because never entered
      7,888  observations end on or before enter()
------------------------------------------------------------------------------
     43,339  observations remaining, representing
     43,339  subjects
        695  failures in single-failure-per-subject data
  1,247,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      1247053        695   .00055731   .0005174    .0006003

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    576440.75        318   .00055166   .0004942    .0006158
no drug

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     222197.5        127   .00057156   .0004803    .0006801
sotrovimab

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     222862.5        125   .00056088   .0004707    .0006684
paxlovid

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    225552.25        125    .0005542   .0004651    .0006604
molnupavir

                id:  patient_id
     failure event:  fail_pre_imae_serious == 1
obs. time interval:  (stop_pre_imae_serious[_n-1], stop_pre_imae_serious]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     56,927  total observations
      3,214  event time missing (stop_pre_imae_serious>=.)      PROBABLE ERROR
      2,486  ignored because never entered
      4,138  observations end on or before enter()
------------------------------------------------------------------------------
     47,089  observations remaining, representing
     47,089  subjects
        381  failures in single-failure-per-subject data
  1,360,210  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    1360210.3        381    .0002801   .0002533    .0003097

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |    627804.25        172   .00027397   .0002359    .0003181
no drug

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     242266.5         66   .00027243    .000214    .0003468
sotrovimab

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     243472.5         71   .00029161   .0002311     .000368
paxlovid

         failure _d:  fail_pre_imae_serious == 1
   analysis time _t:  (stop_pre_imae_serious-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
  exit on or before:  time start_comparator_28
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       246667         72   .00029189   .0002317    .0003677
molnupavir

. postclose `comparator_rates'

. use "$projectdir/output/tables/comparator_rates", clear

. order failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates", replace
file /workspace/output/tables/comparator_rates.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates.csv", repl
> ace
(note: file /workspace/output/tables/comparator_rates.csv not found)
file /workspace/output/tables/comparator_rates.csv saved

. 
. ** Redact and round rates
. use "$projectdir/output/tables/comparator_rates", clear

. foreach var of varlist *events *ptime  {
  2. gen `var'_midpoint = (ceil(`var'/6)*6) - (floor(6/2) * (`var'!=0))
  3. }

. foreach var in all control sot pax mol {
  2. gen `var'_rate_midpoint = (`var'_events_midpoint/`var'_ptime_midpoint)*100
> 0
  3. gen `var'_lci_midpoint = (invpoisson(`var'_events_midpoint,.975)/`var'_pti
> me_midpoint)*1000
  4. gen `var'_uci_midpoint = (invpoisson(`var'_events_midpoint,.025)/`var'_pti
> me_midpoint)*1000
  5. }  

. keep failure *_midpoint

. order   failure all* control* sot* pax* mol* 

. save "$projectdir/output/tables/comparator_rates_round", replace
file /workspace/output/tables/comparator_rates_round.dta saved

. export delimited using "$projectdir/output/tables/comparator_rates_round.csv"
> , replace
(note: file /workspace/output/tables/comparator_rates_round.csv not found)
file /workspace/output/tables/comparator_rates_round.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 closed on:   1 Nov 2023, 14:11:03
-------------------------------------------------------------------------------
