-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 opened on:  16 Aug 2023, 09:07:15

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /* 
> ===========================================================*/
. 
. *       COMPARATOR RATE         
. ****************************
. **generate rate for adverse outcome in year 3-4 prior to start date for compa
> rative rate by person years 
. *ensure not established diagnosis for some of the condition 4 year prior
. gen new_pre_ra_icd = pre_rheumatoid_icd_prim if pre_ra_snomed_new==0 
(22,510 missing values generated)

. gen new_pre_ra_ae = pre_rheumatoid_arthritis_ae if pre_ra_snomed_new==0 
(22,531 missing values generated)

. gen new_pre_ra_snomed = pre_rheumatoid_arthritis_snomed if pre_ra_snomed_new=
> =0 
(22,519 missing values generated)

. gen new_pre_sle_ctv = pre_sle_ctv if pre_sle_ctv_new==0 
(22,578 missing values generated)

. gen new_pre_sle_icd = pre_sle_icd_prim if pre_sle_ctv_new==0 
(22,597 missing values generated)

. gen new_pre_sle_ae = pre_sle_ae if pre_sle_ctv_new==0 
(22,527 missing values generated)

. gen new_pre_psoriasis_icd = pre_psoriasis_icd_prim if pre_psoriasis_snomed_ne
> w==0 
(22,601 missing values generated)

. gen new_pre_psoriasis_snomed = pre_psoriasis_snomed if pre_psoriasis_snomed_n
> ew==0 
(22,570 missing values generated)

. gen new_pre_psoriasis_ae = pre_psoriasis_ae if pre_psoriasis_snomed_new==0
(22,593 missing values generated)

. gen new_pre_psa_icd = pre_psa_icd_prim if pre_psa_snomed_new==0
(22,539 missing values generated)

. gen new_pre_psa_ae = pre_psa_ae if pre_psa_snomed_new==0 
(22,525 missing values generated)

. gen new_pre_psa_snomed = pre_psa_snomed if pre_psa_snomed_new==0 
(22,557 missing values generated)

. gen new_pre_axspa_icd = pre_axspa_icd_prim if pre_axspa_ctv_new==0
(22,590 missing values generated)

. gen new_pre_axspa_ctv = pre_axspa_ctv if pre_axspa_ctv_new==0 
(22,555 missing values generated)

. gen new_pre_axspa_ae = pre_axspa_ae if pre_axspa_ctv_new==0
(22,584 missing values generated)

. gen new_pre_ibd_icd = pre_ibd_icd_prim if pre_ibd_ctv_new==0
(22,588 missing values generated)

. gen new_pre_ibd_ctv = pre_ibd_ctv if pre_ibd_ctv_new==0
(22,592 missing values generated)

. gen new_pre_ibd_ae = pre_ibd_ae if pre_ibd_ctv_new==0
(22,539 missing values generated)

. 
. *** combined ae from GP, hosp and A&E
. egen pre_diverticulitis = rmin(pre_diverticulitis_icd_prim pre_diverticulitis
> _snomed pre_diverticulitis_ae)      
(18107 missing values generated)

. egen pre_diarrhoea = rmin(pre_diarrhoea_icd_prim pre_diarrhoea_snomed  pre_di
> arrhoeal_icd_prim)
(18063 missing values generated)

. egen pre_taste = rmin(pre_taste_icd_prim pre_taste_snomed )
(20060 missing values generated)

. egen pre_rash = rmin(pre_rash_icd_prim pre_rash_snomed pre_rash_ae)
(18113 missing values generated)

. egen pre_anaphylaxis = rmin(pre_anaphylaxis_icd_prim pre_anaphylaxis_snomed  
>    pre_anaphlaxis_ae)
(18070 missing values generated)

. egen pre_severe_drug = rmin(pre_severedrug_icd_prim pre_severedrug_sjs_icd_pr
> im pre_severedrug_snomed pre_severedrug_ae)
(16259 missing values generated)

. egen pre_nonsevere_drug = rmin(pre_nonsevere_drug_snomed pre_nonsevere_drug_a
> e)
(20044 missing values generated)

. egen pre_ra = rmin(new_pre_ra_icd new_pre_ra_ae new_pre_ra_snomed )
(18631 missing values generated)

. egen pre_sle = rmin(new_pre_sle_icd new_pre_sle_ctv new_pre_sle_ae)
(18745 missing values generated)

. egen pre_psorasis = rmin(new_pre_psoriasis_icd new_pre_psoriasis_snomed  new_
> pre_psoriasis_ae)
(18821 missing values generated)

. egen pre_psa = rmin(new_pre_psa_icd new_pre_psa_ae new_pre_psa_snomed)
(18709 missing values generated)

. egen pre_axspa = rmin(new_pre_axspa_icd  new_pre_axspa_ae new_pre_axspa_ctv)
(18793 missing values generated)

. egen pre_ibd = rmin(new_pre_ibd_icd new_pre_ibd_ctv new_pre_ibd_ae)
(18763 missing values generated)

. egen pre_spc_all = rmin(pre_diverticulitis pre_diarrhoea pre_taste) 
(10694 missing values generated)

. egen pre_drug_all = rmin(pre_anaphylaxis pre_rash pre_severe_drug pre_nonseve
> re_drug)
(6959 missing values generated)

. egen pre_imae_all = rmin(pre_ra pre_sle pre_psorasis pre_psa pre_axspa pre_ib
> d) 
(4637 missing values generated)

. egen pre_ae_all = rmin(pre_spc_all pre_drug_all pre_imae_all)
(550 missing values generated)

. 
. global pre_ae_group                     pre_spc_all                          
>            ///
>                                                         pre_drug_all         
>                            ///             
>                                                         pre_imae_all         
>                            ///                             
>                                                         pre_ae_all

. global pre_ae_disease           pre_diverticulitis                           
>    ///
>                                                         pre_diarrhoea        
>                            ///
>                                                         pre_taste            
>                                    ///
>                                                         pre_anaphylaxis      
>                            ///
>                                                         pre_rash             
>                                    ///
>                                                         pre_severe_drug      
>                            ///
>                                                         pre_nonsevere_drug   
>                            ///
>                                                         pre_ra               
>                                    ///
>                                                         pre_sle              
>                                    ///
>                                                         pre_psorasis         
>                            ///
>                                                         pre_psa              
>                                    ///
>                                                         pre_axspa            
>                                    ///
>                                                         pre_ibd              
>    

. 
. *gen start date for comparator rate
. gen start_comparator = start_date-1460

. gen start_comparator_28 = start_date - 1431

. *remove if occurred outside of window, gen failure and stop date: 
. foreach x in $pre_ae_group $pre_ae_disease {
  2.                 display "`x'"
  3.                 count if `x'!=. 
  4.                 count if (`x'<start_comparator | `x'>start_comparator_28) 
> & `x'!=.  // event outside windown - should be 0 
  5.                 count if (`x'>start_comparator & `x'<start_comparator_28) 
> & `x'!=.  // event 4-3 years prior to start
  6.                 gen fail_`x'=1 if `x'!=.
  7.                 tab drug fail_`x', m
  8.                 gen stop_`x'=`x' if fail_`x'==1
  9.                 replace `x'=`x'+0.75 if `x'==start_date
 10.                 replace stop_`x'= start_comparator_28 if fail_`x'==.
 11.                 tab drug fail_`x' if stop_`x'!=.
 12.                 format %td stop_`x'
 13. }
pre_spc_all
  14,094
  13,854
  222
(10,694 missing values generated)

             |   fail_pre_spc_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    13,613     10,300 |    23,913 
  sotrovimab |       169        139 |       308 
    paxlovid |       168        125 |       293 
molnupiravir |       144        130 |       274 
-------------+----------------------+----------
       Total |    14,094     10,694 |    24,788 
(10,694 missing values generated)
(7 real changes made)
(10,694 real changes made)

             | fail_pre_s
             |   pc_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    13,613 |    13,613 
  sotrovimab |       169 |       169 
    paxlovid |       168 |       168 
molnupiravir |       144 |       144 
-------------+-----------+----------
       Total |    14,094 |    14,094 
pre_drug_all
  17,829
  17,607
  212
(6,959 missing values generated)

             |   fail_pre_drug_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    17,202      6,711 |    23,913 
  sotrovimab |       219         89 |       308 
    paxlovid |       211         82 |       293 
molnupiravir |       197         77 |       274 
-------------+----------------------+----------
       Total |    17,829      6,959 |    24,788 
(6,959 missing values generated)
(9 real changes made)
(6,959 real changes made)

             | fail_pre_d
             |  rug_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    17,202 |    17,202 
  sotrovimab |       219 |       219 
    paxlovid |       211 |       211 
molnupiravir |       197 |       197 
-------------+-----------+----------
       Total |    17,829 |    17,829 
pre_imae_all
  20,151
  19,826
  296
(4,637 missing values generated)

             |   fail_pre_imae_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    19,418      4,495 |    23,913 
  sotrovimab |       261         47 |       308 
    paxlovid |       247         46 |       293 
molnupiravir |       225         49 |       274 
-------------+----------------------+----------
       Total |    20,151      4,637 |    24,788 
(4,637 missing values generated)
(12 real changes made)
(4,637 real changes made)

             | fail_pre_i
             |  mae_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    19,418 |    19,418 
  sotrovimab |       261 |       261 
    paxlovid |       247 |       247 
molnupiravir |       225 |       225 
-------------+-----------+----------
       Total |    20,151 |    20,151 
pre_ae_all
  24,238
  23,607
  584
(550 missing values generated)

             |    fail_pre_ae_all
        drug |         1          . |     Total
-------------+----------------------+----------
     control |    23,377        536 |    23,913 
  sotrovimab |       303          5 |       308 
    paxlovid |       289          4 |       293 
molnupiravir |       269          5 |       274 
-------------+----------------------+----------
       Total |    24,238        550 |    24,788 
(550 missing values generated)
(3 real changes made)
(550 real changes made)

             | fail_pre_a
             |   e_all
        drug |         1 |     Total
-------------+-----------+----------
     control |    23,377 |    23,377 
  sotrovimab |       303 |       303 
    paxlovid |       289 |       289 
molnupiravir |       269 |       269 
-------------+-----------+----------
       Total |    24,238 |    24,238 
pre_diverticulitis
  6,681
  6,603
  75
(18,107 missing values generated)

             | fail_pre_diverticulit
             |          is
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,443     17,470 |    23,913 
  sotrovimab |        79        229 |       308 
    paxlovid |        88        205 |       293 
molnupiravir |        71        203 |       274 
-------------+----------------------+----------
       Total |     6,681     18,107 |    24,788 
(18,107 missing values generated)
(6 real changes made)
(18,107 real changes made)

             | fail_pre_d
             | iverticuli
             |    tis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,443 |     6,443 
  sotrovimab |        79 |        79 
    paxlovid |        88 |        88 
molnupiravir |        71 |        71 
-------------+-----------+----------
       Total |     6,681 |     6,681 
pre_diarrhoea
  6,725
  6,618
  98
(18,063 missing values generated)

             |  fail_pre_diarrhoea
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,492     17,421 |    23,913 
  sotrovimab |        83        225 |       308 
    paxlovid |        82        211 |       293 
molnupiravir |        68        206 |       274 
-------------+----------------------+----------
       Total |     6,725     18,063 |    24,788 
(18,063 missing values generated)
(1 real change made)
(18,063 real changes made)

             | fail_pre_d
             |  iarrhoea
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,492 |     6,492 
  sotrovimab |        83 |        83 
    paxlovid |        82 |        82 
molnupiravir |        68 |        68 
-------------+-----------+----------
       Total |     6,725 |     6,725 
pre_taste
  4,728
  4,653
  69
(20,060 missing values generated)

             |    fail_pre_taste
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,575     19,338 |    23,913 
  sotrovimab |        55        253 |       308 
    paxlovid |        56        237 |       293 
molnupiravir |        42        232 |       274 
-------------+----------------------+----------
       Total |     4,728     20,060 |    24,788 
(20,060 missing values generated)
(1 real change made)
(20,060 real changes made)

             | fail_pre_t
             |    aste
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,575 |     4,575 
  sotrovimab |        55 |        55 
    paxlovid |        56 |        56 
molnupiravir |        42 |        42 
-------------+-----------+----------
       Total |     4,728 |     4,728 
pre_anaphylaxis
  6,718
  6,647
  67
(18,070 missing values generated)

             | fail_pre_anaphylaxis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,467     17,446 |    23,913 
  sotrovimab |        91        217 |       308 
    paxlovid |        82        211 |       293 
molnupiravir |        78        196 |       274 
-------------+----------------------+----------
       Total |     6,718     18,070 |    24,788 
(18,070 missing values generated)
(5 real changes made)
(18,070 real changes made)

             | fail_pre_a
             | naphylaxis
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,467 |     6,467 
  sotrovimab |        91 |        91 
    paxlovid |        82 |        82 
molnupiravir |        78 |        78 
-------------+-----------+----------
       Total |     6,718 |     6,718 
pre_rash
  6,675
  6,616
  57
(18,113 missing values generated)

             |     fail_pre_rash
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     6,433     17,480 |    23,913 
  sotrovimab |        88        220 |       308 
    paxlovid |        83        210 |       293 
molnupiravir |        71        203 |       274 
-------------+----------------------+----------
       Total |     6,675     18,113 |    24,788 
(18,113 missing values generated)
(6 real changes made)
(18,113 real changes made)

             | fail_pre_r
             |    ash
        drug |         1 |     Total
-------------+-----------+----------
     control |     6,433 |     6,433 
  sotrovimab |        88 |        88 
    paxlovid |        83 |        83 
molnupiravir |        71 |        71 
-------------+-----------+----------
       Total |     6,675 |     6,675 
pre_severe_drug
  8,529
  8,439
  88
(16,259 missing values generated)

             | fail_pre_severe_drug
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     8,243     15,670 |    23,913 
  sotrovimab |        96        212 |       308 
    paxlovid |        94        199 |       293 
molnupiravir |        96        178 |       274 
-------------+----------------------+----------
       Total |     8,529     16,259 |    24,788 
(16,259 missing values generated)
(3 real changes made)
(16,259 real changes made)

             | fail_pre_s
             | evere_drug
        drug |         1 |     Total
-------------+-----------+----------
     control |     8,243 |     8,243 
  sotrovimab |        96 |        96 
    paxlovid |        94 |        94 
molnupiravir |        96 |        96 
-------------+-----------+----------
       Total |     8,529 |     8,529 
pre_nonsevere_drug
  4,744
  4,716
  25
(20,044 missing values generated)

             | fail_pre_nonsevere_dr
             |          ug
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     4,582     19,331 |    23,913 
  sotrovimab |        61        247 |       308 
    paxlovid |        56        237 |       293 
molnupiravir |        45        229 |       274 
-------------+----------------------+----------
       Total |     4,744     20,044 |    24,788 
(20,044 missing values generated)
(6 real changes made)
(20,044 real changes made)

             | fail_pre_n
             | onsevere_d
             |    rug
        drug |         1 |     Total
-------------+-----------+----------
     control |     4,582 |     4,582 
  sotrovimab |        61 |        61 
    paxlovid |        56 |        56 
molnupiravir |        45 |        45 
-------------+-----------+----------
       Total |     4,744 |     4,744 
pre_ra
  6,157
  6,094
  56
(18,631 missing values generated)

             |      fail_pre_ra
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,940     17,973 |    23,913 
  sotrovimab |        79        229 |       308 
    paxlovid |        80        213 |       293 
molnupiravir |        58        216 |       274 
-------------+----------------------+----------
       Total |     6,157     18,631 |    24,788 
(18,631 missing values generated)
(5 real changes made)
(18,631 real changes made)

             | fail_pre_r
             |     a
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,940 |     5,940 
  sotrovimab |        79 |        79 
    paxlovid |        80 |        80 
molnupiravir |        58 |        58 
-------------+-----------+----------
       Total |     6,157 |     6,157 
pre_sle
  6,043
  5,976
  61
(18,745 missing values generated)

             |     fail_pre_sle
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,818     18,095 |    23,913 
  sotrovimab |        80        228 |       308 
    paxlovid |        72        221 |       293 
molnupiravir |        73        201 |       274 
-------------+----------------------+----------
       Total |     6,043     18,745 |    24,788 
(18,745 missing values generated)
(7 real changes made)
(18,745 real changes made)

             | fail_pre_s
             |     le
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,818 |     5,818 
  sotrovimab |        80 |        80 
    paxlovid |        72 |        72 
molnupiravir |        73 |        73 
-------------+-----------+----------
       Total |     6,043 |     6,043 
pre_psorasis
  5,967
  5,892
  70
(18,821 missing values generated)

             |   fail_pre_psorasis
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,752     18,161 |    23,913 
  sotrovimab |        81        227 |       308 
    paxlovid |        72        221 |       293 
molnupiravir |        62        212 |       274 
-------------+----------------------+----------
       Total |     5,967     18,821 |    24,788 
(18,821 missing values generated)
(3 real changes made)
(18,821 real changes made)

             | fail_pre_p
             |  sorasis
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,752 |     5,752 
  sotrovimab |        81 |        81 
    paxlovid |        72 |        72 
molnupiravir |        62 |        62 
-------------+-----------+----------
       Total |     5,967 |     5,967 
pre_psa
  6,079
  6,014
  58
(18,709 missing values generated)

             |     fail_pre_psa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,841     18,072 |    23,913 
  sotrovimab |        76        232 |       308 
    paxlovid |        94        199 |       293 
molnupiravir |        68        206 |       274 
-------------+----------------------+----------
       Total |     6,079     18,709 |    24,788 
(18,709 missing values generated)
(5 real changes made)
(18,709 real changes made)

             | fail_pre_p
             |     sa
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,841 |     5,841 
  sotrovimab |        76 |        76 
    paxlovid |        94 |        94 
molnupiravir |        68 |        68 
-------------+-----------+----------
       Total |     6,079 |     6,079 
pre_axspa
  5,995
  5,950
  41
(18,793 missing values generated)

             |    fail_pre_axspa
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,794     18,119 |    23,913 
  sotrovimab |        70        238 |       308 
    paxlovid |        59        234 |       293 
molnupiravir |        72        202 |       274 
-------------+----------------------+----------
       Total |     5,995     18,793 |    24,788 
(18,793 missing values generated)
(8 real changes made)
(18,793 real changes made)

             | fail_pre_a
             |    xspa
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,794 |     5,794 
  sotrovimab |        70 |        70 
    paxlovid |        59 |        59 
molnupiravir |        72 |        72 
-------------+-----------+----------
       Total |     5,995 |     5,995 
pre_ibd
  6,025
  5,964
  55
(18,763 missing values generated)

             |     fail_pre_ibd
        drug |         1          . |     Total
-------------+----------------------+----------
     control |     5,809     18,104 |    23,913 
  sotrovimab |        84        224 |       308 
    paxlovid |        66        227 |       293 
molnupiravir |        66        208 |       274 
-------------+----------------------+----------
       Total |     6,025     18,763 |    24,788 
(18,763 missing values generated)
(5 real changes made)
(18,763 real changes made)

             | fail_pre_i
             |     bd
        drug |         1 |     Total
-------------+-----------+----------
     control |     5,809 |     5,809 
  sotrovimab |        84 |        84 
    paxlovid |        66 |        66 
molnupiravir |        66 |        66 
-------------+-----------+----------
       Total |     6,025 |     6,025 

. 
. * Follow-up time
. stset stop_pre_ae_all, id(patient_id) origin(time start_comparator) enter(tim
> e start_comparator) exit(time start_comparator_28) failure(fail_pre_ae_all==1
> ) 

                id:  patient_id
     failure event:  fail_pre_ae_all == 1
obs. time interval:  (stop_pre_ae_all[_n-1], stop_pre_ae_all]
 enter on or after:  time start_comparator
 exit on or before:  time start_comparator_28
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      7,375  observations end on or before enter()
------------------------------------------------------------------------------
     17,413  observations remaining, representing
     17,413  subjects
        610  failures in single-failure-per-subject data
    496,480  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        29

. tab _st  // keep if _st==1 -> removes observations that end on or before ente
> r 

1 if record |
   is to be |
    used; 0 |
  otherwise |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,375       29.75       29.75
          1 |     17,413       70.25      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. count if start_comparator>=stop_pre_ae_all & _st==0
  7,375

. count if start_comparator==stop_pre_ae_all & _st==0
  21

. tab _t,m

   analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         22        0.09        0.09
          2 |         17        0.07        0.16
          3 |         26        0.10        0.26
          4 |         20        0.08        0.34
          5 |         28        0.11        0.46
          6 |         17        0.07        0.52
          7 |         29        0.12        0.64
          8 |         17        0.07        0.71
          9 |         18        0.07        0.78
         10 |         17        0.07        0.85
         11 |         15        0.06        0.91
         12 |         23        0.09        1.00
         13 |         21        0.08        1.09
         14 |         21        0.08        1.17
         15 |         19        0.08        1.25
         16 |         22        0.09        1.34
         17 |         20        0.08        1.42
         18 |         26        0.10        1.52
         19 |         24        0.10        1.62
         20 |         20        0.08        1.70
         21 |         14        0.06        1.76
         22 |         28        0.11        1.87
         23 |         14        0.06        1.93
         24 |         14        0.06        1.98
         25 |         21        0.08        2.07
         26 |         30        0.12        2.19
         27 |         18        0.07        2.26
         28 |         23        0.09        2.36
         29 |     16,829       67.89       70.25
          . |      7,375       29.75      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. 
. tempname comparator

. postfile `comparator' str20(failure) ///
>         ptime_all events_all rate_all /// 
>         ptime_control events_control rate_control /// 
>         ptime_sot events_sot rate_sot ///
>         ptime_pax events_pax rate_pax ///
>         ptime_mol events_mol rate_mol ///
>         using "$projectdir/output/tables/comparator_rate_summary", replace   
>    

.                                                  
. * Failures over 1 years - convert into 28 day rate
. foreach fail in $pre_ae_group $pre_ae_disease {
  2.                                                          
.         stset stop_`fail', id(patient_id) origin(time start_comparator) enter
> (time start_comparator) failure(fail_`fail'==1)    
  3.                 stptime 
  4.                                         local rate_all = `r(rate)'
  5.                                         local ptime_all = `r(ptime)'
  6.                                         local events_all .
  7.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_all `r(failures)'
  8.                 
.                 stptime if drug == 0
  9.                                         local rate_control = `r(rate)'
 10.                                         local ptime_control = `r(ptime)'
 11.                                         local events_control .
 12.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_control `r(failures)'
 13.                 display "no drug"
 14. 
.                 stptime if drug == 1
 15.                                         local rate_sot = `r(rate)'
 16.                                         local ptime_sot = `r(ptime)'
 17.                                         local events_sot .
 18.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_sot `r(failures)'
 19.                 display "sotrovimab"
 20.                 
.                 stptime if drug == 2
 21.                                         local rate_pax = `r(rate)'
 22.                                         local ptime_pax = `r(ptime)'
 23.                                         local events_pax .
 24.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_pax `r(failures)'
 25.                 display "paxlovid"
 26.                 
.                 stptime if drug == 3
 27.                                         local rate_mol = `r(rate)'
 28.                                         local ptime_mol = `r(ptime)'
 29.                                         local events_mol .
 30.                                                 if `r(failures)' == 0 | `r
> (failures)' > 5 local events_mol `r(failures)'
 31.                 display "molnupavir"
 32.                                                 
.                 post `comparator' ("`fail'") (`ptime_all') (`events_all') (`r
> ate_all') ///
>                                         (`ptime_control') (`events_control') 
> (`rate_control') ///
>                                         (`ptime_sot') (`events_sot') (`rate_s
> ot') ///
>                                         (`ptime_pax') (`events_pax') (`rate_p
> ax') ///
>                                         (`ptime_mol') (`events_mol') (`rate_m
> ol') 
 33.                                         
. }

                id:  patient_id
     failure event:  fail_pre_spc_all == 1
obs. time interval:  (stop_pre_spc_all[_n-1], stop_pre_spc_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      2,343  observations end on or before enter()
------------------------------------------------------------------------------
     22,445  observations remaining, representing
     22,445  subjects
     11,751  failures in single-failure-per-subject data
   10663494  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,041

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10663494      11751   .00110198   .0010822    .0011221

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10291664      11346   .00110245   .0010823    .0011229
no drug

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       138802        150   .00108068   .0009209    .0012682
sotrovimab

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       119781        134   .00111871   .0009445    .0013251
paxlovid

         failure _d:  fail_pre_spc_all == 1
   analysis time _t:  (stop_pre_spc_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       113247        121   .00106846   .0008941    .0012769
molnupavir

                id:  patient_id
     failure event:  fail_pre_drug_all == 1
obs. time interval:  (stop_pre_drug_all[_n-1], stop_pre_drug_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      2,626  observations end on or before enter()
------------------------------------------------------------------------------
     22,162  observations remaining, representing
     22,162  subjects
     15,203  failures in single-failure-per-subject data
   14781971  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,053

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14781971      15203   .00102848   .0010123     .001045

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14284765      14678   .00102753    .001011    .0010443
no drug

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       177391        183   .00103162   .0008925    .0011925
sotrovimab

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       164015        168    .0010243   .0008806    .0011915
paxlovid

         failure _d:  fail_pre_drug_all == 1
   analysis time _t:  (stop_pre_drug_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       155800        174   .00111682   .0009626    .0012957
molnupavir

                id:  patient_id
     failure event:  fail_pre_imae_all == 1
obs. time interval:  (stop_pre_imae_all[_n-1], stop_pre_imae_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      3,540  observations end on or before enter()
------------------------------------------------------------------------------
     21,248  observations remaining, representing
     21,248  subjects
     16,611  failures in single-failure-per-subject data
   15119317  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,049

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     15119317      16611   .00109866   .0010821    .0011155

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     14564025      16007   .00109908   .0010822    .0011162
no drug

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       190504        209   .00109709    .000958    .0012564
sotrovimab

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       195444        209   .00106936   .0009338    .0012246
paxlovid

         failure _d:  fail_pre_imae_all == 1
   analysis time _t:  (stop_pre_imae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       169344        186   .00109836   .0009513    .0012681
molnupavir

                id:  patient_id
     failure event:  fail_pre_ae_all == 1
obs. time interval:  (stop_pre_ae_all[_n-1], stop_pre_ae_all]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      7,375  observations end on or before enter()
------------------------------------------------------------------------------
     17,413  observations remaining, representing
     17,413  subjects
     16,863  failures in single-failure-per-subject data
   10765374  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,036

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10765374      16863   .00156641   .0015429    .0015902

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |     10379403      16264   .00156695   .0015431    .0015912
no drug

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       137369        208   .00151417   .0013218    .0017346
sotrovimab

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       125837        195   .00154962   .0013467    .0017831
paxlovid

         failure _d:  fail_pre_ae_all == 1
   analysis time _t:  (stop_pre_ae_all-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |       122765        196   .00159655    .001388    .0018365
molnupavir

                id:  patient_id
     failure event:  fail_pre_diverticulitis == 1
obs. time interval:  (stop_pre_diverticulitis[_n-1], stop_pre_diverticulitis]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        642  observations end on or before enter()
------------------------------------------------------------------------------
     24,146  observations remaining, representing
     24,146  subjects
      6,039  failures in single-failure-per-subject data
  7,063,356  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,041

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7063356       6039   .00085498   .0008337    .0008768

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6811329       5820   .00085446   .0008328    .0008767
no drug

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        84050         76   .00090422   .0007222    .0011322
sotrovimab

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        92299         78   .00084508   .0006769    .0010551
paxlovid

         failure _d:  fail_pre_diverticulitis == 1
   analysis time _t:  (stop_pre_diverticulitis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        75678         65    .0008589   .0006735    .0010953
molnupavir

                id:  patient_id
     failure event:  fail_pre_diarrhoea == 1
obs. time interval:  (stop_pre_diarrhoea[_n-1], stop_pre_diarrhoea]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      1,110  observations end on or before enter()
------------------------------------------------------------------------------
     23,678  observations remaining, representing
     23,678  subjects
      5,615  failures in single-failure-per-subject data
  5,407,481  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,057

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5407481       5615   .00103838   .0010116    .0010659

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5225365       5423   .00103782   .0010106    .0010658
no drug

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        62084         69    .0011114   .0008778    .0014072
sotrovimab

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        63599         65   .00102203   .0008015    .0013033
paxlovid

         failure _d:  fail_pre_diarrhoea == 1
   analysis time _t:  (stop_pre_diarrhoea-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        56433         58   .00102777   .0007946    .0013294
molnupavir

                id:  patient_id
     failure event:  fail_pre_taste == 1
obs. time interval:  (stop_pre_taste[_n-1], stop_pre_taste]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        697  observations end on or before enter()
------------------------------------------------------------------------------
     24,091  observations remaining, representing
     24,091  subjects
      4,031  failures in single-failure-per-subject data
  4,086,691  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,039

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      4086691       4031   .00098637   .0009564    .0010173

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      3940230       3896   .00098877   .0009582    .0010203
no drug

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        59827         52   .00086917   .0006623    .0011406
sotrovimab

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        48397         48    .0009918   .0007474    .0013161
paxlovid

         failure _d:  fail_pre_taste == 1
   analysis time _t:  (stop_pre_taste-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        38237         35   .00091534   .0006572    .0012749
molnupavir

                id:  patient_id
     failure event:  fail_pre_anaphylaxis == 1
obs. time interval:  (stop_pre_anaphylaxis[_n-1], stop_pre_anaphylaxis]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        682  observations end on or before enter()
------------------------------------------------------------------------------
     24,106  observations remaining, representing
     24,106  subjects
      6,036  failures in single-failure-per-subject data
  7,001,393  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,050

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7001393       6036   .00086211   .0008406    .0008841

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6750774       5815   .00086138   .0008395    .0008838
no drug

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        92002         80   .00086955   .0006984    .0010826
sotrovimab

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        83947         70   .00083386   .0006597     .001054
paxlovid

         failure _d:  fail_pre_anaphylaxis == 1
   analysis time _t:  (stop_pre_anaphylaxis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        74670         71   .00095085   .0007535    .0011999
molnupavir

                id:  patient_id
     failure event:  fail_pre_rash == 1
obs. time interval:  (stop_pre_rash[_n-1], stop_pre_rash]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     24,094  observations remaining, representing
     24,094  subjects
      5,981  failures in single-failure-per-subject data
  7,043,355  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,053

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7043355       5981   .00084917   .0008279     .000871

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6788750       5763    .0008489   .0008273    .0008711
no drug

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        95008         79   .00083151    .000667    .0010367
sotrovimab

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        87137         71   .00081481   .0006457    .0010282
paxlovid

         failure _d:  fail_pre_rash == 1
   analysis time _t:  (stop_pre_rash-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        72460         68   .00093845   .0007399    .0011902
molnupavir

                id:  patient_id
     failure event:  fail_pre_severe_drug == 1
obs. time interval:  (stop_pre_severe_drug[_n-1], stop_pre_severe_drug]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
      1,023  observations end on or before enter()
------------------------------------------------------------------------------
     23,765  observations remaining, representing
     23,765  subjects
      7,506  failures in single-failure-per-subject data
  8,034,627  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,046

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      8034627       7506   .00093421   .0009133    .0009556

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      7773808       7264   .00093442   .0009132    .0009562
no drug

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        91153         79   .00086667   .0006952    .0010805
sotrovimab

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        80984         78   .00096315   .0007715    .0012025
paxlovid

         failure _d:  fail_pre_severe_drug == 1
   analysis time _t:  (stop_pre_severe_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        88682         85   .00095848   .0007749    .0011855
molnupavir

                id:  patient_id
     failure event:  fail_pre_nonsevere_drug == 1
obs. time interval:  (stop_pre_nonsevere_drug[_n-1], stop_pre_nonsevere_drug]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        359  observations end on or before enter()
------------------------------------------------------------------------------
     24,429  observations remaining, representing
     24,429  subjects
      4,385  failures in single-failure-per-subject data
  5,871,077  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,052

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5871077       4385   .00074688   .0007251    .0007693

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      5672827       4236   .00074672   .0007246    .0007695
no drug

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        74418         58   .00077938   .0006025    .0010081
sotrovimab

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        63735         49   .00076881   .0005811    .0010172
paxlovid

         failure _d:  fail_pre_nonsevere_drug == 1
   analysis time _t:  (stop_pre_nonsevere_drug-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        60097         42   .00069887   .0005165    .0009457
molnupavir

                id:  patient_id
     failure event:  fail_pre_ra == 1
obs. time interval:  (stop_pre_ra[_n-1], stop_pre_ra]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        655  observations end on or before enter()
------------------------------------------------------------------------------
     24,133  observations remaining, representing
     24,133  subjects
      5,502  failures in single-failure-per-subject data
  6,457,188  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,049

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6457188       5502   .00085207   .0008299    .0008749

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6234789       5309   .00085151   .0008289    .0008747
no drug

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        72345         67   .00092612   .0007289    .0011767
sotrovimab

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        87949         74    .0008414     .00067    .0010567
paxlovid

         failure _d:  fail_pre_ra == 1
   analysis time _t:  (stop_pre_ra-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        62105         52   .00083729    .000638    .0010988
molnupavir

                id:  patient_id
     failure event:  fail_pre_sle == 1
obs. time interval:  (stop_pre_sle[_n-1], stop_pre_sle]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        648  observations end on or before enter()
------------------------------------------------------------------------------
     24,140  observations remaining, representing
     24,140  subjects
      5,395  failures in single-failure-per-subject data
  6,407,106  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,057

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6407106       5395   .00084203   .0008199    .0008648

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6174232       5197   .00084172   .0008191    .0008649
no drug

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        76318         69   .00090411   .0007141    .0011447
sotrovimab

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        82899         65   .00078409   .0006149    .0009999
paxlovid

         failure _d:  fail_pre_sle == 1
   analysis time _t:  (stop_pre_sle-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        73657         64   .00086889   .0006801    .0011101
molnupavir

                id:  patient_id
     failure event:  fail_pre_psorasis == 1
obs. time interval:  (stop_pre_psorasis[_n-1], stop_pre_psorasis]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        619  observations end on or before enter()
------------------------------------------------------------------------------
     24,169  observations remaining, representing
     24,169  subjects
      5,348  failures in single-failure-per-subject data
  6,332,214  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,057

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6332214       5348   .00084457   .0008222    .0008675

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6111269       5155   .00084352   .0008208    .0008669
no drug

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        83092         73   .00087854   .0006985    .0011051
sotrovimab

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        75261         62    .0008238   .0006423    .0010566
paxlovid

         failure _d:  fail_pre_psorasis == 1
   analysis time _t:  (stop_pre_psorasis-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        62592         58   .00092664   .0007164    .0011986
molnupavir

                id:  patient_id
     failure event:  fail_pre_psa == 1
obs. time interval:  (stop_pre_psa[_n-1], stop_pre_psa]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        663  observations end on or before enter()
------------------------------------------------------------------------------
     24,125  observations remaining, representing
     24,125  subjects
      5,416  failures in single-failure-per-subject data
  6,397,689  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,053

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6397689       5416   .00084656   .0008243    .0008694

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6157326       5208   .00084582   .0008232    .0008691
no drug

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        82843         66   .00079669   .0006259    .0010141
sotrovimab

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        91096         81   .00088917   .0007152    .0011055
paxlovid

         failure _d:  fail_pre_psa == 1
   analysis time _t:  (stop_pre_psa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        66424         61   .00091834   .0007145    .0011803
molnupavir

                id:  patient_id
     failure event:  fail_pre_axspa == 1
obs. time interval:  (stop_pre_axspa[_n-1], stop_pre_axspa]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        625  observations end on or before enter()
------------------------------------------------------------------------------
     24,163  observations remaining, representing
     24,163  subjects
      5,370  failures in single-failure-per-subject data
  6,379,450  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,044

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6379450       5370   .00084177   .0008195    .0008646

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6159881       5190   .00084255   .0008199    .0008658
no drug

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        78079         60   .00076845   .0005967    .0009897
sotrovimab

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        63831         54   .00084598   .0006479    .0011046
paxlovid

         failure _d:  fail_pre_axspa == 1
   analysis time _t:  (stop_pre_axspa-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        77659         66   .00084987   .0006677    .0010818
molnupavir

                id:  patient_id
     failure event:  fail_pre_ibd == 1
obs. time interval:  (stop_pre_ibd[_n-1], stop_pre_ibd]
 enter on or after:  time start_comparator
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time start_comparator

------------------------------------------------------------------------------
     24,788  total observations
        649  observations end on or before enter()
------------------------------------------------------------------------------
     24,139  observations remaining, representing
     24,139  subjects
      5,376  failures in single-failure-per-subject data
  6,458,565  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =     2,058

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6458565       5376   .00083238   .0008104    .0008549

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |      6228814       5183    .0008321   .0008098    .0008551
no drug

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        90125         76   .00084327   .0006735    .0010559
sotrovimab

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        73458         60   .00081679   .0006342     .001052
paxlovid

         failure _d:  fail_pre_ibd == 1
   analysis time _t:  (stop_pre_ibd-origin)
             origin:  time start_comparator
  enter on or after:  time start_comparator
                 id:  patient_id

Cohort     |  person-time   failures        rate   [95% Conf. Interval]
-----------+-----------------------------------------------------------
     total |        66168         57   .00086144   .0006645    .0011168
molnupavir

. 
. postclose `comparator'

. use "$projectdir/output/tables/comparator_rate_summary", replace

. export delimited using "$projectdir/output/tables/comparator_rate_summary_csv
> .csv", replace
(note: file /workspace/output/tables/comparator_rate_summary_csv.csv not found)
file /workspace/output/tables/comparator_rate_summary_csv.csv saved

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/preceed_rate.log
  log type:  text
 closed on:  16 Aug 2023, 09:07:40
-------------------------------------------------------------------------------
