--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely
> \Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/logs/ps_mod
> el.log
  log type:  text
 opened on:  22 Aug 2023, 21:04:15

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\Ope
> nSafely\Safety mAB and antivirals\Safety-Sotrovimab-Paxlovid-Molnupiravir/anal
> ysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. 
. * Models
. global agesex   age i.sex

. global adj              age i.sex i.region_nhs paxlovid_contraindicated ///
>                                 downs_syndrome solid_cancer haem_disease renal
> _disease liver_disease imid_on_drug immunosupression hiv_aids organ_transplant
>  rare_neuro  

. global fulladj1 age i.sex i.region_nhs paxlovid_contraindicated ///
>                                 downs_syndrome solid_cancer haem_disease renal
> _disease liver_disease imid_on_drug immunosupression hiv_aids organ_transplant
>  rare_neuro  ///
>                                 vaccination_status imdq5 White 

. global fulladj2 age i.sex i.region_nhs paxlovid_contraindicated ///
>                                 downs_syndrome solid_cancer haem_disease renal
> _disease liver_disease imid_on_drug immunosupression hiv_aids organ_transplant
>  rare_neuro  ///
>                                 vaccination_status imdq5 White 1b.bmi_group di
> abetes chronic_cardiac_disease chronic_respiratory_disease hypertension

.                                                                               
>           
. * Failures
. global ae_group                 ae_spc_all                                    
>   ///
>                                                 ae_drug_all                   
>                   ///             
>                                                 ae_imae_all                   
>           ///                             
>                                                 ae_all                        
>                   ///
>                                                 allcause_emerg_aande          
>   ///
>                                                 covid_hosp_date               
>           ///
>                                                 all_hosp_date                 
>           ///
>                                                 died_date_ons

. global ae_disease               ae_diverticulitis                             
>   ///
>                                                 ae_diarrhoea                  
>                   ///
>                                                 ae_taste                      
>                           ///
>                                                 ae_rash                       
>                           ///
>                                                 ae_anaphylaxis                
>                   ///
>                                                 ae_severe_drug                
>                   ///
>                                                 ae_nonsevere_drug             
>                   ///
>                                                 ae_ra                         
>                           ///
>                                                 ae_sle                        
>                           ///
>                                                 ae_psorasis                   
>                   ///
>                                                 ae_psa                        
>                           ///
>                                                 ae_axspa                      
>                           ///
>                                                 ae_ibd                        
>                                   

. 
end of do-file

. exit, clear
