-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotrovimab-
> Paxlovid-Molnupiravir/logs/ps_model.log
  log type:  text
 opened on:  18 May 2023, 15:29:07

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/ado"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSafely\Safety mAB and antivirals\Safety-Sotr
> ovimab-Paxlovid-Molnupiravir/analysis/ado"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
end of do-file

. mlogit drug age i.sex i.region_nhs drugs_consider_risk_contradowns_syndrome solid_cancer haem_disease renal_disease liver_d
> isease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro
drugs_consider_risk_contradowns_syndrome invalid name
r(198);

. mlogit drug age i.sex i.region_nhs drugs_consider_risk_contra downs_syndrome solid_cancer haem_disease renal_disease liver_
> disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro

Iteration 0:   log likelihood =  -1064.317  
Iteration 1:   log likelihood = -1041.8739  
Iteration 2:   log likelihood = -1036.7783  
Iteration 3:   log likelihood = -1036.5017  
Iteration 4:   log likelihood = -1036.4391  
Iteration 5:   log likelihood =  -1036.425  
Iteration 6:   log likelihood = -1036.4216  
Iteration 7:   log likelihood = -1036.4209  
Iteration 8:   log likelihood = -1036.4208  
Iteration 9:   log likelihood = -1036.4208  

Multinomial logistic regression                         Number of obs = 23,271
                                                        LR chi2(63)   =  55.79
                                                        Prob > chi2   = 0.7285
Log likelihood = -1036.4208                             Pseudo R2     = 0.0262

--------------------------------------------------------------------------------------------
                      drug | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
control                    |  (base outcome)
---------------------------+----------------------------------------------------------------
sotrovimab                 |
                       age |  -.0014258   .0079383    -0.18   0.857    -.0169845    .0141329
                           |
                       sex |
                   Female  |   .4349019   .3102177     1.40   0.161    -.1731137    1.042917
                           |
                region_nhs |
            East Midlands  |   .5436778   .7312933     0.74   0.457    -.8896307    1.976986
                   London  |   .1597113   .6907502     0.23   0.817    -1.194134    1.513557
               North East  |   .7053705   .7079948     1.00   0.319    -.6822738    2.093015
               North West  |  -.0066975   .8172506    -0.01   0.993    -1.608479    1.595084
               South East  |   .0612653   .8174504     0.07   0.940    -1.540908    1.663439
               South West  |    .695264   .7079626     0.98   0.326    -.6923171    2.082845
            West Midlands  |   1.204062   .6593666     1.83   0.068    -.0882724    2.496397
 Yorkshire and The Humber  |  -1.099702   1.155401    -0.95   0.341    -3.364248    1.164843
                           |
drugs_consider_risk_contra |  -13.74047   1148.998    -0.01   0.990    -2265.736    2238.255
            downs_syndrome |  -.2164098   .4128194    -0.52   0.600    -1.025521    .5927013
              solid_cancer |   .5258899   .4133327     1.27   0.203    -.2842274    1.336007
              haem_disease |  -.2510209    .307197    -0.82   0.414    -.8531159    .3510742
             renal_disease |   .4040825   .3050298     1.32   0.185    -.1937649     1.00193
             liver_disease |   -.177764   .4128808    -0.43   0.667    -.9869955    .6314675
              imid_on_drug |  -.0206094   .3392369    -0.06   0.952    -.6855015    .6442827
          immunosupression |   .1389375   .4761208     0.29   0.770    -.7942422    1.072117
                  hiv_aids |  -.2006901   .4130113    -0.49   0.627    -1.010177    .6087971
               solid_organ |   .6994088   .3024058     2.31   0.021     .1067043    1.292113
                rare_neuro |   .0888879   .3073698     0.29   0.772    -.5135459    .6913217
                     _cons |     -7.163    .791299    -9.05   0.000    -8.713918   -5.612083
---------------------------+----------------------------------------------------------------
paxlovid                   |
                       age |   .0027242   .0072467     0.38   0.707     -.011479    .0169274
                           |
                       sex |
                   Female  |   -.016645   .2779474    -0.06   0.952     -.561412    .5281219
                           |
                region_nhs |
            East Midlands  |   .2279027   .6717981     0.34   0.734    -1.088797    1.544603
                   London  |   .3323093   .5846038     0.57   0.570     -.813493    1.478112
               North East  |    .004968   .7078363     0.01   0.994    -1.382366    1.392302
               North West  |   .4046855   .6463691     0.63   0.531    -.8621748    1.671546
               South East  |   .5816922   .6278011     0.93   0.354    -.6487752     1.81216
               South West  |   .0058105   .7078977     0.01   0.993    -1.381643    1.393265
            West Midlands  |  -.0209529   .7078817    -0.03   0.976    -1.408376     1.36647
 Yorkshire and The Humber  |   .5545322   .6278151     0.88   0.377    -.6759628    1.785027
                           |
drugs_consider_risk_contra |  -13.92303   1197.025    -0.01   0.991    -2360.049    2332.203
            downs_syndrome |   .3499255   .3208486     1.09   0.275    -.2789262    .9787772
              solid_cancer |   .3646547   .4073221     0.90   0.371     -.433682    1.162991
              haem_disease |  -.0628832   .2786775    -0.23   0.821    -.6090811    .4833146
             renal_disease |   .3556467   .2811988     1.26   0.206    -.1954928    .9067862
             liver_disease |   .0344915   .3524103     0.10   0.922      -.65622     .725203
              imid_on_drug |   .1503083    .300982     0.50   0.618    -.4396056    .7402222
          immunosupression |  -.0398898   .4711754    -0.08   0.933    -.9633767    .8835971
                  hiv_aids |   .2416791   .3298176     0.73   0.464    -.4047515    .8881096
               solid_organ |  -.5348748   .3399856    -1.57   0.116    -1.201234    .1314847
                rare_neuro |  -.1263175   .2787163    -0.45   0.650    -.6725914    .4199564
                     _cons |  -6.586795   .6960879    -9.46   0.000    -7.951102   -5.222488
---------------------------+----------------------------------------------------------------
molnupiravir               |
                       age |  -.0044828   .0073459    -0.61   0.542    -.0188806     .009915
                           |
                       sex |
                   Female  |   .0993638   .2757388     0.36   0.719    -.4410743     .639802
                           |
                region_nhs |
            East Midlands  |  -.5631135   .6279048    -0.90   0.370    -1.793784    .6675574
                   London  |  -.3275981   .4937019    -0.66   0.507    -1.295236    .6400399
               North East  |   .2476195   .5050401     0.49   0.624    -.7422409     1.23748
               North West  |  -.3469341   .5865002    -0.59   0.554    -1.496453    .8025852
               South East  |  -.3138069   .5866992    -0.53   0.593    -1.463716    .8361025
               South West  |   .1179366   .5186513     0.23   0.820    -.8986011    1.134474
            West Midlands  |  -1.267309   .8024526    -1.58   0.114    -2.840087    .3054689
 Yorkshire and The Humber  |  -.8598742   .6908766    -1.24   0.213    -2.213967     .494219
                           |
drugs_consider_risk_contra |  -13.87693   1131.433    -0.01   0.990    -2231.444     2203.69
            downs_syndrome |   .3184928   .3199382     1.00   0.320    -.3085745    .9455601
              solid_cancer |  -.6033007   .5951308    -1.01   0.311    -1.769736    .5631342
              haem_disease |  -.2301828    .279332    -0.82   0.410    -.7776634    .3172978
             renal_disease |   .0107221   .2905724     0.04   0.971    -.5587893    .5802335
             liver_disease |  -.1212509   .3664577    -0.33   0.741    -.8394947     .596993
              imid_on_drug |   .3063907   .2906603     1.05   0.292     -.263293    .8760743
          immunosupression |   .1235098    .434491     0.28   0.776     -.728077    .9750966
                  hiv_aids |  -.4109973   .4063366    -1.01   0.312    -1.207402    .3854079
               solid_organ |  -.0566386   .2997059    -0.19   0.850    -.6440514    .5307742
                rare_neuro |   .5428817   .2997201     1.81   0.070    -.0445589    1.130322
                     _cons |  -5.891876   .6185726    -9.52   0.000    -7.104256   -4.679496
--------------------------------------------------------------------------------------------
Note: 342 observations completely determined. Standard errors questionable.

. predict p
(option pr assumed; predicted probabilities)

. br drug p

. do "C:\Users\k1635179\AppData\Local\Temp\STD2fe8_000000.tmp"

. gen no_drug=1 if drug==0
(149 missing values generated)

. replace no_drug=0 if drug >0
(149 real changes made)

. 
end of do-file

. logitistic no_drug age i.sex i.region_nhs drugs_consider_risk_contra downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro
command logitistic is unrecognized
r(199);

. log no_drug age i.sex i.region_nhs drugs_consider_risk_contra downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro
no_drug invalid
r(198);

. logistic no_drug age i.sex i.region_nhs drugs_consider_risk_contra downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro
note: drugs_consider_risk_contra != 0 predicts success perfectly;
      drugs_consider_risk_contra omitted and 343 obs not used.


Logistic regression                                     Number of obs = 22,928
                                                        LR chi2(20)   =  10.79
                                                        Prob > chi2   = 0.9516
Log likelihood = -893.51045                             Pseudo R2     = 0.0060

--------------------------------------------------------------------------------------------
                   no_drug | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       age |   1.000996   .0043318     0.23   0.818     .9925418    1.009522
                           |
                       sex |
                   Female  |   .8568608   .1414988    -0.94   0.350     .6199347    1.184335
                           |
                region_nhs |
            East Midlands  |   .9915253   .3761258    -0.02   0.982     .4714205    2.085447
                   London  |    .992183   .3258761    -0.02   0.981     .5212189    1.888702
               North East  |    .736911   .2605454    -0.86   0.388     .3685196    1.473566
               North West  |   1.006387   .3816541     0.02   0.987     .4785882    2.116254
               South East  |   .9052085    .337663    -0.27   0.789      .435744    1.880467
               South West  |   .7817663   .2796335    -0.69   0.491     .3877992    1.575967
            West Midlands  |   .8890492   .3265337    -0.32   0.749     .4328057    1.826243
 Yorkshire and The Humber  |   1.282672   .5183846     0.62   0.538      .580908      2.8322
                           |
drugs_consider_risk_contra |          1  (omitted)
            downs_syndrome |   .8274444   .1639217    -0.96   0.339      .561191     1.22002
              solid_cancer |    .856817   .2217734    -0.60   0.550     .5159031     1.42301
              haem_disease |   1.191995   .1980288     1.06   0.290     .8607209     1.65077
             renal_disease |   .7794944   .1310926    -1.48   0.139     .5606102     1.08384
             liver_disease |   1.085432   .2351294     0.38   0.705     .7099259    1.659558
              imid_on_drug |   .8526483   .1518229    -0.90   0.371      .601457    1.208746
          immunosupression |   .9281778   .2466138    -0.28   0.779     .5514038    1.562401
                  hiv_aids |   1.097556    .237809     0.43   0.667     .7177869    1.678254
               solid_organ |   .9615832   .1692131    -0.22   0.824     .6810799    1.357612
                rare_neuro |   .8488599   .1431964    -0.97   0.331     .6098804    1.181483
                     _cons |   205.5683    80.9735    13.52   0.000     94.98771    444.8822
--------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. predict p_bin
(option pr assumed; Pr(no_drug))
(343 missing values generated)

. br drug p p_bin

. ssc install psmatch
nothing to install

. ssc install psmatch2
checking psmatch2 consistency and verifying not already installed...
installing into C:\users\PUBLIC\documents\...
installation complete.

. psmatch2 drug age i.sex i.region_nhs, logit

Logistic regression                                     Number of obs = 23,271
                                                        LR chi2(10)   =   3.98
                                                        Prob > chi2   = 0.9481
Log likelihood = -899.13161                             Pseudo R2     = 0.0022

-------------------------------------------------------------------------------------------
                     drug | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
                      age |  -.0009115    .004331    -0.21   0.833    -.0094001    .0075771
                          |
                      sex |
                  Female  |   .1562779   .1650589     0.95   0.344    -.1672316    .4797874
                          |
               region_nhs |
           East Midlands  |    .012709   .3791518     0.03   0.973    -.7304149    .7558329
                  London  |   .0123491   .3283293     0.04   0.970    -.6311645    .6558627
              North East  |   .3021131   .3534672     0.85   0.393    -.3906699    .9948962
              North West  |  -.0015545   .3791195    -0.00   0.997    -.7446151    .7415061
              South East  |   .0972623   .3728665     0.26   0.794    -.6335426    .8280672
              South West  |   .2557486   .3575731     0.72   0.474    -.4450818    .9565791
           West Midlands  |   .1254705   .3671521     0.34   0.733    -.5941344    .8450754
Yorkshire and The Humber  |  -.2414021   .4040177    -0.60   0.550    -1.033262     .550458
                          |
                    _cons |  -5.150214   .3521334   -14.63   0.000    -5.840383   -4.460045
-------------------------------------------------------------------------------------------

. psmatch2 no_drug age i.sex i.region_nhs, logit

Logistic regression                                     Number of obs = 23,271
                                                        LR chi2(10)   =   3.98
                                                        Prob > chi2   = 0.9481
Log likelihood = -899.13161                             Pseudo R2     = 0.0022

-------------------------------------------------------------------------------------------
                  no_drug | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
                      age |   .0009115    .004331     0.21   0.833    -.0075771    .0094001
                          |
                      sex |
                  Female  |  -.1562779   .1650589    -0.95   0.344    -.4797874    .1672316
                          |
               region_nhs |
           East Midlands  |   -.012709   .3791518    -0.03   0.973    -.7558329    .7304149
                  London  |  -.0123491   .3283293    -0.04   0.970    -.6558627    .6311645
              North East  |  -.3021131   .3534672    -0.85   0.393    -.9948962    .3906699
              North West  |   .0015545   .3791195     0.00   0.997    -.7415061    .7446151
              South East  |  -.0972623   .3728665    -0.26   0.794    -.8280672    .6335426
              South West  |  -.2557486   .3575731    -0.72   0.474    -.9565791    .4450818
           West Midlands  |  -.1254705   .3671521    -0.34   0.733    -.8450754    .5941344
Yorkshire and The Humber  |   .2414021   .4040177     0.60   0.550     -.550458    1.033262
                          |
                    _cons |   5.150214   .3521334    14.63   0.000     4.460045    5.840383
-------------------------------------------------------------------------------------------

. gen psweight=cond(drug ==1,1/_pscore,1/(1-_pscore)) if _pscore!=.

. sum psweight,de

                          psweight
-------------------------------------------------------------
      Percentiles      Smallest
 1%     112.8708       1.005172
 5%     117.5407       1.005443
10%     123.9797       1.005449       Obs              23,271
25%     140.7024       1.005495       Sum of wgt.      23,271

50%     156.3543                      Mean            160.163
                        Largest       Std. dev.      27.62063
75%     178.8082       240.1994
90%     191.8991       240.1994       Variance       762.8992
95%     224.3935       240.1994       Skewness       .2235649
99%     234.3844         241.95       Kurtosis       5.190739

. tab drug

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     23,122       99.36       99.36
  sotrovimab |         44        0.19       99.55
    paxlovid |         52        0.22       99.77
molnupiravir |         53        0.23      100.00
-------------+-----------------------------------
       Total |     23,271      100.00

. bys drug: sum psweight,de

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control

                          psweight
-------------------------------------------------------------
      Percentiles      Smallest
 1%      113.075       111.8558
 5%     117.6612       111.8558
10%     124.7669       111.8558       Obs              23,122
25%     140.8298       111.8558       Sum of wgt.      23,122

50%     156.3828                      Mean            160.471
                        Largest       Std. dev.      26.76378
75%     178.8082       240.1994
90%     191.8991       240.1994       Variance       716.3001
95%     224.3935       240.1994       Skewness       .6119118
99%     234.3844         241.95       Kurtosis       3.504392

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab

                          psweight
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.005172       1.005172
 5%     1.005449       1.005443
10%     1.005505       1.005449       Obs                  44
25%     1.006246       1.005495       Sum of wgt.          44

50%      1.00667                      Mean           1.006884
                        Largest       Std. dev.      .0010368
75%     1.007448       1.008706
90%      1.00848       1.008769       Variance       1.08e-06
95%     1.008769       1.008785       Skewness       .3878139
99%     1.008906       1.008906       Kurtosis       2.274806

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid

                          psweight
-------------------------------------------------------------
      Percentiles      Smallest
 1%     113.8952       113.8952
 5%     123.5321       117.5549
10%     132.6311       123.5321       Obs                  52
25%     142.1473       124.5415       Sum of wgt.          52

50%     158.9439                      Mean           164.0612
                        Largest       Std. dev.      27.53112
75%     180.3555       203.5513
90%     192.5964       229.5425       Variance       757.9628
95%     229.5425       231.0054       Skewness       .5728126
99%     235.4505       235.4505       Kurtosis       3.233102

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir

                          psweight
-------------------------------------------------------------
      Percentiles      Smallest
 1%      113.075        113.075
 5%     115.8674       113.5869
10%     119.9013       115.8674       Obs                  53
25%     134.8086        116.287       Sum of wgt.          53

50%     152.9797                      Mean           154.0669
                        Largest       Std. dev.      25.16467
75%     179.4577       183.8288
90%     181.7914       194.8803       Variance       633.2605
95%     194.8803       196.2992       Skewness       .0383899
99%     206.1526       206.1526       Kurtosis       1.871126


. teffects ipw (failure) (drug age i.sex i.region_nhs ) if _pscore!=.
variable failure not found
    The outcome model is misspecified.
r(111);

. teffects ipw (fail_ae_all) (drug age i.sex i.region_nhs ) if _pscore!=.

Iteration 0:   EE criterion =  9.590e-17  
Iteration 1:   EE criterion =  2.841e-20  

Treatment-effects estimation                    Number of obs     =     23,271
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: (multinomial) logit
--------------------------------------------------------------------------------------------
                           |               Robust
               fail_ae_all | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
ATE                        |
                      drug |
  (sotrovimab vs control)  |   .0334115     .04503     0.74   0.458    -.0548457    .1216686
    (paxlovid vs control)  |    .032287   .0486791     0.66   0.507    -.0631222    .1276962
(molnupiravir vs control)  |   .0259972   .0545836     0.48   0.634    -.0809847    .1329791
---------------------------+----------------------------------------------------------------
POmean                     |
                      drug |
                  control  |   .1374854   .0022646    60.71   0.000     .1330468     .141924
--------------------------------------------------------------------------------------------

. teffects ipw (fail_ae_all) (no_drug age i.sex i.region_nhs ) if _pscore!=.

Iteration 0:   EE criterion =  6.123e-18  
Iteration 1:   EE criterion =  1.425e-29  

Treatment-effects estimation                    Number of obs     =     23,271
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-------------------------------------------------------------------------------------------
                          |               Robust
              fail_ae_all | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
ATE                       |
                  no_drug |
                (1 vs 0)  |  -.0397544   .0312281    -1.27   0.203    -.1009604    .0214516
--------------------------+----------------------------------------------------------------
POmean                    |
                  no_drug |
                       0  |   .1772395    .031146     5.69   0.000     .1161945    .2382845
-------------------------------------------------------------------------------------------

. tebalance summarize

Covariate balance summary

                         Raw     Weighted
-----------------------------------------
Number of obs =       23,271     23,271.0
Treated obs   =       23,122     11,635.2
Control obs   =          149     11,635.8
-----------------------------------------

-----------------------------------------------------------------
                |Standardized differences          Variance ratio
                |        Raw    Weighted           Raw   Weighted
----------------+------------------------------------------------
            age |   .0173668    .0046257      1.132819   1.121998
                |
            sex |
        Female  |  -.0778386    .0003828      1.000862   .9999926
                |
     region_nhs |
 East Midlands  |   .0181879   -.0032335      1.043999   .9914016
        London  |   .0267872    .0016859      1.035637   1.002557
    North East  |  -.0833163     .000161      .8105834   1.000426
    North West  |   .0223618   -.0095295      1.055708   .9752446
    South East  |   -.008328    .0052914      .9713897   1.014474
    South West  |  -.0660442    .0048572      .8422982   1.013085
 West Midlands  |  -.0199003    .0041546      .9433585   1.011087
Yorkshire an~r  |   .0952819    .0089887      1.315924   1.024397
-----------------------------------------------------------------

. help psmatch2

. exit, clear
